{"input": "Infer the correct answer for the question.\n\nQ: Alec and his roommates ate 3.25 pints of ice cream on Friday night and 0.25 pint of ice cream on Saturday night . How many pints did they eat in all ?\nA:", "output": "We know that Alec and his roommates ate 3.25 pints of ice cream on Friday night. \nWe also know that they ate 0.25 pints of ice cream on Saturday night. \n\nIn order to find the total number of pints that they ate, we need to add 3.25 and 0.25. \n\n3.25 + 0.25 = 3.5 \n\nTherefore, Alec and his roommates ate 3.5 pints of ice cream in all.\n\n-->\n\n3.5 END"}
{"input": "Infer the correct answer for the question.\n\nQ: Melanie picked 4 plums , Dan picked 9 plums , and Sally picked 3 plums from the plum tree . How many plums were picked in total ?\nA:", "output": "Melanie picked 4 plums. \nDan picked 9 plums. \nSally picked 3 plums. \n\n4 + 9 + 3 = 16. \n\n16 plums were picked in total.\n\n-->\n\n16 END"}
{"input": "Infer the correct answer for the question.\n\nQ: Abe 's family moved from the Bahamas to Japan , so they had convert their money into Japanese yen . Their checking account now has 6359 yen and their savings account now has 3485 yen . How many yen do they have ?\nA:", "output": "Abe's family moved from the Bahamas to Japan, so they had to convert their money into Japanese yen. \n\nThis means that they had some amount of money in Bahamian dollars, which they then converted into Japanese yen. So, we can represent this with the equation:\n\nBahamian dollars + Japanese yen = total money\n\nWe know that their checking account now has 6359 yen, and their savings account now has 3485 yen. So, we can represent this with the equation:\n\nchecking account + savings account = total money\n\nNow, we can set the two equations equal\n\n-->\n\n9844.0 END"}
{"input": "Infer the correct answer for the question.\n\nQ: A truck carrying 4.1 pounds of sand travels to a construction yard and loses 2.4 pounds of sand along the way . How much sand does the truck have when it arrives at the yard ?\nA:", "output": "A truck carrying 4.1 pounds of sand loses 2.4 pounds of sand along the way. \nThis means that the truck had 4.1 pounds of sand to start with, and it lost 2.4 pounds of sand along the way. \nThis means that the truck has 4.1 - 2.4 = 1.7 pounds of sand when it arrives at the yard.\n\n-->\n\n1.7 END"}
{"input": "Infer the correct answer for the question.\n\nQ: Jason found 49 seashells and 48 starfish on the beach . He gave 13 of the seashells to Tim . How many seashells does Jason now have ?\nA:", "output": "Jason found 49 seashells and 48 starfish on the beach. \n\nHe gave 13 of the seashells to Tim. \n\nHow many seashells does Jason now have?\n\nJason now has 49 - 13 = 36 seashells.\n\n-->\n\n36 END"}
