{"input": "Infer the correct choice for the question.\n\nQ: Let d > c > b > q. If c is twice as far from q as it is from d, and b is twice as far from c as it is from q, then (d - b)/(d - q) = ? Answer choices: (A) 2/9, (B) 1/3, (C) 2/3, (D) 7/9, (E) 3/2.\nA:", "output": "First, we know that c is twice as far from q as it is from d. So we can set up the following equation: \n\n2(c - q) = c - d \n\nWe also know that b is twice as far from c as it is from q. So we can set up the following equation: \n\n2(b - c) = b - q \n\nNow, we can solve for c in the first equation and plug it into the second equation. \n\n2(c - q) = c - d\nc - q = (1/\n\n-->\n\nD END"}
{"input": "Infer the correct choice for the question.\n\nQ: A bus can hold 40 passengers. If there are 10 rows of seats on the bus, how many seats are in each row? Answer choices: (A) 0, (B) 2, (C) 4, (D) 6, (E) 5.\nA:", "output": "There are 10 rows of seats. \nThere are 40 passengers. \nHow many passengers can fit in each row? \nThere are 4 seats in each row.\n\n-->\n\nC END"}
{"input": "Infer the correct choice for the question.\n\nQ: Five times a number equals one hundred. The number is Answer choices: (A) 50, (B) 10, (C) 15, (D) 25, (E) 20.\nA:", "output": "We know that five times a number equals one hundred. \nThat means that if we divide one hundred by five, we will get the number we are looking for. \n\nOne hundred divided by five equals twenty. \n\nTherefore, the answer is (E) 20.\n\n-->\n\nE END"}
{"input": "Infer the correct choice for the question.\n\nQ: For the integer n, if n*n*n is odd, then what is true Answer choices: (A) n is odd and n*n is even, (B) n*n is odd, (C) n is even, (D) n*n is odd, (E) None of these.\nA:", "output": "n*n*n is odd \nn*n is even\nn is odd\n\n-->\n\nA END"}
{"input": "Infer the correct choice for the question.\n\nQ: The ratio between the speeds of two trains is 7 : 8. If the second train runs 400 km in 4 hours, then the speed of the first train is? Answer choices: (A) 70 km/hr, (B) 75 km/hr, (C) 84 km/hr, (D) 87.5 km/hr, (E) 90.5 km/hr.\nA:", "output": "The ratio of the speeds of the two trains is 7:8. \nThe second train runs 400 km in 4 hours. \n\nWe want to find the speed of the first train. \n\nWe can set up a proportion: \n\n$$\\frac{7}{8} = \\frac{x}{400}$$\n\nCross multiply to solve for x: \n\n$$7x = 8 \\cdot 400$$\n\n$$7x = 3200$$\n\n$$x = 3200 \\div 7$$\n\n$$x = 457.14$$\n\nThe speed\n\n-->\n\nD END"}
