{"input": "Infer the correct choice for the question.\n\nQ: Where is the most likely place for a skylight? Answer choices: (A) admit light into room, (B) house, (C) office building, (D) windowless room, (E) roof.\nA:", "output": "A skylight is a window in the roof, so (E) is the most likely place for a skylight.\n\n-->\n\nE END"}
{"input": "Infer the correct choice for the question.\n\nQ: Where can you buy grapes directly from their growers? Answer choices: (A) grocery cart, (B) kitchen, (C) fridge, (D) fruit market, (E) super market.\nA:", "output": "The first step is to identify where grapes are grown. Grapes are grown on grape vines, which are usually found in vineyards. \n\nThe second step is to find out if there are any vineyards near you. You can do this by searching online or asking around. \n\nThe third step is to contact the vineyard and ask if they sell grapes directly to consumers. Some vineyards do this, while others only sell to businesses.\n\n-->\n\nD END"}
{"input": "Infer the correct choice for the question.\n\nQ: God didn't kill off everyone in the flood, so what does that suggest he has? Answer choices: (A) everything, (B) imagination, (C) compassion, (D) strength, (E) heaven.\nA:", "output": "First, we need to remember what the question is asking. It's asking what God has, based on the fact that He didn't kill everyone in the flood. \n\nNext, we need to look at the answer choices. \n\nA) Everything - this could be true, but it's a bit of a stretch. Just because God has everything doesn't mean He didn't kill everyone in the flood. \n\nB) Imagination - again, this could be true, but it's not necessarily implied by the fact that God didn't kill everyone in the flood. \n\nC) Comp\n\n-->\n\nC END"}
{"input": "Infer the correct choice for the question.\n\nQ: A regular everyday human would just call it a meeting, but people like cardinals might call it a what? Answer choices: (A) conclave, (B) sanctuary, (C) homes, (D) mortuary, (E) stadium.\nA:", "output": "A meeting is a gathering of people for a purpose. A conclave is a meeting of cardinals to elect a new pope. A sanctuary is a place of refuge or safety. A home is a place where someone lives. A mortuary is a place where dead bodies are kept. A stadium is a large sports arena. \n\nThe best answer is A, conclave.\n\n-->\n\nA END"}
{"input": "Infer the correct choice for the question.\n\nQ: What is a marmot likely to be good at finding? Answer choices: (A) food, (B) hiding place, (C) yellow pages, (D) jungle, (E) high mountains.\nA:", "output": "A marmot is a type of rodent, so it is likely to be good at finding food. It is also likely to be good at finding a hiding place.\n\n-->\n\nB END"}
