{"input": "Infer the correct answer for the question.\n\nQ: Ray always takes the same route when he walks his dog. First, he walks 4 blocks to the park. Then he walks 7 blocks to the high school. Finally, he walks 11 blocks to get back home. Ray walks his dog 3 times each day. How many blocks does Ray's dog walk each day?\nA:", "output": "Ray walks 4 blocks to the park. \nThen he walks 7 blocks to the high school. \nFinally, he walks 11 blocks to get back home. \n\nThis means that, in total, Ray and his dog walk 4 + 7 + 11 = 22 blocks in one day. However, Ray walks his dog 3 times each day. This means that, in total, Ray's dog walks 22 * 3 = 66 blocks in one day.\n\n-->\n\n66 END"}
{"input": "Infer the correct answer for the question.\n\nQ: In a survey about the student's favorite sports, 40% said they like basketball, 10% like chess, 28% like soccer, and the rest said they like badminton. If 250 students were interviewed, how many students identified chess or basketball as their favorite sport?\nA:", "output": "First, we need to find out how many students like chess. 10% of 250 is 25. \n\nNext, we need to find out how many students like basketball. 40% of 250 is 100. \n\nNow we need to add those two numbers together to get our final answer: 25 + 100 = 125.\n\n-->\n\n125 END"}
{"input": "Infer the correct answer for the question.\n\nQ: Candy throws 4 pebbles into the lake.  Lance throws in 3 times as many pebbles as Candy. How many more pebbles did Lance throw compared to Candy?\nA:", "output": "Candy throws 4 pebbles into the lake. \nLance throws in 3 times as many pebbles as Candy. \n\nHow many more pebbles did Lance throw compared to Candy?\n\nLance threw in 12 pebbles. Candy threw in 4. Therefore, Lance threw in 8 more pebbles than Candy.\n\n-->\n\n8 END"}
{"input": "Infer the correct answer for the question.\n\nQ: Howard is taking his kindergarten class to the museum on a school trip. He splits the class equally into 3 groups and then each of the groups goes through the museum one student at a time. If the class has 18 students in total and each student takes 4 minutes to go through the museum, then how long, in minutes, does it take each group to go through the museum?\nA:", "output": "There are 18 students in total. \nEach student takes 4 minutes to go through the museum. \nThat means that it would take 72 minutes for the entire class to go through the museum if they all went at the same time. \nHowever, Howard splits the class into 3 groups. \nThat means that each group has 6 students. \nSince each student takes 4 minutes to go through the museum, each group would take 24 minutes to go through the museum.\n\n-->\n\n24 END"}
{"input": "Infer the correct answer for the question.\n\nQ: Julian has 80 Facebook friends. 60% are boys and 40% are girls. Boyd has twice as many friends who are girls and has 100 friends total. What percentage of Boyd’s friends are boys?\nA:", "output": "Julian has 80 Facebook friends. 60% are boys and 40% are girls. \n\nThis means that Julian has 48 friends who are boys and 32 friends who are girls. \n\nBoyd has twice as many friends who are girls and has 100 friends total. \n\nThis means that Boyd has 64 friends who are girls and 36 friends who are boys. \n\nTherefore, the percentage of Boyd's friends who are boys is 36%.\n\n-->\n\n36 END"}
