{"input": "Infer the correct answer for the question.\n\nQ: Oliver had 11 socks. If he threw away 4 old ones that didn't fit and bought 26 new ones, how many socks would he have?\nA:", "output": "Oliver had 11 socks. \nHe threw away 4 old ones that didn't fit. \nThat means he has 11 - 4 = 7 socks left. \nHe bought 26 new ones. \nThat means he has 26 + 7 = 33 socks in total.\n\n-->\n\n33 END"}
{"input": "Infer the correct answer for the question.\n\nQ: Kaleb had 34 books. If he sold 17 of them and used the money he earned to buy 7 new books, how many books would Kaleb have?\nA:", "output": "Kaleb had 34 books. \nKaleb sold 17 books. \nKaleb now has 34 - 17 = 17 books. \nKaleb used the money he earned to buy 7 new books. \nKaleb now has 17 + 7 = 24 books.\n\n-->\n\n24 END"}
{"input": "Infer the correct answer for the question.\n\nQ: A waiter had 5 tables he was waiting on, with 5 women and 3 men at each table. How many customers total did the waiter have?\nA:", "output": "There are 5 tables. \nEach table has 5 women. \nEach table has 3 men. \n\nSo, we can say that there are 5 * 5 = 25 women and 5 * 3 = 15 men. \n\nTherefore, the waiter had a total of 25 + 15 = 40 customers.\n\n-->\n\n40 END"}
{"input": "Infer the correct answer for the question.\n\nQ: While playing a trivia game, Mike answered 3 questions correct in the first half and 5 questions correct in the second half. If each question was worth 3 points, what was his final score?\nA:", "output": "In the first half, Mike answered 3 questions correctly. This means he earned 3*3 = 9 points. \nIn the second half, Mike answered 5 questions correctly. This means he earned 5*3 = 15 points. \n\nMike's final score is 9 + 15 = 24 points.\n\n-->\n\n24 END"}
{"input": "Infer the correct answer for the question.\n\nQ: A worksheet had 4 problems on it. If a teacher had 9 worksheets to grade and had already graded 5 of them, how many more problems does she have to grade?\nA:", "output": "The teacher has already graded 5 worksheets. Each worksheet has 4 problems. So the teacher has graded 5*4=20 problems so far. The teacher has 9 worksheets left to grade. Each worksheet has 4 problems. So the teacher has 9*4=36 problems left to grade. So the teacher has 36-20=16 problems left to grade.\n\n-->\n\n16 END"}
