{"input": "Infer the correct answer for the question.\n\nQ: Jerry had 7 books and 3 action figures on a shelf in his room. Later he added 2 more action figures to the shelf. How many more books than action figures were on his shelf?\nA:", "output": "Jerry had 7 books and 3 action figures on a shelf in his room. \n\nThat means that there were 4 more books than action figures. \n\nLater he added 2 more action figures to the shelf. \n\nThat means that there are now 2 more books than action figures.\n\n-->\n\n2.0 END"}
{"input": "Infer the correct answer for the question.\n\nQ: Paco had 40 cookies. He ate 5 cookies and gave 13 of them to his friend. How many cookies did paco have left?\nA:", "output": "Paco had 40 cookies. \nHe ate 5 cookies. \nThat means he had 35 cookies left. \nHe gave 13 cookies to his friend. \nThat means he had 22 cookies left.\n\n-->\n\n22.0 END"}
{"input": "Infer the correct answer for the question.\n\nQ: Kelly has 46 nintendo games and 132 sony games. How many sony games does she need to give away so that she will have 31 sony games left?\nA:", "output": "Kelly has 46 Nintendo games and 132 Sony games. \nWe want to know how many Sony games she needs to give away so that she will have 31 Sony games left. \nThat means she would have to give away 101 Sony games.\n\n-->\n\n101.0 END"}
{"input": "Infer the correct answer for the question.\n\nQ: The Razorback t-shirt shop sells each t-shirt for $ 201 dollars. During the Arkansas and Texas tech game they increased the prices by $ 217 per t-shirt and sold 14 t-shirts. How much money did they make from selling the t-shirts?\nA:", "output": "The Razorback t-shirt shop sells each t-shirt for $201 dollars. \n\nDuring the Arkansas and Texas tech game they increased the prices by $217 per t-shirt. \n\nThis means that each t-shirt now costs $418. \n\nIf they sold 14 t-shirts, they made $5852 from selling the t-shirts.\n\n-->\n\n5852.0 END"}
{"input": "Infer the correct answer for the question.\n\nQ: There were 174 parents in the program and 521 pupils too. How many more pupils were present compared to parents in the program?\nA:", "output": "There were 174 parents in the program. \nThere were 521 pupils in the program too. \nHow many more pupils were present compared to parents in the program? \nThere were 521-174=347 more pupils than parents in the program.\n\n-->\n\n347.0 END"}
