[
  {
    "input": "Infer the correct answer for the question.\n\nQ: Each pack of dvds costs 76 dollars. If there is a discount of 25 dollars on each pack How much do you have to pay to buy each pack?\nA:",
    "output": "A \"pack of DVDs\" costs $76.\nThere is a \"discount of $25 on each pack.\"\n\nSo, if we want to know how much we have to pay for ONE \"pack of DVDs,\" we have to take $76 and subtract $25 from it. \n\n$76 - $25 = \n\n$51\n\nTherefore, we would have to pay $51 for ONE \"pack of DVDs.\"\n\n-->\n\n51.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dan had $ 3 left with him after he bought a candy bar. If he had $ 4 at the start How much did the candy bar cost?\nA:",
    "output": "Dan had $3 left with him after he bought a candy bar. \n\nThat means he spent $4 - $3 = $1 on the candy bar.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paco had 26 salty cookies and 17 sweet cookies. He ate 14 sweet cookies and 9 salty cookies. How many salty cookies did Paco have left?\nA:",
    "output": "Paco had 26 salty cookies and 17 sweet cookies. \nHe ate 14 sweet cookies and 9 salty cookies. \n\nWe want to know how many salty cookies Paco has left. \n\nWe can subtract 9 from 26 to find out how many salty cookies Paco has left. \n\n26 - 9 = 17 \n\nPaco has 17 salty cookies left.\n\n-->\n\n17.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 43 children were riding on the bus. At the bus stop some children got off the bus. Then there were 21 children left on the bus. How many children got off the bus at the bus stop?\nA:",
    "output": "There were 43 children on the bus. \nSome children got off the bus. \nNow there are 21 children left on the bus. \n\nWe want to know how many children got off the bus. \n\nWe can solve this problem by using subtraction. \n\n43 - 21 = 22 \n\nSo, 22 children got off the bus at the bus stop.\n\n-->\n\n22.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jerry had some action figures on a shelf in his room. Later he added 7 more action figures to the shelf. If there are a total of 10 action figures on his shelf now How many action figures did he have initially on the shelf?\nA:",
    "output": "Jerry had some action figures on a shelf in his room. \n\nThis means that there is an unknown number of action figures on the shelf. We'll call this number \"x.\" \n\nLater he added 7 more action figures to the shelf. \n\nThis means that the number of action figures on the shelf increased by 7. So now there are x + 7 action figures on the shelf. \n\nIf there are a total of 10 action figures on his shelf now\n\nThis means that the number of action figures on the shelf is 10. So now we have the equation:\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Mary is baking a cake. The recipe calls for 3 cups of sugar 10 cups of flour and 15 cups of salt. She already put in 6 cups of flour. How many more cups of flour does she need to add?\nA:",
    "output": "First, we need to realize that the recipe is for a very large cake. It would be impossible for one person to eat that much cake, so this is probably meant for a party or an event. \nSecond, we need to think about what the recipe is telling us. It is telling us that we need 3 cups of sugar, 10 cups of flour, and 15 cups of salt. \nThird, we need to think about what Mary has already put in the cake. She has already put in 6 cups of flour. \nThis means that she needs to add 4 more cups of flour to the cake.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: After resting they decided to go for a swim. The depth of the water is 15 times Dean's height. Dean is 4 feet taller than Ron. If Ron stands at 13 feet How deep was the water?\nA:",
    "output": "Dean is 4 feet taller than Ron. So if Ron is 13 feet, then Dean is 17 feet. \nThe depth of the water is 15 times Dean's height. So the depth of the water is 15 times 17 feet, which is 255 feet.\n\n-->\n\n255.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: In a school there are 732 girls and 761 boys. 682 more girls and 8 more boys joined the school. How many girls are there in the school now?\nA:",
    "output": "There are 732 girls and 761 boys in the school. \n682 more girls join the school. \nThat means there are now 732 + 682 = 1414 girls in the school. \n8 more boys join the school. \nThat means there are now 761 + 8 = 769 boys in the school. \nSo, there are 1414 girls and 769 boys in the school.\n\n-->\n\n1414.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: An industrial machine worked for 5 minutes. It can make 4 shirts a minute. How many shirts did machine make?\nA:",
    "output": "The machine worked for 5 minutes. \nIt can make 4 shirts a minute. \n\nThat means that in 5 minutes, the machine can make 20 shirts.\n\n-->\n\n20.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Tiffany was collecting cans for recycling. On monday she had 7 bags of cans. The next day she found 12 more bags worth of cans. How many more bags did she find on the next day than she had on monday?\nA:",
    "output": "On Monday, Tiffany had 7 bags of cans. \nOn Tuesday, Tiffany found 12 more bags of cans. \nThat means Tiffany had a total of 19 bags of cans on Tuesday. \nTherefore, Tiffany found 5 more bags of cans on Tuesday than she had on Monday.\n\n-->\n\n5.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 15 roses and 62 orchids in the vase. Jessica cut some more roses and orchids from her flower garden. There are now 17 roses and 96 orchids in the vase. How many roses did she cut?\nA:",
    "output": "There were 15 roses and 62 orchids in the vase. \n\nJessica cut some more roses and orchids from her flower garden. \n\nThere are now 17 roses and 96 orchids in the vase. \n\nHow many roses did she cut?\n\nShe cut 2 roses.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dan has $ 4. He bought a candy bar for $ 8. Then his friend have him $ 5 How much money is left?\nA:",
    "output": "Dan has $4. \nHe buys a candy bar for $8. \nThat leaves him with -$4. \nThen his friend gives him $5. \nThat leaves him with $1.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are 142 bananas and 356 oranges in Philip's collection. If the bananas are organized into 47 groups and oranges are organized into 178 groups How big is each group of oranges?\nA:",
    "output": "There are 356 oranges. \n178 groups means that there are 2 oranges in each group.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are 8 different books and 5 different movies in the ' crazy silly school ' series. If you read 19 of the movies and watched 16 of the books How many more movies than books have you read?\nA:",
    "output": "There are 8 different books and 5 different movies in the ' crazy silly school ' series. \nIf you read 19 of the movies and watched 16 of the books\nHow many more movies than books have you read?\n\nThere are 8 different books and 5 different movies in the ' crazy silly school ' series. \nIf you read 19 of the movies and watched 16 of the books, \nyou have read 3 more movies than books.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Mary is baking a cake. The recipe calls for 12 cups of flour and 5 cups of sugar. She already put in some cups of flour. If she still needs 2 more cups of flour How many cups of flour did she put in?\nA:",
    "output": "The recipe calls for 12 cups of flour and 5 cups of sugar.\nShe already put in some cups of flour.\n\nThat means that she has put in less than 12 cups of flour. \n\nIf she still needs 2 more cups of flour, that means she has put in 10 cups of flour.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jack received 4 emails in the morning, 5 emails in the afternoon and 8 emails in the evening. How many emails did Jack receive in the afternoon and evening?\nA:",
    "output": "Jack received 4 emails in the morning. Then, he received 5 more emails. So, Jack received 9 emails in the morning and afternoon. Finally, he received 8 more emails in the evening. So, Jack received a total of 17 emails today.\n\n-->\n\n13.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with 12 kids on monday. She played tag with 14 kids on tuesday. She spent a total of 34 hours to play tag on both days. How many kids did she play with altogether?\nA:",
    "output": "On Monday, Julia played with 12 kids. \nOn Tuesday, Julia played with 14 kids. \n\nSo, altogether, Julia played with 26 kids.\n\n-->\n\n26.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: At the zoo, a cage had 93 snakes and 97 alligators. If 40 alligators were hiding How many alligators were not hiding?\nA:",
    "output": "There are 97 alligators in the cage. \n40 of them are hiding. \nThat means that 97-40=57 alligators are not hiding.\n\n-->\n\n57.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: You have read 8 books from the ' crazy silly school ' series. If there are a total of 14 different books in the ' crazy silly school ' series How many more do you still have to read?\nA:",
    "output": "There are a total of 14 different books in the 'crazy silly school' series. \nYou have read 8 books from the 'crazy silly school' series. \n\nThis means that you have read 8/14, or two-sevenths, of the total number of books in the series. \n\nTo find out how many more you have to read, you can either subtract 8 from 14 to get 6, or you can take the total number of books in the series, 14, and subtract the number of books you have read, 8, to get 6.\n\n-->\n\n6.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Emily is making bead necklaces for her 43 friends. She had 20 beads and she was able to make 5 necklaces. How many beads did each necklace need?\nA:",
    "output": "Emily has 20 beads. \nShe makes 5 necklaces. \nThat means she needs 4 beads per necklace.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A waiter had 12 customers. After some left he still had 14 customers. Then he got 10 new customers How many customers does he have now?\nA:",
    "output": "The waiter had 12 customers. \nSome left, so he had 14 customers. \nThen he got 10 new customers. \n\nSo now he has 24 customers.\n\n-->\n\n24.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A farmer had 90 tomatoes in his garden. If he picked 154 of them yesterday and 50 today. How many tomatoes did he pick in all?\nA:",
    "output": "The farmer had 90 tomatoes in his garden. \nIf he picked 154 of them yesterday, that means he had 90 - 154 = -64 tomatoes in his garden yesterday. \nIf he picked 50 today, that means he had -64 + 50 = -14 tomatoes in his garden today. \n\nSo, the farmer has picked 154 + 50 = 204 tomatoes in total.\n\n-->\n\n204.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: After eating a hearty meal they went to see the Buckingham palace. There were 39 paintings in the Buckingham palace. There, Rachel learned that 661 visitors came to the Buckingham palace that day. If there were 600 visitors the previous day How many more visitors visited the Buckingham palace on that day than on the previous day?\nA:",
    "output": "There were 39 paintings in the Buckingham palace. \nThere, Rachel learned that 661 visitors came to the Buckingham palace that day. \nIf there were 600 visitors the previous day, \nthen we can say that 661-600=61 more visitors visited the Buckingham palace on that day than on the previous day.\n\n-->\n\n61.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He also had 26 aquariums for saltwater animals. The aquarium had 52 saltwater animals in total and every aquarium had the same number of animals. How many saltwater animals does each aquarium have?\nA:",
    "output": "We know that there are 26 aquariums and 52 animals in total. \nThat means that if we divide 52 by 26, we will know how many animals are in each aquarium. \n52 divided by 26 equals 2. \nSo, each aquarium has 2 saltwater animals.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Mary is baking a cake. The recipe calls for 11 cups of flour and 7 cups of sugar. She already put in some cups of flour. If she still needs 2 more cups of flour than sugar How many cups of flour did she put in?\nA:",
    "output": "The recipe calls for 11 cups of flour and 7 cups of sugar.\nShe already put in some cups of flour.\nIf she still needs 2 more cups of flour than sugar\n\nThat means she needs 9 cups of flour. So she's put in 2 cups of flour.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Baker made 149 cakes and 91 pastries. If he sold 10 cakes and 90 pastries How many cakes would baker still have?\nA:",
    "output": "Baker made 149 cakes and 91 pastries. \n\nThis means that, at the start, he had 149 cakes and 91 pastries. \n\nIf he sold 10 cakes and 90 pastries, this means that he would have 10 less cakes and 90 less pastries. \n\nThis means that he would have 139 cakes and 1 pastry left.\n\n-->\n\n139.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dave had 24 files and 13 apps on his phone. After deleting some apps and files he had 17 apps and 21 files left. How many files did he delete?\nA:",
    "output": "Dave had 24 files and 13 apps. \nAfter deleting some apps and files, he had 17 apps and 21 files left. \n\nHow many files did he delete?\n\nWe know that Dave had 24 files and 13 apps originally. We also know that after deleting some apps and files, he had 17 apps and 21 files left. So, we can set up the equation: \n\n24 - x = 21\n\nWe can solve for x to find out how many files Dave deleted. \n\n24 - 21 = x\n3 = x\n\nDave deleted 3 files.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Matthew had some crackers. If Matthew gave 2 crackers to each of his 11 friends How many crackers did Matthew have?\nA:",
    "output": "Matthew had some crackers. \n\nThat means that he had at least one cracker. \n\nIf Matthew gave 2 crackers to each of his 11 friends, \n\nthat means that he gave out 22 crackers total. \n\nThat also means that he had to have at least 22 crackers to begin with. \n\nSo we know that Matthew had at least 22 crackers.\n\n-->\n\n22.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Because of the decision Sofia asked 310 students to suggest specific types of food. 185 students suggested adding mashed potatoes while others suggested adding bacon to the menu. How many students suggested bacon?\nA:",
    "output": "There are 310 students in total. \n185 students suggested adding mashed potatoes. \nThis means that 310-185=125 students suggested adding bacon.\n\n-->\n\n125.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Because of the decision Sofia asked the students to suggest specific types of food. If 218 students suggested adding mashed potatoes as well as bacon while 351 suggested adding only bacon to the menu How many students suggested adding bacon?\nA:",
    "output": "There are 218 students who suggested adding mashed potatoes as well as bacon. \nThere are 351 students who suggested adding only bacon to the menu. \n\nWe want to know how many students suggested adding bacon. \n\nThere are a total of 569 students who suggested adding bacon.\n\n-->\n\n569.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: If each bag has 41 cookies and you had 53 bags of cookies How many cookies would you have?\nA:",
    "output": "There are 41 cookies in 1 bag. So, in 53 bags, there would be 41x53=2173 cookies.\n\n-->\n\n2173.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel had to complete 2 pages of reading homework and 4 pages of math homework. How many more pages of math homework than reading homework did she have?\nA:",
    "output": "First, we need to figure out how many pages of homework Rachel had in total. We can do this by adding 2 + 4, which equals 6. \n\nNext, we need to figure out how many pages of reading homework Rachel had. We already know that she had 2 pages of reading homework, so we don't need to do any more math. \n\nNow we need to figure out how many pages of math homework Rachel had. We already know that she had 4 pages of math homework, so we don't need to do any more math. \n\nFinally, we need to figure out how\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The Razorback shop makes $ 5 dollars off each jersey and $ 215 off each t-shirt. During the Arkansas and Texas tech game they sold 20 t-shirts and 64 jerseys. How much money did they make from selling the t-shirts?\nA:",
    "output": "The Razorback shop makes $5 dollars off each jersey and $215 off each t-shirt. \nDuring the Arkansas and Texas tech game they sold 20 t-shirts and 64 jerseys. \nHow much money did they make from selling the t-shirts?\n\nThe Razorback shop makes $5 dollars off each jersey and $215 off each t-shirt. \nDuring the Arkansas and Texas tech game they sold 20 t-shirts and 64 jerseys. \nHow much money did they make from selling the t-shirts?\n\n$215 x 20 = $4300\n\n-->\n\n4300.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Brenda's mother made 14 cookies for 2 guests. If each of them had the same number of cookies How many did each of them have?\nA:",
    "output": "There are 14 cookies. \nThere are 2 guests. \nThat means that each guest gets 7 cookies.\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: In a school there are 632 girls and 410 boys. 465 more girls joined the school. How many more girls than boys does the school have?\nA:",
    "output": "There are currently 632 + 465 = 1097 girls in the school. \nThere are 410 boys in the school. \n1097 - 410 = 687 more girls than boys.\n\n-->\n\n687.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Randy has 95 blocks. He uses 20 blocks to build a house and 50 blocks to build a tower. How many more blocks did he use to build the tower than he did to build the house?\nA:",
    "output": "Randy has 95 blocks. \nHe uses 20 blocks to build a house. \nThat means he has 95-20=75 blocks left. \nHe uses 50 blocks to build a tower. \nThat means he has 75-50=25 blocks left. \nSo he used 50-20=30 more blocks to build the tower than he did to build the house.\n\n-->\n\n30.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: After eating a hearty meal they went to see the Buckingham palace. There, Rachel learned that 317 visitors came to the Buckingham palace that day. If there were 295 visitors the previous day How many more visitors visited the Buckingham palace on that day than on the previous day?\nA:",
    "output": "The question is asking how many more visitors came on the day Rachel learned this information, than the day before. \n\nThat day, 317 people came to visit the Buckingham Palace. \nThe day before that, 295 people came to visit the Buckingham Palace. \n\n317-295=22\n\nTherefore, 22 more people visited the Buckingham Palace on the day Rachel learned this information, than the day before.\n\n-->\n\n22.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Josh had 3 marbles in his collection. He found 6 marbles while he lost 5 marbles. How many more marbles did he find than those he lost?\nA:",
    "output": "Josh had 3 marbles. \nHe found 6 marbles. \nThat means he now has 9 marbles. \nHe lost 5 marbles. \nThat means he now has 4 marbles. \nHe found 6 and lost 5, so he found 1 more marble than he lost.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paco had 40 cookies. He ate 5 cookies and gave 13 of them to his friend. How many cookies did paco have left?\nA:",
    "output": "Paco had 40 cookies. \nHe ate 5 cookies. \nThat means he had 35 cookies left. \nHe gave 13 cookies to his friend. \nThat means he had 22 cookies left.\n\n-->\n\n22.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paco had 17 cookies. He ate 14 cookies and gave 13 of them to his friend. How many more cookies did he eat than those he gave to his friend?\nA:",
    "output": "Paco had 17 cookies. \nHe ate 14 cookies. \nHe gave 13 cookies to his friend. \n\nWe want to know how many more cookies Paco ate than he gave to his friend. \n\nPaco ate 14 cookies. \nHe gave 13 cookies to his friend. \n\nPaco ate 1 more cookie than he gave to his friend.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Ed had 29 more marbles than Doug. Ed lost 17 of his marbles at the playground. How many more marbles did Ed have than Doug then?\nA:",
    "output": "Ed had 29 more marbles than Doug. \nEd lost 17 of his marbles at the playground. \n\nHow many more marbles did Ed have than Doug then?\n\nEd would have 12 more marbles than Doug.\n\n-->\n\n12.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 19 inches. The frog jumped 10 inches farther than the grasshopper and the mouse jumped 20 inches farther than the frog. How much farther did the mouse jump than the grasshopper?\nA:",
    "output": "The grasshopper jumped 19 inches. The frog jumped 10 inches farther than the grasshopper, so the frog jumped 29 inches. The mouse jumped 20 inches farther than the frog, so the mouse jumped 49 inches. The mouse jumped 49 inches and the grasshopper jumped 19 inches, so the mouse jumped 30 inches farther than the grasshopper.\n\n-->\n\n30.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Allan brought 3 balloons and Jake brought 5 balloons to the park. Allan then bought 2 more balloons at the park. How many balloons did Allan and Jake have in the park?\nA:",
    "output": "Allan brought 3 balloons to the park. \nJake brought 5 balloons to the park. \nAllan bought 2 more balloons at the park. \n\nSo, Allan had 3 + 2 = 5 balloons at the park. Jake had 5 balloons at the park. So, Allan and Jake had 5 + 5 = 10 balloons at the park.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Josh lost 11 marbles. If he had 19 marbles in his collection earlier How many marbles does he have now?\nA:",
    "output": "Josh had 19 marbles. \nHe lost 11 marbles. \nThat means he has 8 marbles left.\n\n-->\n\n8.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Allan brought 6 balloons and Jake brought 3 balloons to the park. Jake then bought 4 more balloons at the park. How many more balloons did Jake have than Allan in the park?\nA:",
    "output": "Allan has 6 balloons.\nJake has 3 balloons.\nJake buys 4 more balloons.\n\nNow Jake has 7 balloons and Allan has 6 balloons. Jake has 1 more balloon than Allan in the park.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Faye was placing her pencils into 14 rows with 11 pencils in each row. How many pencils does she have?\nA:",
    "output": "Faye has 14 rows of 11 pencils. \n\nThere are 14 times 11 pencils, so she has 154 pencils.\n\n-->\n\n154.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A grocery store had 22 bottles of regular soda and 61 bottles of diet soda. How many more bottles of diet soda than regular soda did they have?\nA:",
    "output": "There are a total of 83 bottles of soda. \n\n61 bottles of diet soda means that there are 22 bottles of regular soda. \n\nThis means that there are 39 more bottles of diet soda than regular soda.\n\n-->\n\n39.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are 6 baskets of peaches. Each basket has 16 red peaches and 18 green peaches. How many red peaches are in the baskets altogether?\nA:",
    "output": "There are 6 baskets. \nEach basket has 16 red peaches and 18 green peaches. \nHow many red peaches are in the baskets altogether?\n\nThere are a total of 96 red peaches in the baskets.\n\n-->\n\n96.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: During summer break 800059 kids from Lawrence county go to camp and the rest stay home. Lawrence county has 828521 kids in all. About how many kids stayed home?\nA:",
    "output": "There are 828521 kids in Lawrence county. \n800059 kids go to camp. \nThat means that 828521-800059=28462 kids stay home.\n\n-->\n\n28462.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A chef had 58 apples. After making some pies, he had used 35. How many apples remained?\nA:",
    "output": "A chef had 58 apples. \n\nAfter making some pies, he had used 35. \n\nHow many apples remained?\n\nA: The chef would have 23 apples remaining.\n\n-->\n\n23.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 16 roses and 3 orchids in the vase. Jessica cut some more roses and orchids from her flower garden. There are now 7 orchids and 13 roses in the vase. How many orchids did she cut?\nA:",
    "output": "There were 16 roses and 3 orchids in the vase.\n\nJessica cut some more roses and orchids from her flower garden.\n\nThere are now 7 orchids and 13 roses in the vase.\n\nHow many orchids did she cut?\n\nShe cut 4 orchids.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Each pot has 40 flowers in it. There are 400 flowers in total. How many pots are there in all?\nA:",
    "output": "There are 400 flowers in total. \nEach pot has 40 flowers in it. \n\nWe can divide 400 by 40 to find out how many pots there are in all. \n\n400 divided by 40 equals 10. \n\nThere are 10 pots in all.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Because of the decision Sofia asked the students to suggest specific types of food. If 479 students suggested adding mashed potatoes while 489 suggested adding bacon to the menu How many more students suggested bacon than those that suggested mashed potatoes?\nA:",
    "output": "There are 479 students who suggested adding mashed potatoes to the menu. \nThere are 489 students who suggested adding bacon to the menu. \n\nWe want to know how many more students suggested bacon than those that suggested mashed potatoes. In other words, we want to know the difference between 489 and 479. \n\n489 - 479 = 10 \n\nTherefore, 10 more students suggested bacon than those that suggested mashed potatoes.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel had to complete 7 pages of math homework. If she had to complete 4 more pages of math homework than reading homework How many pages of reading homework did she have to complete?\nA:",
    "output": "First, we know that Rachel had to complete 7 pages of math homework. \n\nSecond, we know that she had to complete 4 more pages of math homework than reading homework. \n\nThat means that if we start with the 7 pages of math homework, and then subtract 4 pages, we will be left with the number of pages of reading homework that she had to complete. \n\n7 pages of math homework - 4 pages = 3 pages of reading homework\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Tiffany was collecting cans for recycling. On monday she had some bags of cans. The next day she found 4 more bags worth of cans. If she had a total of 8 bags altogether How many bags did she have on monday?\nA:",
    "output": "On Monday, Tiffany had some bags of cans. \nOn Tuesday, she found 4 more bags worth of cans. \n\nSo, Tiffany had 8 bags of cans in total. 4 of those were found on Tuesday, so she must have had 4 bags on Monday.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Kelly has 22 nintendo games. How many does she need to buy so that she will have 140 games left?\nA:",
    "output": "Kelly has 22 games. \nShe buys 118 games. \nThat means she will have 140 games. \n\nTherefore, she needs to buy 118 games.\n\n-->\n\n118.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Mom buys 70 white t - shirts in total. If white t - shirts can be purchased in packages and mom buys 14 packages How many white t - shirts does each package have?\nA:",
    "output": "There are 70 white t-shirts in total. \nThere are 14 packages. \nEach package has the same number of t-shirts. \n\nWe can set up the equation: \n\n70 = 14x \n\nWe want to solve for x, which is the number of t-shirts in each package. \n\nTo do this, we can divide both sides by 14: \n\n70/14 = (14x)/14 \n\n70/14 = x \n\nTherefore, each package has 5 t-shirts.\n\n-->\n\n5.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A farmer had 171 tomatoes in his garden. If he picked 134 of them yesterday and 30 today. How many will he have left after today?\nA:",
    "output": "The farmer had 171 tomatoes in his garden. \nHe picked 134 of them yesterday. \nThat means he has 171-134=37 tomatoes left in his garden. \nHe picked 30 of them today. \nThat means he has 37-30=7 tomatoes left in his garden.\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 22 children were riding on the bus. At the bus stop 40 children got on the bus while some got off the bus. Then there were 2 children altogether on the bus. How many children got off the bus at the bus stop?\nA:",
    "output": "There were 22 children on the bus to start. \nThen 40 children got on the bus. \nThat means there must have been 22 + 40 = 62 children at the bus stop. \nSome children got off the bus, so the number of children on the bus decreased. \nNow there are 2 children on the bus. \n\nThat means that 62 - 2 = 60 children got off the bus at the bus stop.\n\n-->\n\n60.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Emily is making bead necklaces for her friends. She made 11 necklaces and each necklace takes 28 beads. How many beads did Emily have?\nA:",
    "output": "Emily made 11 necklaces. \nEach necklace takes 28 beads. \n\nWe want to find out how many beads Emily had in total. \n\nWe can set up a equation and solve it. \n\n11 necklaces * 28 beads/1 necklace = 308 beads\n\n-->\n\n308.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A mailman has to give 9 pieces of junk mail to each house in each block. If there are 20 houses on a block How many pieces of junk mail should he give in each block?\nA:",
    "output": "There are 20 houses in a block. \nThe mailman has to give 9 pieces of junk mail to each house. \nThat means he has to give 9 x 20 = 180 pieces of junk mail in each block.\n\n-->\n\n180.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 23 children were riding on the bus. At the bus stop 24 children got on the bus while some got off the bus. Then there were 8 children altogether on the bus. How many more children got off the bus than those that got on?\nA:",
    "output": "There were 23 children on the bus. \n24 children got on the bus. \nThat means there is a total of 47 children. \n8 children got off the bus. \nThat means there is a total of 39 children. \n8 is more than the original 23, so we take away 8-23 to get -15. \nThat means 15 more children got off the bus than those that got on.\n\n-->\n\n15.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A book has 3 chapters. The first chapter is 66 pages long the second chapter is 35 pages long and the third chapter is 24 pages long. How many pages does the book have altogether?\nA:",
    "output": "The first chapter is 66 pages long. \nThe second chapter is 35 pages long. \nThe third chapter is 24 pages long. \n\nTo find the total number of pages in the book, we need to add all of the pages in the chapters together. \n\n66 + 35 + 24 = \n\nThe book has a total of 125 pages.\n\n-->\n\n125.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 7 red peaches, 15 yellow peaches and 8 green peaches are in the basket. How many peaches are in the basket?\nA:",
    "output": "There are 7 red peaches, 15 yellow peaches, and 8 green peaches in the basket. \n\nTo find the total number of peaches, we can add 7 + 15 + 8, which equals 30. \n\nTherefore, there are 30 peaches in the basket.\n\n-->\n\n30.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Because of the decision Sofia asked the students to suggest specific types of food. If 257 students suggested adding mashed potatoes 120 suggested adding bacon to the menu and 97 suggested adding tomatoes How many more students suggested mashed potatoes than those that suggested bacon?\nA:",
    "output": "There are 257 students who suggested adding mashed potatoes. \nThere are 120 students who suggested adding bacon. \n\nWe want to know how many more students suggested mashed potatoes than those that suggested bacon. \n\nTo do this, we can subtract the number of students who suggested adding bacon from the number of students who suggested adding mashed potatoes. \n\n257 - 120 = 137 \n\nSo, 137 more students suggested adding mashed potatoes than those that suggested bacon.\n\n-->\n\n137.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: In a school there are 135 girls and 214 boys. 496 more girls and 910 more boys joined the school. How many boys are there in the school now?\nA:",
    "output": "There are 135 girls and 214 boys in the school. \nThat means that there are 135 + 214 = 349 students in the school. \n496 more girls join the school. That means that there are 135 + 496 = 631 girls in the school. \n910 more boys join the school. That means that there are 214 + 910 = 1124 boys in the school. \nTherefore, there are 1124 boys in the school.\n\n-->\n\n1124.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: After resting they decided to go for a swim. If the depth of the water is 10 times Dean's height and he stands at 9 feet How much deeper is the water than Dean's height?\nA:",
    "output": "Dean's height is 9 feet. \nThe depth of the water is 10 times Dean's height. \nThis means that the depth of the water is 10 times 9 feet, or 90 feet. \nThe difference between the depth of the water and Dean's height is 90 feet - 9 feet, or 81 feet. \n\nTherefore, the water is 81 feet deeper than Dean's height.\n\n-->\n\n81.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: After resting they decided to go for a swim. The depth of the water is 2 times Dean's height. Dean is 8 feet shorter than Ron. If Ron stands at 14 feet How deep was the water?\nA:",
    "output": "Dean is 8 feet shorter than Ron. \nThat means that if we add 8 feet to Dean's height, we get Ron's height. \n\nSo if Dean is, say, 6 feet tall, then Ron is 6 + 8 = 14 feet tall. \n\nNow, the depth of the water is 2 times Dean's height. \nThat means that if we multiply 2 times Dean's height, we get the depth of the water. \n\nSo if Dean is 6 feet tall, then the depth of the water is 2 * 6 = 12 feet. \n\nTherefore, if Ron\n\n-->\n\n12.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with 4 kids on wednesday. She had played with 6 kids on monday and 17 kids on tuesday. How many more kids did she play with on monday than on wednesday?\nA:",
    "output": "On Monday, Julia played with 6 kids. \nOn Tuesday, Julia played with 17 kids. This means that she played with 11 more kids on Tuesday than on Monday. \nOn Wednesday, Julia played with 4 kids. This means that she played with 7 fewer kids on Wednesday than on Tuesday. \n\nNow we can see that Julia played with 2 more kids on Monday than on Wednesday.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Carol was sending out birthday invitations to 10 friends. If each package of invitations she bought had 2 invitations in it How many packs does she need so that no friend gets left out?\nA:",
    "output": "Carol has 10 friends. \nEach package of invitations has 2 invitations in it. \n\nSo, Carol needs 5 packages of invitations.\n\n-->\n\n5.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 14 inches. The mouse jumped 16 inches lesser than the frog who jumped 37 inches farther than the grasshopper. How much farther did the mouse jump than the grasshopper?\nA:",
    "output": "The frog jumped 37 inches farther than the grasshopper. \nThat means the frog jumped 37 + 14 = 51 inches. \nThat means the mouse jumped 51 - 16 = 35 inches. \nThat means the mouse jumped 35 - 14 = 21 inches farther than the grasshopper.\n\n-->\n\n21.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paul had 115 books. He sold 78 books in a garage sale. How many books does he have left with him?\nA:",
    "output": "Paul had 115 books. \nHe sold 78 books in a garage sale. \n\nThat means he has 115 - 78 = 37 books left with him.\n\n-->\n\n37.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Faye was placing 30 pencils into rows with 5 pencils in each row. How many rows could she make?\nA:",
    "output": "Faye has 30 pencils. \nShe wants to put 5 pencils in each row. \nThat means she can make 6 rows. \n\n6 rows\n\n-->\n\n6.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Frank had some pieces of candy. If he put them into 26 bags with 33 pieces in each bag How many pieces of candy did he have?\nA:",
    "output": "There are 26 bags. \nEach bag has 33 pieces of candy. \n\nThis means that there are a total of 858 pieces of candy.\n\n-->\n\n858.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A grocery store had a total of 17 bottles of which 9 were bottles of regular soda and the rest were bottles of diet soda. They also had 29 apple. How many bottles of diet soda did they have?\nA:",
    "output": "There were a total of 17 bottles. \n9 of those bottles were regular soda. \nThat means that the rest of the bottles were diet soda. \nSo, the number of diet soda bottles is 17 - 9, which is 8.\n\n-->\n\n8.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Josh had 20 marbles in his collection. He gave 2 marbles to Jack. How many marbles does Josh have now?\nA:",
    "output": "Josh had 20 marbles. \nHe gave 2 marbles to Jack. \nThat means he has 2 less marbles now. \nSo he has 18 marbles now.\n\n-->\n\n18.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jack received 6 emails in the morning, 3 emails in the afternoon and 5 emails in the evening. How many emails did Jack receive in the day?\nA:",
    "output": "In the morning, Jack received 6 emails. \nIn the afternoon, Jack received 3 more emails, which means that Jack has received a total of 9 emails so far. \nIn the evening, Jack received 5 more emails, which means that Jack has received a total of 14 emails today.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jake has 5 fewer peaches than Steven. Steven has 18 more peaches than Jill. If Jill has 87 peaches How many more peaches does Jake have than Jill?\nA:",
    "output": "Steven has 18 more peaches than Jill. So if we start with Jill's 87 peaches, and add 18, that will give us Steven's 105 peaches. \n\nJake has 5 fewer peaches than Steven. So if we start with Steven's 105 peaches, and subtract 5, that will give us Jake's 100 peaches. \n\nNow we can compare Jake's 100 peaches to Jill's 87 peaches, and see that Jake has 13 more peaches than Jill.\n\n-->\n\n13.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A grocery store had 54 bottles of diet soda, 83 bottles of regular soda and 12 apples. How many more bottles of regular soda than diet soda did they have?\nA:",
    "output": "There are 54 bottles of diet soda and 83 bottles of regular soda. \nTo find out how many more bottles of regular soda, we need to subtract the number of diet soda bottles from the number of regular soda bottles. \n83 - 54 = 29\nThere are 29 more bottles of regular soda than diet soda.\n\n-->\n\n29.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Kelly has 106 nintendo games. How many will she have left if she gives away 64 games?\nA:",
    "output": "Kelly has 106 nintendo games. \nShe gives away 64 games. \nThat means she is left with 106-64=42 games.\n\n-->\n\n42.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Frank had 42 pieces of candy. If he put them equally into 2 bags How many pieces of candy are in each bag?\nA:",
    "output": "Step 1: Frank has 42 pieces of candy. \nStep 2: He wants to put them equally into 2 bags. \nStep 3: That means each bag will have the same number of pieces of candy. \nStep 4: So if we take the total number of pieces of candy (42) and divide it by the number of bags (2), we will know how many pieces of candy are in each bag. \nStep 5: 42 divided by 2 is 21. So each bag has 21 pieces of candy.\n\n-->\n\n21.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Haley has 20 marbles. In her class 2 boys love to play marbles. If she distributes her marbles equally How many will each of the boys receive?\nA:",
    "output": "Haley has 20 marbles. \nShe wants to give them to two boys. \nThat means each boy will get 10 marbles.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Last week Fred had 19 dollars and Jason had 16 dollars. They washed cars over the weekend and now Fred has 40 dollars and Jason has 69 dollars. How much money did Fred earn over the weekend?\nA:",
    "output": "First, we need to figure out how much money Jason earned. We know that he started with 16 dollars, and now he has 69 dollars. So, we can say that he earned 53 dollars. \n\nNow, we need to figure out how much money Fred earned. We know that he started with 19 dollars, and now he has 40 dollars. So, we can say that he earned 21 dollars. \n\nWe can also see that Jason earned more money than Fred.\n\n-->\n\n21.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel has 4 apple trees. She picked 7 apples from each of her trees. Now the trees have a total 29 apples still on them. How many apples did Rachel pick in all?\nA:",
    "output": "Rachel has 4 apple trees. \nShe picked 7 apples from each of her trees. \nNow the trees have a total 29 apples still on them. \n\nWe can see that Rachel picked 28 apples in total.\n\n-->\n\n28.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The Ferris wheel in paradise park has 2 small seats and 23 large seats. Each small seat can hold 14 people and large seat can hold 54 people. How many people can ride the Ferris wheel on small seats?\nA:",
    "output": "There are 2 small seats and 23 large seats. \nEach small seat can hold 14 people. \nThat means that the 2 small seats can hold a total of 28 people. \nEach large seat can hold 54 people. \nThat means that the 23 large seats can hold a total of 1242 people. \nThe Ferris wheel can hold a total of 1270 people.\n\n-->\n\n28.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Frank was reading through his favorite book. He read 22 pages per day and it took him 569 days to finish the book. How many pages are there in the book?\nA:",
    "output": "Frank reads 22 pages per day. \nThat means he reads 22 * 569 = 12,518 pages in total.\n\n-->\n\n12518.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Allan brought 2 balloons to the park and then bought 3 more balloons there. If Jake brought 6 balloons to the park How many more balloons did Jake have than Allan in the park?\nA:",
    "output": "Allan had 2 balloons to start with. \nThen he bought 3 more balloons, so he had 2 + 3 = 5 balloons in the park. \nJake had 6 balloons in the park, so he had 6 - 5 = 1 more balloon than Allan in the park.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel had to complete 8 pages of math homework, 7 pages of reading homework and 3 more pages of biology homework. How many pages of math and biology homework did she have to complete?\nA:",
    "output": "First, we need to find out how many pages of math and biology homework she had to complete. \n\nWe know that she had to complete 8 pages of math homework and 3 pages of biology homework. \n\nTherefore, she had to complete 11 pages of math and biology homework.\n\n-->\n\n11.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Shirley sold 25 cases of boxes of trefoils. How many boxes of trefoils does she need to deliver if each case has 14 boxes?\nA:",
    "output": "Shirley sold 25 cases of boxes of trefoils. \n\nThat means she sold 25*14=350 boxes of trefoils.\n\n-->\n\n350.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: We ordered 7 pizzas. Each pizza has the same number of slices. If there were a total of 14 slices How many slices are there in each pizza?\nA:",
    "output": "There are 7 pizzas. \nEach pizza has the same number of slices. \nThere are a total of 14 slices. \n\nWe can set this up as an equation: \n\n7 pizzas * _____ slices/pizza = 14 slices\n\nWe want to solve for the number of slices per pizza, so we'll want to divide both sides of the equation by 7: \n\n7 pizzas * _____ slices/pizza = 14 slices\n7 pizzas * _____ slices/pizza = 14 slices\n7 pizzas * _____ slices/pizza =\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Mary is baking a cake. The recipe calls for 12 cups of flour 5 cups of sugar and 49 cups of salt. She already put in 11 cups of flour. How many more cups of flour does she need to add?\nA:",
    "output": "Mary is baking a cake. \nThe recipe calls for 12 cups of flour, 5 cups of sugar, and 49 cups of salt. \nShe already put in 11 cups of flour. \n\nHow many more cups of flour does she need to add? \n\n1 cup\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The Razorback t-shirt shop makes $ 78 dollars off each t-shirt sold. During the Arkansas game and the Texas tech game they sold a total of 186 t-shirts. If they sold 172 t-shirts during the Arkansas game How much money did they make from selling the t-shirts during the Texas tech game?\nA:",
    "output": "The Razorback t-shirt shop makes $78 dollars off each t-shirt sold. \nDuring the Arkansas game and the Texas tech game they sold a total of 186 t-shirts. \nIf they sold 172 t-shirts during the Arkansas game \n\nThen they must have sold 172-186 = 14 t-shirts during the Texas Tech game. \n\nSo they made $78*14 = $1092 from selling t-shirts during the Texas Tech game.\n\n-->\n\n1092.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: We ordered some pizzas. Each pizza has 2 slices. If there were a total of 28 slices How many pizzas did we order?\nA:",
    "output": "There are 2 slices in each pizza. \nThere are 28 slices in total. \n\nThat means that there are 14 pizzas.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rebecca wants to split a collection of eggs into groups of 3. Rebecca has 99 bananas 9 eggs and 27 marbles. How many groups will be created?\nA:",
    "output": "Rebecca wants to split a collection of eggs into groups of 3. \nThat means she will need 3 eggs for each group. \nIf she has 9 eggs, she can make 3 groups. \nEach group will have 3 eggs.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 41 children were riding on the bus. At the bus stop some children got off the bus. Then there were 18 children left on the bus. How many more children were on the bus before the bus stop than there are now?\nA:",
    "output": "41 children were riding on the bus. \nAt the bus stop, some children got off the bus. \nNow, there are 18 children left on the bus. \n\nWe want to know how many more children were on the bus before the bus stop than there are now. \n\nWe can find this out by subtracting the number of children on the bus now from the number of children on the bus before the stop. \n\nThis would give us 41 - 18 = 23. \n\nSo, 23 more children were on the bus before the bus stop than there are now.\n\n-->\n\n23.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He then went to see the oranges being harvested. He found out that they harvest 8 sacks per day and that each sack containes 35 oranges. How many oranges do they harvest per day?\nA:",
    "output": "There are 8 sacks. \nEach sack has 35 oranges. \nSo, 8 x 35 = 280 oranges. \n\nThey harvest 280 oranges per day.\n\n-->\n\n280.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Emily is making bead necklaces for her friends. Each necklace takes 8 beads and she has 16 beads. How many necklaces can Emily make?\nA:",
    "output": "Emily has 16 beads. \nEach necklace takes 8 beads. \n\nSo, Emily can make 2 necklaces.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paul got a box of 253 crayons for his birthday. By the end of the school year he had either lost or given away 70 of them. How many crayons did he have left by the end of the school year?\nA:",
    "output": "Paul got a box of 253 crayons. \nBy the end of the school year he had either lost or given away 70 of them. \n\nSo we need to find out how many crayons he had left. \n\n253-70=183\n\nPaul had 183 crayons left by the end of the school year.\n\n-->\n\n183.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Helen the hippo and her friends are preparing for thanksgiving at Helen's house. Helen baked 144 chocolate chip cookies and 397 raisin cookies yesterday. And she baked 85 raisin cookies and 403 chocolate chip cookies this morning. How many raisin cookies did Helen bake?\nA:",
    "output": "Helen baked 397 raisin cookies and 403 chocolate chip cookies. That's a total of 800 cookies. She baked 85 raisin cookies this morning. So she must have baked a total of 482 raisin cookies.\n\n-->\n\n482.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: An industrial machine made 9 shirts yesterday and 44 shirts today. It can make 3 shirts a minute. How many minutes did the machine work yesterday?\nA:",
    "output": "There are 60 minutes in an hour. \n3 shirts per minute means the machine can make 180 shirts in an hour. \n9 shirts divided by 180 shirts per hour equals 1/20th of an hour, or 3 minutes.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Zachary did 51 push-ups in gym class today. David did 22 more push-ups than Zachary. John did 4 push-ups less than David. How many push-ups did John do?\nA:",
    "output": "Zachary did 51 push-ups. \nDavid did 22 more push-ups than Zachary. \nThat means David did 51 + 22 = 73 push-ups. \nJohn did 4 push-ups less than David. \nThat means John did 73 - 4 = 69 push-ups.\n\n-->\n\n69.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A grocery store had 81 bottles of regular soda, 60 bottles of diet soda and 60 bottles of lite soda. How many more bottles of regular soda did they have than diet soda?\nA:",
    "output": "There are 81 bottles of regular soda, 60 bottles of diet soda, and 60 bottles of lite soda. \nWe want to know how many more bottles of regular soda there are than diet soda. \nWe can find this out by subtracting the number of diet soda bottles from the number of regular soda bottles. \n81 - 60 = 21 \nThere are 21 more bottles of regular soda than diet soda.\n\n-->\n\n21.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Randy has some blocks. He uses 52 blocks to build a tower. If there are 38 blocks left How many blocks did he have at the start?\nA:",
    "output": "Randy has some blocks. He uses 52 blocks to build a tower. \n\nThis means that he started with 52 blocks, and he used 52 blocks to build a tower. \n\nIf there are 38 blocks left, this means that he has 38 blocks left. \n\nSo, he started with 52 blocks, and he has 38 blocks left. This means that he has a total of 90 blocks.\n\n-->\n\n90.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Edward had $ 13. He spent some money. Now he has $ 3. How much money did Edward spend?\nA:",
    "output": "Edward had $13. \nHe spent some money. \nNow he has $3. \n\nThis means that Edward spent $10.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: They decided to hold the party in their backyard. They have 12 sets of tables and each set has 14 chairs. There are also 6 chairs extra. How many chairs do they have for the guests?\nA:",
    "output": "There are 12 sets of tables and each set has 14 chairs. \nThat means we have 12 * 14 = 168 chairs so far. \nThere are also 6 chairs extra. \nThat means we have 168 + 6 = 174 chairs in total.\n\n-->\n\n174.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The Ferris wheel in paradise park has 3 small seats and 7 large seats. Each small seat can hold 16 people and large seat can hold 12 people. How many people can ride the Ferris wheel on large seats?\nA:",
    "output": "There are 3 small seats and 7 large seats. \nEach small seat can hold 16 people. \nEach large seat can hold 12 people. \nSo, we can say that the Ferris wheel can hold a total of \n3 × 16 + 7 × 12 = 84 people.\n\n-->\n\n84.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are 20 houses in a block. If a mailman has to give 32 pieces of junk mail to each house in each block How many pieces of junk mail should he give each block?\nA:",
    "output": "There are 20 houses in a block. \nIf a mailman has to give 32 pieces of junk mail to each house in each block, \nthen he should give 32 * 20 = 640 pieces of junk mail to each block.\n\n-->\n\n640.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are 7 baskets of peaches. Each basket has 10 red peaches and 2 green peaches. How many green peaches are in the baskets altogether?\nA:",
    "output": "There are 7 baskets. \nEach basket has 10 red peaches and 2 green peaches. \nSo, there are 2 green peaches in each basket. \nNow, we need to multiply because there are 7 baskets. \n2 multiplied by 7 is 14. \nSo, there are 14 green peaches in the baskets altogether.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Winter is almost here and most animals are migrating to warmer countries. There are 3 bird families living near the mountain. 26 new bird families came to live near the mountain from the arctic while 2 bird families flew away further south for winter. How many bird families were left near the mountain?\nA:",
    "output": "There are 3 bird families living near the mountain. \n26 new bird families came to live near the mountain from the arctic. \n2 bird families flew away further south for winter. \n3 + 26 - 2 = 27 bird families were left near the mountain.\n\n-->\n\n27.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Because of the decision Sofia asked the students to suggest specific types of food. If 144 students suggested adding mashed potatoes 467 suggested adding bacon to the menu and 79 suggested adding tomatoes How many more students suggested mashed potatoes than those that suggested tomatoes?\nA:",
    "output": "There were 144 students who suggested adding mashed potatoes. \nThere were 467 students who suggested adding bacon. \nThere were 79 students who suggested adding tomatoes. \n\nWe want to know how many more students suggested mashed potatoes than those that suggested tomatoes. \n\nThere were 144 students who suggested adding mashed potatoes. \nThere were 79 students who suggested adding tomatoes. \n\nThere were 65 more students who suggested adding mashed potatoes than those that suggested tomatoes.\n\n-->\n\n65.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jesse's rooms are 19 feet long and 18 feet wide. If she has 20 rooms in all How much carpet does she need to cover the floors of all rooms?\nA:",
    "output": "First, we need to calculate the area of one room. \nTo do this, we need to multiply the length and width of the room. \nThe length is 19 feet and the width is 18 feet. \n19 multiplied by 18 equals 342. \nThis means that one room has an area of 342 square feet. \n\nNow we need to calculate the area of all 20 rooms. \nTo do this, we need to multiply the area of one room by 20. \n342 multiplied by 20 equals 6840. \nThis means that the area of all 20 rooms is 6840\n\n-->\n\n6840.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A waiter had 14 customers. 5 customers left. How many customers does he still have?\nA:",
    "output": "The waiter had 14 customers. \n5 customers left. \nThat means the waiter now has 9 customers.\n\n-->\n\n9.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Marco and his dad went strawberry picking. His strawberries weighed 8 pounds while his dad's strawberries weighed 32 pounds. Together how much did their strawberries weigh?\nA:",
    "output": "Marco and his dad went strawberry picking. This is given.\nHis strawberries weighed 8 pounds while his dad's strawberries weighed 32 pounds. This is given.\n\nTogether how much did their strawberries weigh?\n\nThe answer is 40 pounds.\n\n-->\n\n40.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The Razorback t-shirt shop makes $ 23 dollars off each t-shirt sold. During the Arkansas and Texas tech game they made $ 230 by selling t-shirts. How many t-shirts did they sell?\nA:",
    "output": "The Razorback t-shirt shop makes $ 23 dollars off each t-shirt sold. \n\nThat means that for every $ 23 that the shop makes, it is from one t-shirt. \n\nDuring the Arkansas and Texas tech game they made $ 230 by selling t-shirts. \n\nThat means that they sold 10 t-shirts in total.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Allan brought 2 balloons and Jake brought 3 balloons to the park. How many more balloons did Jake have than Allan in the park?\nA:",
    "output": "Allan brought 2 balloons.\nJake brought 3 balloons.\n\nHow many more balloons did Jake have than Allan?\n\nJake had 1 more balloon than Allan.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Every day Ryan spends 7 hours on learning english, 2 hours on learning chinese and 4 hours on learning spanish. How many more hours does he spend on learning english than he does on learning spanish?\nA:",
    "output": "First, we need to find out how many hours Ryan spends on learning english and how many hours he spends on learning spanish. \n\nTo do this, we need to add up the total number of hours he spends on learning english and the total number of hours he spends on learning spanish. \n\n7 hours + 2 hours = 9 hours (for english)\n4 hours + 2 hours = 6 hours (for spanish)\n\nNow that we know how many hours Ryan spends on learning english and how many hours he spends on learning spanish, we can compare the two numbers.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Melissa played 3 games and scored a total of 81 points scoring the same for each game. How many points did she score in each game?\nA:",
    "output": "Melissa played 3 games. \nShe scored a total of 81 points. \nShe scored the same for each game. \n\nThat means that she scored 27 points per game.\n\n-->\n\n27.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jerry had 8 action figures on a shelf in his room. Later he added 4 more action figures to the shelf and removed 5 old ones. How many action figures were on his shelf in all?\nA:",
    "output": "Jerry had 8 action figures on a shelf in his room. \n\nLater, he added 4 more action figures to the shelf. \n\nThat means he now has a total of 12 action figures on the shelf. \n\nHowever, he then removed 5 old ones. \n\nThat means he now has a total of 7 action figures on the shelf.\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paige was helping her mom plant flowers and together they planted 45 seeds in 9 flowerbeds. If they put same number of seeds in each flower bed How many seeds did they plant in each flowerbed?\nA:",
    "output": "There are 45 seeds in total. \nThere are 9 flowerbeds. \n\nThis means that in order for there to be an equal number of seeds in each flowerbed, each flowerbed would need to have 5 seeds.\n\n-->\n\n5.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A mailman has to give 4 pieces of junk mail to each house in each of the 81 blocks. If there are 12 houses in each block How many pieces of junk mail should he give in each block?\nA:",
    "output": "There are 81 blocks, and each block has 12 houses. \nThat means the mailman has to give 4 pieces of junk mail to each of the 12 houses, \nand he has to do that for each of the 81 blocks. \nThat means he has to give 4 × 12 = 48 pieces of junk mail to each block.\n\n-->\n\n48.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Baker made some cakes. He sold 145 of them. If he still has 72 cakes left How many cakes did baker make?\nA:",
    "output": "Baker made some cakes. \n\nThis is a given. \n\nHe sold 145 of them. \n\nThis means that he had more than 145 cakes to begin with. \n\nIf he still has 72 cakes left \n\nThis means that he has a total of 217 cakes. \n\nHow many cakes did baker make?\n\nThis means that the answer is 217.\n\n-->\n\n217.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rebecca wants to split a collection of eggs into groups of 6. Rebecca has 18 eggs 72 bananas and 66 marbles. How many groups will be created?\nA:",
    "output": "Rebecca wants to split a collection of eggs into groups of 6. \nThat means she will have 6 eggs in each group. \nThere will be 3 groups in total. \n\nRebecca has 18 eggs, 72 bananas, and 66 marbles. \nThat means she will have 6 eggs in each group, 12 bananas in each group, and 11 marbles in each group.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 13 campers went rowing and 59 campers went hiking in the morning. 21 campers went rowing in the afternoon. How many campers went rowing in all?\nA:",
    "output": "There are 13 campers rowing in the morning and 59 campers hiking in the morning. \nThen, there are 21 campers rowing in the afternoon. \nThat means, in total, there are 34 campers rowing.\n\n-->\n\n34.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Josh had 22 marbles in his collection. He found 13 marbles ones while he lost 5 marbles. How many marbles does he have now?\nA:",
    "output": "Josh had 22 marbles in his collection. \n\nThat's our starting point, and we're told that he then found 13 more marbles. So:\n\nJosh had 22 marbles in his collection. \nHe found 13 more marbles. \n\nThat means he now has 35 marbles in his collection. But then we're told that he lost 5 marbles, so:\n\nJosh had 22 marbles in his collection. \nHe found 13 more marbles. \nHe lost 5 marbles. \n\nThat means he now has 30 marbles in his collection.\n\n-->\n\n30.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A book has 2 chapters. The first chapter is 48 pages long. The second chapter is 11 pages long. How many more pages does the first chapter have than the second chapter?\nA:",
    "output": "There are 2 chapters in the book. \nThe first chapter is 48 pages long. \nThe second chapter is 11 pages long. \n\nTo find out how many more pages the first chapter has than the second chapter, we need to subtract the number of pages in the second chapter from the number of pages in the first chapter. \n\n48 - 11 = \n\n37\n\n-->\n\n37.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with 17 kids on monday, 15 kids on tuesday and 2 kids on wednesday. How many kids did she play with altogether?\nA:",
    "output": "On Monday, Julia played with 17 kids. \nOn Tuesday, Julia played with 15 kids. \nOn Wednesday, Julia played with 2 kids. \n\nTo find out how many kids Julia played with in total, we need to add up the number of kids she played with on each day. So we would add 17 + 15 + 2, which would give us 34.\n\n-->\n\n34.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 25 inches. The frog jumped 18 inches farther than the grasshopper and the mouse jumped 2 inches farther than the frog. How far did the mouse jump?\nA:",
    "output": "The grasshopper jumped 25 inches. \nThe frog jumped 18 inches farther than the grasshopper. This means that the frog jumped a total of (25 + 18) = 43 inches. \nThe mouse jumped 2 inches farther than the frog. This means that the mouse jumped a total of (43 + 2) = 45 inches. \n\nTherefore, the mouse jumped 45 inches.\n\n-->\n\n45.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Next on his checklist is wax to stick the feathers together and colors to paint them. He needs a total of 49 g of colors to paint them. If the feathers require 288 g of wax and right now he just needs 260 g How many grams of wax does he already have?\nA:",
    "output": "First, he needs 49 grams of colors to paint the feathers. \nSecond, he needs 288 grams of wax to stick the feathers together. \nRight now, he just needs 260 grams of wax. \nSo, he already has 28 grams of wax.\n\n-->\n\n28.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Mary is baking a cake. The recipe calls for 14 cups of flour and 6 cups of sugar. She already put in 5 cups of flour. How many more cups of flour than cups of sugar does she need to add now?\nA:",
    "output": "First, we need to see how many cups of flour she has left to add. We know she's put in 5 cups so far, and the recipe calls for a total of 14 cups of flour. So she has 14-5=9 cups of flour left to add. \n\nNext, we need to see how many cups of sugar she has left to add. We know she's put in 0 cups so far, and the recipe calls for a total of 6 cups of sugar. So she has 6-0=6 cups of sugar left to add. \n\nFinally, we need to compare the\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He also had 56 aquariums for saltwater animals and 10 aquariums for freshwater animals. Each aquarium has 39 animals in it. How many saltwater animals does Tyler have?\nA:",
    "output": "We are looking for the number of saltwater animals that Tyler has. \nWe are given that Tyler has 56 aquariums for saltwater animals. \nWe are also given that each aquarium has 39 animals in it. \n\nWe can set up the equation: \n\nsaltwater animals = (56)(39)\n\nsaltwater animals = 2,184\n\n-->\n\n2184.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Tiffany was collecting cans for recycling. On monday she had 10 bags of cans. She found 3 bags of cans on the next day and 7 bags of cans the day after that. How many bags did she have altogether?\nA:",
    "output": "On Monday, Tiffany had 10 bags of cans. \nOn Tuesday, she found 3 more bags of cans, so she had 10 + 3 = 13 bags of cans. \nOn Wednesday, she found 7 more bags of cans, so she had 13 + 7 = 20 bags of cans. \n\nTherefore, Tiffany had 20 bags of cans in total.\n\n-->\n\n20.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The grasshopper and the frog had a jumping contest. The grasshopper jumped 31 inches and the frog jumped 35 inches. How much did they jump altogether?\nA:",
    "output": "The grasshopper jumped 31 inches. \nThe frog jumped 35 inches. \n\nTo find out how much they jumped altogether, we need to add 31 + 35. \n\n31 + 35 = 66. \n\nSo they jumped 66 inches altogether.\n\n-->\n\n66.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 100 dollars in Olivia's wallet. She collected 148 more dollars from an atm. After she visited a supermarket there were 159 dollars left. How much did she spend?\nA:",
    "output": "Olivia started with $100 in her wallet. \nThen she collected $148 from the ATM, so now she has $248. \nShe spent some of that money at the supermarket, so now she has $159. \n\nHow much did she spend? We can figure that out by subtracting her current amount of money from her original amount of money. \n\n$248 - $159 = $89\n\nOlivia spent $89 at the supermarket.\n\n-->\n\n89.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Katie had 81 ds games and her friends had 59 games. How many more games does Katie have than her friends?\nA:",
    "output": "Katie has 81 games. \nHer friends have 59 games. \n\nHow many more games does Katie have than her friends? \n\nKatie has 81 games. \nHer friends have 59 games. \n\nKatie has 22 more games than her friends.\n\n-->\n\n22.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with 5 kids on tuesday. She had played tag with 6 kids on monday. How many more kids did she play with on monday than on tuesday?\nA:",
    "output": "On Monday, Julia played with 6 kids. \nOn Tuesday, Julia played with 5 kids. \n\nSo we want to know how many more kids Julia played with on Monday in comparison to Tuesday. \n\n6 - 5 = 1 \n\nTherefore, Julia played with 1 more kid on Monday than on Tuesday.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with a total of 18 kids. She played with 4 kids on monday and yet with some more kids on tuesday. How many kids did she play with on tuesday?\nA:",
    "output": "On Monday, Julia played with 4 kids. \nOn Tuesday, Julia played with some more kids. \n\nWe want to know how many kids Julia played with on Tuesday. \n\nWe can set up an equation to solve this problem. \n\n18 = 4 + x\n\nx = 14\n\nJulia played with 14 kids on Tuesday.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are 6 houses on a block. If a mailman has to give 24 pieces of junk mail to each block How many pieces of junk mail should he give in each house?\nA:",
    "output": "There are 6 houses on a block. \nIf a mailman has to give 24 pieces of junk mail to each block, \nHow many pieces of junk mail should he give in each house?\n\nThere are 6 houses on a block. \nIf a mailman has to give 24 pieces of junk mail to each block, \nHow many pieces of junk mail should he give in each house?\n\nThere are 6 houses on a block. \nIf a mailman has to give 24 pieces of junk mail to each block, \nHow many pieces of junk mail should he give in each\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dave had 19 apps and 18 files on his phone. After deleting some apps and files he had 6 apps and 15 files left. How many more files than apps does he have left on the phone?\nA:",
    "output": "Dave had 19 apps and 18 files. \nAfter deleting some apps and files, he had 6 apps and 15 files left. \n\nHow many more files than apps does he have left on the phone? \n\nWe need to find the difference between the number of apps and the number of files. \n\nThere are 15 files and 6 apps, which means there are 9 more files than apps.\n\n-->\n\n9.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Bryan took a look at his books as well. Each bookshelf contains 2 books. If he has a total of 38 books How many bookshelves does he have?\nA:",
    "output": "Bryan has a total of 38 books. \nEach bookshelf has 2 books. \n\nSo we can say that Bryan has a total of 19 bookshelves.\n\n-->\n\n19.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Luke played a trivia game and gained 3 points in each round of a game. If he scored 78 points in the trivia game How many rounds did he play?\nA:",
    "output": "In each round, Luke gains 3 points. \nSo in 1 round, he gains 3 points. In 2 rounds, he gains 6 points. In 3 rounds, he gains 9 points.\n\nWe can see that the total number of points Luke gains is 3 times the number of rounds he plays. \n\nSo we set up the equation: \n\n3x = 78 \n\nx = 26 \n\nLuke played 26 rounds of the game.\n\n-->\n\n26.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He then went to see the oranges being harvested. He found out that they harvest 71 sacks of unripe oranges and 60 sacks of ripe oranges per day. How many more sacks of unripe oranges than ripe oranges are harvested per day?\nA:",
    "output": "There are 71 sacks of unripe oranges and 60 sacks of ripe oranges. \nTo find out how many more sacks of unripe oranges, we need to subtract 60 from 71. \n71-60=11 \nThere are 11 more sacks of unripe oranges than ripe oranges.\n\n-->\n\n11.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: At the zoo, a cage had snakes and alligators. The total number of animals in the cage was 79. If 24 snakes and 51 alligators were hiding How many animals were not hiding in all?\nA:",
    "output": "There are 79 animals in the cage. \n24 snakes and 51 alligators were hiding. \nThat means that there are 24 + 51 = 75 animals hiding. \nThat means that there are 79 - 75 = 4 animals not hiding.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Danny has 21 bottle caps in his collection. He found some more bottle caps at the park. If he has 53 bottle caps now How many bottle caps did he find at the park?\nA:",
    "output": "Danny has 21 bottle caps in his collection. \nHe found some more bottle caps at the park. \n\nWe want to know how many bottle caps he found at the park. \n\nWe can set up an equation to solve this problem. \n\nWe know that: \n\n21 + x = 53 \n\nWe want to solve for x. \n\nWe can use algebra to solve for x. \n\nWe can subtract 21 from each side of the equation. \n\n21 + x = 53 \n-21 -21 \n0 + x = 32\n\n-->\n\n32.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 2 roses in the vase. Jessica threw away 4 roses from the vase and cut some more new roses from her flower garden to put in the vase. There are now 23 roses in the vase. How many roses did she cut?\nA:",
    "output": "There were 2 roses in the vase. \nJessica threw away 4 roses from the vase. \nThat means there are now 2-4= -2 roses in the vase. \nShe cut some more new roses from her flower garden to put in the vase. \nThat means she cut 23-(-2)= 25 roses from her flower garden.\n\n-->\n\n25.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: In a school there are 34 girls and 841 boys. How many more boys than girls does the school have?\nA:",
    "output": "There are 34 girls and 841 boys. \nThere are 841-34=807 more boys than girls.\n\n-->\n\n807.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Bobby ate some pieces of candy. Then he ate 25 more. If he ate a total of 43 pieces of candy How many pieces of candy had he eaten at the start?\nA:",
    "output": "Bobby ate some pieces of candy. \nWe don't know how many pieces of candy he ate, so we'll call that number x. \nThen he ate 25 more. \nThat means he ate a total of x + 25 pieces of candy. \nWe know that he ate a total of 43 pieces of candy, so: \nx + 25 = 43 \nWe can solve for x by subtracting 25 from both sides: \nx + 25 - 25 = 43 - 25 \nx = 18 \nThat means Bobby ate 18 pieces of candy at the start.\n\n-->\n\n18.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He then went to see the oranges being harvested. He found out that they harvest 8 sacks per day. How many days will it take to harvest 24 sacks of oranges?\nA:",
    "output": "There are 8 sacks harvested per day. \nThere are 24 sacks that need to be harvested. \n\nTo find out how many days it will take, we can divide 24 by 8. \n\nIt will take 3 days to harvest 24 sacks of oranges.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jack received 3 emails in the afternoon, 5 emails in the morning and 16 emails in the evening. How many more emails did Jack receive in the morning than in the afternoon?\nA:",
    "output": "Jack received 3 emails in the afternoon. \nJack received 5 emails in the morning. \n\nWe want to know how many more emails Jack received in the morning than in the afternoon. \n\n3 + 5 = 8\n\nSo Jack received 8 emails in total.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel had to complete 3 pages of math homework and 4 pages of reading homework. How many more pages of reading homework than math homework did she have?\nA:",
    "output": "First, we need to figure out how many pages of homework Rachel had in total. We can do this by adding 3 and 4 together. \n\n3 + 4 = 7\n\nSo, Rachel had 7 pages of homework in total. \n\nNext, we need to figure out how many pages of math homework Rachel had. We already know that she had 3 pages of math homework, so we don't need to do anything else. \n\nNow, we need to figure out how many pages of reading homework Rachel had. We already know that she had 4 pages of reading homework, so we don't\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A book has 2 chapters. The first chapter is 37 pages long. The second chapter is 80 pages long. How many more pages does the second chapter have than the first chapter?\nA:",
    "output": "There are 37 pages in the first chapter. \nThere are 80 pages in the second chapter. \n\nTo find out how many more pages are in the second chapter, we need to subtract 37 from 80. \n\n80 - 37 = \n\n43\n\nThe second chapter has 43 more pages than the first chapter.\n\n-->\n\n43.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are 8 different movies and 21 different books in the ' crazy silly school ' series. If you read 7 of the books and watched 4 of the movies How many more movies do you still have to watch?\nA:",
    "output": "There are 8 different movies and 21 different books in the 'crazy silly school' series. \n\nIf you read 7 of the books, that means you still have 14 books left to read. \n\nIf you watched 4 of the movies, that means you still have 4 movies left to watch.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Haley grew some trees in her backyard. After a typhoon 5 died. If 12 trees were left How many trees did she grow?\nA:",
    "output": "Haley grew some trees in her backyard. After a typhoon, 5 died. \n\nThat means that Haley grew at least 5 trees in her backyard. If 12 trees were left, that means that Haley grew at least 17 trees in her backyard.\n\n-->\n\n17.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Josh had 9 marbles in his collection. He lost some marbles. If he has 4 marbles now How many marbles did he lose?\nA:",
    "output": "Josh had 9 marbles. \nJosh lost some marbles. \nThat means the number of marbles Josh has now is less than 9. \nThe only number that is less than 9 and is 4 more than 0 is 4. \nTherefore, Josh lost 5 marbles.\n\n-->\n\n5.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: They decided to hold the party in their backyard. They have 14 chairs for each set of table. If they have 9 sets of tables How many more chairs than tables do they have?\nA:",
    "output": "There are 9 sets of tables. Each set has 14 chairs. \n9 sets * 14 chairs/set = 126 chairs \nThere are 9 sets of tables. \n9 sets * 1 table/set = 9 tables \nNow we can compare. \nThere are 126 chairs and 9 tables. \n126 - 9 = 117 \nSo, there are 117 chairs more than tables.\n\n-->\n\n117.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He then went to see the oranges being harvested. He found out that they harvest 66 sacks per day. How many oranges do they harvest per day if each sack contains 28 oranges?\nA:",
    "output": "He went to see the oranges being harvested. \n\nThis means that he saw them harvest oranges. \n\nHe found out that they harvest 66 sacks per day. \n\nThis means that they harvest 66 sacks of oranges per day. \n\nHow many oranges do they harvest per day if each sack contains 28 oranges?\n\nThis means that if they harvest 66 sacks of oranges per day, and each sack contains 28 oranges, then they must harvest 1,848 oranges per day.\n\n-->\n\n1848.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: At the arcade Dave had won some tickets. He used 12 tickets to buy some toys. If he still has 14 tickets left How many tickets did Dave win at the arcade?\nA:",
    "output": "Dave won some tickets. \nHe used 12 tickets to buy some toys. \nIf he still has 14 tickets left, then he started with 26 tickets. \n\nTherefore, Dave won 26 tickets at the arcade.\n\n-->\n\n26.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Adam could fit 10 action figures on each shelf in his room. His room has could hold 8 action figures. How many total shelves did his room have?\nA:",
    "output": "Adam could fit 10 action figures on each shelf in his room. \nThat means that if he had one shelf, he could fit 10 action figures on that shelf. \nIf he had two shelves, he could fit 20 action figures in total (10 on the first shelf + 10 on the second shelf). \nIf he had three shelves, he could fit 30 action figures in total (10 on the first shelf + 10 on the second shelf + 10 on the third shelf). \n\nWe can see that the total number of action figures that Adam can fit in his room is equal to 10 times the number\n\n-->\n\n80.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Mary is baking a cake. The recipe calls for 12 cups of flour and 13 cups of sugar. She already put in 2 cups of sugar. How many more cups of sugar does she need to add?\nA:",
    "output": "We know that Mary has already put in 2 cups of sugar, and the recipe calls for a total of 13 cups of sugar. So we can say that Mary needs 11 more cups of sugar.\n\n-->\n\n11.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Winter is almost here and most animals are migrating to warmer countries. There are 38 bird families living near the mountain. If 47 bird families flew away to africa and 94 bird families flew away to asia How many more bird families flew away to asia than those that flew away to africa?\nA:",
    "output": "There are 38 bird families living near the mountain. \n47 bird families flew away to Africa. \nThis means that there are (38 - 47 =) -9 bird families living near the mountain that flew to Africa. \n94 bird families flew away to Asia. \nThis means that there are (38 - 94 =) -56 bird families living near the mountain that flew to Asia. \nNow we want to know how many more bird families flew to Asia, so we take the absolute value of -9 and -56. This gives us the answer of 47.\n\n-->\n\n47.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Zachary did 51 push-ups and David did 44 push-ups in gym class today. How many more push-ups did Zachary do than David?\nA:",
    "output": "Zachary did 51 push-ups. \nDavid did 44 push-ups. \n\nZachary did 7 more push-ups than David.\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 16 people can ride the Ferris wheel in paradise park at the same time. If the Ferris wheel has 4 seats How many people can each seat hold?\nA:",
    "output": "There are 16 people in total. \nThere are 4 seats in total. \n\nThis means that each seat can hold 4 people.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Mary is baking a cake. The recipe calls for 6 cups of flour 8 cups of sugar and 7 cups of salt. She already put in 5 cups of flour. How many more cups of sugar than cups of salt does she need to add now?\nA:",
    "output": "Mary has already put in 5 cups of flour. \nThe recipe calls for a total of 6 cups of flour. \nThat means Mary needs 1 more cup of flour. \n\nThe recipe calls for 8 cups of sugar. \nThe recipe calls for 7 cups of salt. \nThat means Mary needs 1 more cup of sugar than she does salt.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel picked 7 ripe apples from her tree. Now the tree has 5 apples still on it. If 3 of those are ripe and the rest are unripe How many unripe apples does the tree have now?\nA:",
    "output": "Rachel picked 7 ripe apples from her tree. \n\nThat means that there were 7 apples on the tree, and all 7 were ripe. \n\nNow the tree has 5 apples still on it. \n\nThat means that there are 2 apples missing from the tree. \n\nIf 3 of those are ripe and the rest are unripe, \n\nThat means that there are 2 unripe apples on the tree.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Zachary did 44 push-ups in gym class today. David did 58 more push-ups than zachary. How many push-ups did Zachary and David do altogether?\nA:",
    "output": "Zachary did 44 push-ups. \nDavid did 58 more push-ups than zachary. \nThat means that David did 58 + 44 = 102 push-ups. \nZachary and David did 102 + 44 = 146 push-ups altogether.\n\n-->\n\n146.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: If Lewis earns a total of $ 460 during 5 weeks of harvest How much money does he earn each week?\nA:",
    "output": "If Lewis earns a total of $460 during 5 weeks of harvest, that means that: \n\n$460 = (x)(5)\n\nwhere x is the amount of money he earns each week. \n\nTo solve for x, we can divide both sides of the equation by 5: \n\n$460/5 = x\n\n$92 = x \n\nSo, Lewis earns $92 each week during harvest.\n\n-->\n\n92.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Because of the decision Sofia asked the students to suggest specific types of food. If 228 students suggested adding mashed potatoes 337 suggested adding bacon to the menu and 23 suggested adding tomatoes How many more students suggested bacon than those that suggested tomatoes?\nA:",
    "output": "There are 228 students who suggested adding mashed potatoes. \nThere are 337 students who suggested adding bacon to the menu. \nThere are 23 students who suggested adding tomatoes. \n\nWe want to know how many more students suggested bacon than those that suggested tomatoes. \n\nThere are 337 students who suggested adding bacon to the menu. \nThere are 23 students who suggested adding tomatoes. \n\n337 - 23 = 314 \n\nThere are 314 more students who suggested bacon than those that suggested tomatoes.\n\n-->\n\n314.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: For Gwen's birthday she received 2 dollars from her mom. Her dad gave her 4 more dollars. If she spent 3 dollars. How much money did she still have?\nA:",
    "output": "Gwen's mom gave her 2 dollars. \nGwen's dad gave her 4 more dollars. \nThat means she had a total of 2+4=6 dollars. \nIf she spent 3 dollars, she would have 3 dollars left.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The Razorback shop makes $ 76 dollars off each jersey and $ 204 off each t-shirt. During the Arkansas and Texas tech game they sold 158 t-shirts and 2 jerseys. How much money did they make from selling the jerseys?\nA:",
    "output": "The Razorback shop makes $76 off each jersey and $204 off each t-shirt. \nDuring the Arkansas and Texas tech game they sold 158 t-shirts and 2 jerseys. \nHow much money did they make from selling the jerseys?\n\n$76 * 2 = $152\n\n-->\n\n152.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jake has 3 fewer peaches and 10 more apples than Steven. Steven has 12 peaches and 15 apples. How many more apples than peaches does Steven have?\nA:",
    "output": "Jake has 3 fewer peaches than Steven. \nThat means Jake has 9 peaches and Steven has 12 peaches. \n\nJake has 10 more apples than Steven. \nThat means Jake has 25 apples and Steven has 15 apples. \n\nSteven has 3 more apples than Jake. \nThat means Steven has 3 more apples than Jake.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel had to complete 5 pages of math homework and 2 pages of reading homework. How many more pages of math homework than reading homework did she have?\nA:",
    "output": "First, we need to find out how many pages of homework Rachel had in total. We can do this by adding 5 pages of math homework to 2 pages of reading homework. This gives us a total of 7 pages of homework. \n\nNext, we need to find out how many more pages of math homework than reading homework Rachel had. We can do this by subtracting 2 pages of reading homework from 5 pages of math homework. This gives us a difference of 3 pages. \n\nTherefore, Rachel had 3 more pages of math homework than reading homework.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Frank was reading through some books. Each book had 249 pages and it took Frank 3 days to finish each book. How many pages did he read per day?\nA:",
    "output": "Frank reads 249 pages in 3 days. \nThat's 83 pages per day.\n\n-->\n\n83.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The ring toss game at the carnival made 120 dollars in the first 20 days and 66 dollars in the remaining 16 days. How much did they make per day in the first 20 days at the carnival?\nA:",
    "output": "The game made 120 dollars in the first 20 days. \nThat's an average of 120/20, or 6 dollars per day.\n\n-->\n\n6.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Emily is making bead necklaces for her 44 friends. She made 26 necklaces and each necklace takes 2 beads. How many beads did Emily have?\nA:",
    "output": "Emily has made 26 necklaces. \nEach necklace takes 2 beads. \n\nWe can multiply to find out how many beads Emily has used in total. \n\n26 x 2 = 52\n\nEmily has used 52 beads in total.\n\n-->\n\n52.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Robin's hair was 19 inches long. If he grew 18 more inches How long is his hair now?\nA:",
    "output": "19 inches + 18 inches = 37 inches\n\n-->\n\n37.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 19 red peaches, 11 yellow peaches and 12 green peaches are in the basket. How many more red peaches than yellow peaches are in the basket?\nA:",
    "output": "There are 19 red peaches and 11 yellow peaches. \n19-11=8\nThere are 8 more red peaches than yellow peaches.\n\n-->\n\n8.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dave had 16 apps and 77 files on his phone. After deleting some apps and files he had 5 apps and 23 files left. How many apps did he delete?\nA:",
    "output": "Dave had 16 apps and 77 files. \nAfter deleting some apps and files, he had 5 apps and 23 files left. \n\nHow many apps did he delete?\n\nWe know that Dave had 16 apps and 77 files in total. We also know that after deleting some apps and files, he had 5 apps and 23 files left. So, we can say that Dave deleted 11 apps and 54 files.\n\n-->\n\n11.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with 18 kids on monday. She played tag with 10 kids on tuesday. How many more kids did she play with on monday than on tuesday?\nA:",
    "output": "On Monday, Julia played with 18 kids. \nOn Tuesday, Julia played with 10 kids. \n\nTo find out how many more kids Julia played with on Monday than on Tuesday, we need to subtract the number of kids she played with on Tuesday from the number of kids she played with on Monday. \n\n18 - 10 = 8 \n\nSo Julia played with 8 more kids on Monday than on Tuesday.\n\n-->\n\n8.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Kelly has 46 nintendo games and 132 sony games. How many sony games does she need to give away so that she will have 31 sony games left?\nA:",
    "output": "Kelly has 46 Nintendo games and 132 Sony games. \nWe want to know how many Sony games she needs to give away so that she will have 31 Sony games left. \nThat means she would have to give away 101 Sony games.\n\n-->\n\n101.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 5 red peaches and 11 green peaches are in the basket. How many more green peaches than red peaches are in the basket?\nA:",
    "output": "There are a total of 16 peaches in the basket. \nThere are 5 red peaches and 11 green peaches. \nThis means that there are 6 more green peaches than red peaches in the basket.\n\n-->\n\n6.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Nell collects baseball cards. She gave 301 of her cards to Jeff and now has 154 cards left.. How many cards did Nell have initially?\nA:",
    "output": "Nell has 154 cards left. She gave 301 of her cards to Jeff. \nNell had 301 + 154 = 455 cards in total.\n\n-->\n\n455.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 36 campers went rowing in the morning 13 campers went rowing in the afternoon and 49 campers went rowing in the evening. How many campers went rowing in all?\nA:",
    "output": "There are 36 campers who went rowing in the morning. \nThen, there are 13 more campers who went rowing in the afternoon. \nThat means, in total, there are 49 campers who went rowing in the morning and afternoon. \nLastly, there are 49 more campers who went rowing in the evening. \nThat means, in total, there are 98 campers who went rowing in all.\n\n-->\n\n98.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Josh had 4 marbles in his collection. He lost 16 marbles and found 8 new ones. How many more marbles did he lose than those he found?\nA:",
    "output": "Josh had 4 marbles. \nHe lost 16 marbles. \nThat means he now has -12 marbles. \nHe found 8 new ones. \nThat means he now has -4 marbles. \nSo he lost 16 - 8 = 8 more marbles than he found.\n\n-->\n\n8.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dave had 59 files and 15 apps on his phone. After deleting some apps and files he had 12 apps and 30 files left. How many apps did he delete?\nA:",
    "output": "We know that Dave had 59 files and 15 apps on his phone. \nWe know that after deleting some apps and files he had 12 apps and 30 files left. \n\nFrom this, we can infer that Dave deleted 3 apps and 29 files.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Kelly has 20 nintendo games and 70 sony games. How many nintendo games does she need to give away so that she will have 12 nintendo games left?\nA:",
    "output": "Kelly has 20 Nintendo games and 70 Sony games. \nShe wants to have 12 Nintendo games left. \nThat means she wants to give away 8 Nintendo games.\n\n-->\n\n8.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with 11 kids on monday. She played tag with 12 kids on tuesday. How many more kids did she play with on tuesday than on monday?\nA:",
    "output": "On Monday, Julia played with 11 kids. \nOn Tuesday, Julia played with 12 kids. \nThat means Julia played with 1 more kid on Tuesday than on Monday.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The Razorback t-shirt shop sells each t-shirt for $ 51 dollars. During the Arkansas and Texas tech game they offered a discount of $ 8 per t-shirt and sold 130 t-shirts. How much money did they make from selling the t-shirts?\nA:",
    "output": "The Razorback t-shirt shop sells each t-shirt for $51 dollars. \nDuring the Arkansas and Texas tech game they offered a discount of $8 per t-shirt and sold 130 t-shirts. \n\nThis means that the total amount of money they made from selling the t-shirts is $130*($51-$8) = $130*$43 = $5,590.\n\n-->\n\n5590.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 5 storks and 3 birds were sitting on the fence. 4 more birds came to join them. How many more birds than storks are sitting on the fence?\nA:",
    "output": "There are 5 storks and 3 birds sitting on the fence. \n4 more birds come to join them. \n\nNow there are 5 storks and 7 birds sitting on the fence. \n\nSo there are 2 more birds than storks sitting on the fence.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 10 roses in the vase. Jessica cut 8 more roses from her flower garden and put them in the vase. How many roses are there in the vase now?\nA:",
    "output": "There were 10 roses in the vase. \nJessica cut 8 more roses from her flower garden and put them in the vase. \nThat means there are 8 more roses in the vase. \nSo, 10 + 8 = 18 roses in the vase.\n\n-->\n\n18.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Bobby ate 33 pieces of candy. Then he ate 4 more. He also ate 14 pieces of chocolate. How many pieces of candy and chocolate did Bobby eat altogether?\nA:",
    "output": "Bobby ate 33 pieces of candy. \nThen he ate 4 more. \nThat means he ate a total of 33 + 4 = 37 pieces of candy. \nHe also ate 14 pieces of chocolate. \nThat means he ate a total of 37 + 14 = 51 pieces of candy and chocolate.\n\n-->\n\n51.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Bryan took a look at his books as well. He has 7 bookshelves with each having the same number of books. If he has a total of 28 books How many books are there in each bookshelf?\nA:",
    "output": "There are a total of 28 books. \nEach bookshelf has the same number of books. \nThat means that if we divide 28 by 7, we will get the number of books in each bookshelf. \n\n28 divided by 7 equals 4. \n\nThere are 4 books in each bookshelf.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Melissa scored 12 points in each game. If she scored a total of 36 points How many games did she play?\nA:",
    "output": "We know that Melissa scored 12 points in each game. \nWe also know that she scored a total of 36 points. \n\nWe want to know how many games she played. \n\nWe can set up an equation to solve this problem. \n\nWe know that the total number of points she scored is equal to the number of games she played times the number of points she scored in each game. \n\nWe can write this as: \n\n36 = x * 12 \n\nWe can solve for x by dividing both sides by 12. \n\n36/12 = x\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jack received 6 emails and sent 91 letters in the morning. He then received 2 emails and sent 74 letters in the afternoon. How many emails did Jack receive in the day?\nA:",
    "output": "In the morning, Jack received 6 emails and sent 91 letters. \nIn the afternoon, Jack received 2 more emails, for a total of 8 emails. He also sent 74 letters.\n\n-->\n\n8.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Katie had 91 ds games and her new friends had 88 games and old friends had 53 games. How many games do her friends have in all?\nA:",
    "output": "Katie has 91 DS games. \nHer new friends have 88 DS games. \nHer old friends have 53 DS games. \n\nTo find out how many games her friends have in all, we need to add up the number of games her new friends have and the number of games her old friends have. \n\n88 + 53 = 141\n\nTherefore, her friends have 141 DS games in total.\n\n-->\n\n141.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Every day Ryan spends a total of 3 hours on learning english and chinese. If he spends 2 hours on learning english everyday How many hours does he spend on learning chinese?\nA:",
    "output": "First, we know that Ryan spends a total of 3 hours on learning english and chinese. \n\nSecond, we know that he spends 2 hours on learning english everyday. \n\nThat means that he spends 1 hour on learning chinese everyday.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Bobby ate 38 pieces of candy. Then he ate 36 more. He also ate 16 pieces of chocolate. How many more pieces of candy than chocolate did Bobby eat?\nA:",
    "output": "Bobby ate 38 pieces of candy. \nThen he ate 36 more. \nHe also ate 16 pieces of chocolate. \n\nHow many more pieces of candy than chocolate did Bobby eat?\n\n38 + 36 = 74\n74 - 16 = 58\n\nBobby ate 58 more pieces of candy than chocolate.\n\n-->\n\n58.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A mailman has to give 25 pieces of junk mail to each block. If he gives 5 mails to each house in a block How many houses are there in a block?\nA:",
    "output": "The mailman has to give 25 pieces of junk mail to each block. \nThat means if the mailman gives 5 pieces of junk mail to each house, he would have given away 25 pieces of junk mail after visiting 5 houses. \nTherefore, if the mailman has to give 25 pieces of junk mail to each block, he would have to visit 5 houses in a block.\n\n-->\n\n5.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A waiter had 8 customers. After some left he still had 5 customers. Then he got 99 new customers How many customers left?\nA:",
    "output": "The waiter had 8 customers. \nSome left, so he had 5 customers. \nHe got 99 new customers. \n\nSo, the waiter had 8 customers, some left, and then he had 104 customers.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jake has 3 fewer peaches and 4 more apples than Steven. Steven has 19 apples and 15 peaches. How many more apples than peaches does Steven have?\nA:",
    "output": "Jake has 3 fewer peaches than Steven. \nThat means Jake has 15-3 = 12 peaches. \nSteven has 19 apples and 15 peaches. \nThat means Steven has 19-15 = 4 more apples than peaches. \n\nTherefore, Jake has 4 more apples than peaches.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 4 birds and 46 storks were sitting on the fence. 6 more birds came to join them. How many birds are sitting on the fence?\nA:",
    "output": "There are 4 birds and 46 storks sitting on the fence. \n6 more birds come to join them. \n\nThis means that there are now 10 birds and 46 storks sitting on the fence.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paco had 28 cookies. He ate some of them and had 7 cookies left. How many cookies did Paco eat?\nA:",
    "output": "Paco had 28 cookies. \nHe ate some of them. \nHe had 7 cookies left. \n\nWe want to know how many cookies Paco ate. \n\nWe can use subtraction to solve this problem. \n\nPaco had 28 cookies. \nHe ate some of them. \nHe had 7 cookies left. \n\nWe want to know how many cookies Paco ate. \n\nWe can use subtraction to solve this problem. \n\nWe know that Paco had 28 cookies to start with, and we know that he had 7 cookies left\n\n-->\n\n21.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Matthew had 8 crackers to give to friends. If Matthew gave 2 crackers to each his friends How many friends did he give crackers to?\nA:",
    "output": "Matthew has 8 crackers. \nIf Matthew gave 2 crackers to each of his friends, \nthen he would have given away 2 + 2 + 2 + 2 = 8 crackers. \n\nSo Matthew gave crackers to 4 friends.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 41 campers went rowing and 4 campers went hiking in the morning. 26 campers went rowing in the afternoon. How many campers went rowing and hiking in all?\nA:",
    "output": "How many campers went rowing in the morning? 41. \nHow many campers went hiking in the morning? 4. \nHow many campers went rowing in the afternoon? 26. \nHow many campers went rowing and hiking in all? 41 + 4 + 26 = 71.\n\n-->\n\n71.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Zachary did 19 push-ups in gym class today. David did 39 more push-ups than Zachary. John did 13 push-ups less than david. How many push-ups did David do?\nA:",
    "output": "Zachary did 19 push-ups. \nThat means David did 19 + some number push-ups. \nThat also means John did 19 + some number - 13 push-ups. \nNow we have two equations and two unknowns. \n19 + x = y \n19 + x - 13 = y - 39 \nWe can solve this using substitution. \nx + y = y + x \nx = y - 39 \nNow we can plug this back in to our first equation. \n19 + (y - 39) = y \n19 + y -\n\n-->\n\n58.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Last week Fred had 49 dollars and Jason had 3 dollars. Fred washed cars over the weekend and now has 112 dollars. Jason delivered newspapers and now has 63 dollars. How much money did Jason earn by delivering newspapers?\nA:",
    "output": "Fred had 49 dollars and Jason had 3 dollars. \n\nThat means that the total amount of money between the two of them is 49 + 3, or 52 dollars. \n\nFred washed cars over the weekend and now has 112 dollars. \n\nThat means that Fred earned 63 dollars from washing cars. \n\nJason delivered newspapers and now has 63 dollars. \n\nThat means that Jason earned 60 dollars from delivering newspapers.\n\n-->\n\n60.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 46 campers went rowing on a day. 43 campers went rowing in the morning and some more campers went rowing in the afternoon. How many campers went rowing in the afternoon?\nA:",
    "output": "There were 46 campers rowing in total. \n43 campers went rowing in the morning. \nThat means that 3 campers went rowing in the afternoon.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The ring toss game at the carnival made 382 dollars in the first 44 days and 374 dollars in the remaining 10 days. How much did they make in all?\nA:",
    "output": "The game made 382 dollars in the first 44 days. \nThe game made 374 dollars in the remaining 10 days. \n\nTo find out how much money the game made in total, we can add the two amounts together. \n\n382 + 374 = 756\n\nThe game made 756 dollars in total.\n\n-->\n\n756.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A book has 2 chapters. The second chapter is 36 pages long. If there are a total of 67 pages in the book How many pages are in the first chapter?\nA:",
    "output": "There are 67 pages in the book. \nThe second chapter is 36 pages long. \nThat means that the first chapter is 67-36=31 pages long.\n\n-->\n\n31.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Carol was sending out birthday invitations to her friends. Each package of invitations she bought had 3 invitations in it and she bought 2 packs. If she wants to invite 9 friends How many extra invitations will she need to buy?\nA:",
    "output": "Carol buys 2 packs of invitations. \nEach pack has 3 invitations. \nThat means she has a total of 6 invitations. \n\nHowever, she wants to invite 9 friends. So she needs 3 more invitations. Therefore, she would need to buy 1 more pack of invitations, which would give her 3 more invitations.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paul had 95 pens and 153 books. After selling some books and pens in a garage sale he had 13 books and 23 pens left. How many books did he sell in the garage sale?\nA:",
    "output": "Paul had 95 pens and 153 books. \nHe sold some books and pens in a garage sale. \nHe had 13 books and 23 pens left.\n\nHow many books did he sell in the garage sale?\n\nWe know that Paul started with 153 books, and he ended with 13 books. So, he must have sold 140 books in the garage sale.\n\n-->\n\n140.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Frank was reading through his favorite book. The book had 612 pages equally distributed over 24 chapters. It took Frank 6 days to finish the book. How many pages did he read per day?\nA:",
    "output": "Frank reads 612 pages in 6 days. \nThat's 102 pages per day. \nEach chapter has 24 pages. \nThat's 4.25 chapters per day. \n\nTherefore, Frank reads 4.25 chapters per day.\n\n-->\n\n102.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are 10 peaches distributed equally in some baskets. If each basket has 4 red peaches and 6 green peaches How many baskets of peaches are there?\nA:",
    "output": "There are 10 peaches distributed equally in some baskets. \n\nThis means that there are 10 peaches in total, and that they are distributed equally among some baskets. This also means that each basket has the same number of peaches. \n\nIf each basket has 4 red peaches and 6 green peaches, \n\nThis means that each basket has a total of 10 peaches, 4 of which are red, and 6 of which are green. \n\nHow many baskets of peaches are there? \n\nThere are a total of 10 peaches, and each basket has 10 pe\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Lewis earns $ 2 every week during the harvest. If he earns a total of $ 178 How many weeks did the harvest last?\nA:",
    "output": "$2 a week means that in one week, he earns $2. \nIn two weeks, he earns $4. \nIn three weeks, he earns $6. \n\nDo you see a pattern? \n\nIn x weeks, he earns $2x. \n\nNow we just have to solve for x! \n\n$178 = $2x \n$178/$2 = $2x/$2 \n$178/2 = x \n\n$178/2 = x \n$178/2 = 89 \n\nThe harvest lasted for 89\n\n-->\n\n89.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Danny collects bottle caps. He threw away 54 of the old ones at the park while he found 48 bottle caps new ones. Now he has 52 bottle caps in his collection. How many more bottle caps did danny throw away than those he found at the park?\nA:",
    "output": "Danny has 54 old bottle caps. \nHe throws away 54 old bottle caps. \nHe now has 0 old bottle caps. \nHe finds 48 new bottle caps. \nHe now has 48 new bottle caps. \n\nSo, Danny threw away 54 old bottle caps and found 48 new bottle caps, for a difference of 54 - 48 = 6.\n\n-->\n\n6.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The grasshopper and the frog had a jumping contest. The grasshopper jumped 35 inches. The grasshopper jumped 4 inches farther than the frog. How much did they jump altogether?\nA:",
    "output": "The grasshopper jumped 35 inches. \nThe grasshopper jumped 4 inches farther than the frog. \n\nThis means that the frog jumped 31 inches. \n\nNow we can add these two numbers together to get our answer: \n\n35 inches + 31 inches = 66 inches\n\n-->\n\n66.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: In a school there are 569 girls and 236 boys. How many more girls than boys does the school have?\nA:",
    "output": "There are 569 girls and 236 boys. \nThat means there are 569 + 236 = 805 students in total. \nNow we just need to subtract 236 from 569 to find out how many more girls there are than boys. \n569 - 236 = 333 \nSo, there are 333 more girls than boys in the school.\n\n-->\n\n333.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Debby bought 153 water bottles when they were on sale. She drank the same number of bottles each day. If the bottles lasted for 17 days How many bottles did she drink each day?\nA:",
    "output": "Debby bought 153 water bottles. \nShe drank the same number of bottles each day. \nThe bottles lasted for 17 days. \n\nThat means that if she drank the same number of bottles each day, she would finish all 153 bottles in 17 days. \n\n153 ÷ 17 = 9\n\nThat means she drank 9 bottles each day.\n\n-->\n\n9.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: After Olivia visited a supermarket there were 29 dollars left. If there were 54 dollars in her wallet initially How much did she spend?\nA:",
    "output": "Olivia has 54 dollars in her wallet. \nShe spends some of her money at the supermarket. \nNow she has 29 dollars left. \n\nHow much did she spend?\n\nOlivia spent 54 - 29 = 25 dollars at the supermarket.\n\n-->\n\n25.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Haley grew 20 trees in her backyard. After a typhoon 4 trees were left. How many trees died in the typhoon?\nA:",
    "output": "Haley grew 20 trees in her backyard. \nAfter a typhoon, 4 trees were left. \n\nThis means that 16 trees died in the typhoon.\n\n-->\n\n16.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jake has 7 fewer peaches than Steven who has 14 more peaches than Jill. Steven has 15 peaches. How many peaches does Jake have?\nA:",
    "output": "Steven has 15 peaches. \nSteven has 14 more peaches than Jill. \nThat means Jill has 1 peach. \nJake has 7 fewer peaches than Steven. \nThat means Jake has 8 peaches.\n\n-->\n\n8.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Zachary did 44 push-ups and 17 crunches in gym class today. David did 29 more push-ups but 13 less crunches than zachary. How many crunches did David do?\nA:",
    "output": "Zachary did 44 push-ups and 17 crunches. \nDavid did 29 more push-ups than Zachary, so he did 73 push-ups. \nDavid did 13 less crunches than Zachary, so he did 4 crunches.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 5 children were riding on the bus. At the bus stop 63 children got off the bus while some more got on the bus. Then there were 14 children altogether on the bus. How many more children got on the bus than those that got off?\nA:",
    "output": "There were 5 children on the bus to start. \n63 children got off the bus. \nThat means there are 68 children accounted for so far. \n14 children are on the bus now. \n68 - 14 = 54\n\n54 children got off the bus.\n\n-->\n\n9.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Debby bought 95 soda bottles and 180 water bottles when they were on sale. If she drank 15 water bottles and 54 soda bottles a day How many days would the water bottles last?\nA:",
    "output": "There are 95 soda bottles and 180 water bottles. \nIf she drank 54 soda bottles a day, that would be \n$$\\frac{95}{54} = 1 \\text{ day and } \\frac{35}{54} \\text{ bottles left over}$$\nNow, if she drank 15 water bottles a day, that would be \n$$\\frac{180}{15} = 12 \\text{ days and } \\frac{0}{15} \\text{ bottles left over}$$\nSo, the water bottles would last 12 days.\n\n-->\n\n12.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Faye had 35 packs of pencils each one having 4 pencils. She was placing her pencils into rows with 2 pencils in each row. How many rows could she make?\nA:",
    "output": "Fay has 35 packs of pencils. \nEach pack has 4 pencils. \nThat means she has a total of 140 pencils. \nShe wants to make rows of 2 pencils each. \nThat means she can make a total of 70 rows.\n\n-->\n\n70.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Each Ferris wheel in paradise park has 19 seats. Each seat in a Ferris wheel can hold 15 people. How many people can ride 20 Ferris wheels at the same time?\nA:",
    "output": "There are 19 seats in each Ferris wheel. \nThere are 15 people in each seat. \nThere are 20 Ferris wheels. \n19 seats x 15 people x 20 Ferris wheels = \n19 x 15 x 20 = \n19 x 300 = \n5,700 people can ride 20 Ferris wheels at the same time.\n\n-->\n\n5700.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Bobby had 19 pieces of candy. He ate 2 pieces of candy. How many pieces of candy does he still have left?\nA:",
    "output": "Bobby had 19 pieces of candy. \nHe ate 2 pieces of candy. \n\nThat means he has 19 - 2 = 17 pieces of candy left.\n\n-->\n\n17.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paul had 108 books and 55 pens. After selling some books and pens in a garage sale he had 66 books and 59 pens left. How many books did he sell in the garage sale?\nA:",
    "output": "We know that Paul had 108 books and 55 pens before the garage sale. \nWe know that after the garage sale, he had 66 books and 59 pens. \n\nThis means that he sold 42 books and 16 pens in the garage sale.\n\n-->\n\n42.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Marco and his dad went strawberry picking. Marco's strawberries weighed 15 pounds. If together their strawberries weighed 37 pounds. How much did his dad's strawberries weigh?\nA:",
    "output": "Marco's strawberries weigh 15 pounds. \n\nThat means that if we add his dad's strawberries to the mix, the total weight of the strawberries would be 37 pounds. \n\nWe know that Marco's strawberries weigh 15 pounds and that the total weight of the strawberries is 37 pounds. \n\nThat means that his dad's strawberries must weigh 22 pounds.\n\n-->\n\n22.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paul got a box of 521 crayons and 66 erasers for his birthday. At the end of the school year he only had 154 left while not having lost a single erasers. How many crayons had been lost or given away?\nA:",
    "output": "Paul started with 521 crayons and 66 erasers. \nAt the end of the school year, he had 154 crayons and 66 erasers. \n\nSo we can say that he lost 367 crayons and gave them away, or he gave away 367 crayons total.\n\n-->\n\n367.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Danny collects bottle caps and wrappers. He found 10 bottle caps and 62 wrappers at the park. Now he has 27 bottle caps and 43 wrappers in his collection. How many more wrappers than bottle caps does danny have now?\nA:",
    "output": "First, Danny collected 10 bottle caps and 62 wrappers. \nThen, he had 27 bottle caps and 43 wrappers in his collection. \nNow we need to find out how many more wrappers than bottle caps Danny has now. \nWe can do this by subtracting the number of bottle caps from the number of wrappers: \n43 - 27 = 16 \nSo Danny has 16 more wrappers than bottle caps now.\n\n-->\n\n16.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Tiffany was collecting cans for recycling. On monday she had 8 bags of cans. She found 10 bags of cans on the next day and 4 bags of cans the day after that. How many bags did she find after monday?\nA:",
    "output": "On Monday, Tiffany had 8 bags of cans. \nOn Tuesday, Tiffany found 10 more bags of cans, so she had 18 bags of cans in total. \nOn Wednesday, Tiffany found 4 more bags of cans, so she had 22 bags of cans in total. \n\nTherefore, Tiffany found 14 bags of cans after Monday.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 4 birds and 3 storks were sitting on the fence. 6 more storks came to join them. How many more storks than birds are sitting on the fence?\nA:",
    "output": "There are 4 birds and 3 storks sitting on the fence. \n\n6 more storks came to join them. \n\nThat means there are now 9 storks and 4 birds sitting on the fence. \n\nThere are 5 more storks than birds sitting on the fence.\n\n-->\n\n5.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jessie weighed 114 kilograms. After she started to go jogging everyday she lost 50 kilograms in the first week and 60 kilograms in the second week. How much does she weigh now?\nA:",
    "output": "In the first week, Jessie lost 50 kg. So, 114 kg - 50 kg = 64 kg. \nIn the second week, Jessie lost 60 kg. So, 64 kg - 60 kg = 4 kg. \n\nTherefore, Jessie weighs 4 kg now.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 6 packs of dvds can be bought with 120 dollars. How much does each pack cost?\nA:",
    "output": "There are 6 packs of DVDs. \nEach pack costs the same amount. \nThe total cost of all 6 packs is 120 dollars. \n\nThis means that if we divide 120 dollars by 6, we will find out how much each pack costs. \n\n120 divided by 6 is 20. \n\nEach pack costs 20 dollars.\n\n-->\n\n20.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with 14 kids on monday, 2 kids on tuesday and 8 kids on wednesday. How many more kids did she play with on monday than on wednesday?\nA:",
    "output": "On Monday, Julia played with 14 kids. \nOn Tuesday, Julia played with 2 fewer kids than she did on Monday. So she played with 14 - 2 = 12 kids on Tuesday. \nOn Wednesday, Julia played with 8 kids. \nTo find out how many more kids Julia played with on Monday than on Wednesday, we need to find the difference between the number of kids she played with on Monday and the number of kids she played with on Wednesday. So we need to find 14 - 8. \n14 - 8 = 6. \nSo Julia played with 6 more kids on Monday than she did\n\n-->\n\n6.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 73 parents, 724 pupils and 744 teachers in the program. How many people were present in the program?\nA:",
    "output": "There were 73 parents, 724 pupils and 744 teachers in the program. \nThere were 73 + 724 = 797 parents and pupils in the program. \nThere were 797 + 744 = 1541 people in the program.\n\n-->\n\n1541.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: At the stop 8 more people got on the train. Initially there were 11 people on the train. How many people are there on the train now?\nA:",
    "output": "There were 11 people on the train. \n8 more people got on the train. \n\nThat means there are now 11 + 8 = 19 people on the train.\n\n-->\n\n19.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Frank had 33 pieces of candy. He lost 24 of them. If he put the remaining pieces into bags with 9 pieces in each bag How many bags would he have?\nA:",
    "output": "Frank has 33 pieces of candy. \nHe loses 24 of them. \nThat means he's left with 9 pieces of candy. \nAnd if he put the remaining pieces into bags with 9 pieces in each bag, he would have 1 bag.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Bryan took a look at his books as well. If he has 34 books distributed equally in 2 bookshelves How many books are there in each bookshelf?\nA:",
    "output": "Bryan has 34 books. \nHe wants to put them in two bookshelves. \nThat means that each bookshelf will have the same number of books. \n\nSo if we divide 34 by 2, we get 17. That means that each bookshelf has 17 books.\n\n-->\n\n17.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A waiter had 3 customers. After some more arrived he had 8 customers. How many new customers arrived?\nA:",
    "output": "The waiter had 3 customers. \nThen, some more arrived. \nThat means that the waiter had 3 customers, and then some more arrived, which means that 5 customers arrived.\n\n-->\n\n5.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: They decided to hold the party in their backyard. They have some sets of tables, each having the 3 chairs. If there are a total of 9 chairs in the backyard How many sets of tables do they have?\nA:",
    "output": "There are 9 chairs in the backyard. \nEach set of tables has 3 chairs. \nThat means that if we divide 9 by 3, we will know how many sets of tables there are. \n9 divided by 3 is 3. \nThat means that there are 3 sets of tables in the backyard.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Luke played a trivia game and scored 154 points. If he gained the 11 points in each round How many rounds did he play?\nA:",
    "output": "In each round, Luke scored 11 points. \nIn other words, for every 1 round, Luke scored 11 points. \n\n154 points ÷ 11 points per round = 14 rounds\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are 65 baskets of peaches. Each basket has 7 red peaches and 3 green peaches. How many peaches are in each basket?\nA:",
    "output": "There are 65 baskets of peaches. \nEach basket has 7 red peaches and 3 green peaches. \nHow many peaches are in each basket?\n\nThere are 7 red peaches and 3 green peaches in each basket. \nTherefore, there are 10 peaches in each basket.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jesse's room is 11 feet long and 15 feet wide. If she already has 16 square feet of carpet How much more carpet does she need to cover the whole floor?\nA:",
    "output": "We know that 1 square foot is equal to 1 foot by 1 foot. \nWe also know that Jesse's room is 11 feet long and 15 feet wide. \nWe want to know how many square feet of carpet she needs to cover the whole floor. \n\nWe can calculate the area of her room by multiplying the length and width. \n\n11 feet * 15 feet = 165 square feet \n\nWe know that she already has 16 square feet of carpet, so we need to subtract that from the total area of her room. \n\n165 square feet - 16 square feet = 149 square\n\n-->\n\n149.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jake has 6 fewer peaches and 8 more apples than Steven. Steven has 17 peaches and 16 apples. How many more peaches than apples does Steven have?\nA:",
    "output": "Jake has 6 fewer peaches and 8 more apples than Steven. \nThat means that Jake has 11 peaches and 24 apples. \nSteven has 17 peaches and 16 apples. \nThat means that Steven has 1 more peach than apple.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Danny collects bottle caps. He threw away 60 of the old ones at the park while he found 58 bottle caps new ones. Now he has 67 bottle caps in his collection. How many bottle caps did danny have at first?\nA:",
    "output": "Danny has 67 bottle caps now. \nHe found 58 new bottle caps, which means he had 9 bottle caps before he found the new ones. \nHe threw away 60 old bottle caps, which means he had 69 bottle caps before he threw them away. \n\nTherefore, Danny had 69 bottle caps at first.\n\n-->\n\n69.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Josh had some marbles in his collection. He lost 21 marbles. If he has 12 marbles now How many marbles did he have in his collection?\nA:",
    "output": "Josh had some marbles in his collection. \n\nThis is a given. \n\nHe lost 21 marbles. \n\nThis is also a given. \n\nIf he has 12 marbles now\n\nThis is what we are trying to find out. \n\nHow many marbles did he have in his collection?\n\nThis is our final answer. \n\nWe can set this up as a equation and solve it. \n\nJosh had some marbles in his collection. He lost 21 marbles. If he has 12 marbles now How many marbles did he\n\n-->\n\n33.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jessie currently weighs 27 kilograms. After she started to go jogging everyday she lost 101 kilograms. How much did she weigh before starting to jog?\nA:",
    "output": "We know that Jessie started out weighing 27 kg. \nWe know that she lost 101 kg in total. \n\nWe want to know how much she weighed before starting to jog. \n\nWe can set up an equation to solve this problem. \n\nWe know that Jessie's current weight is 27 kg. We also know that she lost 101 kg in total. So we can say that her original weight was 27 kg + 101 kg. \n\nTherefore, Jessie's original weight was 128 kg.\n\n-->\n\n128.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dan has $ 4. For a total of $ 3 he bought 10 candy bar each one costing the same amount of money. How much money is left?\nA:",
    "output": "Dan has $4. \nFor a total of $3, he bought 10 candy bars. \nEach candy bar cost the same amount of money. \n\nHow much money is left? \n\n$4 - $3 = $1\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Emily is making bead necklaces for her friends. She was able to make 6 necklaces and she had 18 beads. How many beads did each necklace need?\nA:",
    "output": "Emily made 6 necklaces. \nEach necklace had 18 beads. \n\nWe want to know how many beads each necklace needed. \n\nWe can divide 18 by 6 to find out how many beads each necklace needed. \n\n18 divided by 6 equals 3. \n\nEach necklace needed 3 beads.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Tiffany was collecting cans for recycling. On monday she had 3 bags of cans. The next day she found 7 more bags of cans and 44 bags of bottles. How many bags of cans did she have altogether?\nA:",
    "output": "On Monday, Tiffany had 3 bags of cans. \nOn Tuesday, she found 7 more bags of cans and 44 bags of bottles. \nSo, altogether, Tiffany had 3 + 7 = 10 bags of cans.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Bobby had 21 pieces of candy. He ate 5 pieces of candy. Then he ate 9 more. How many pieces of candy does he still have left?\nA:",
    "output": "Bobby had 21 pieces of candy. \nHe ate 5 pieces of candy. \nThat means he has 21-5=16 pieces of candy left. \nThen he ate 9 more. \nThat means he has 16-9=7 pieces of candy left.\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Baker made 54 cakes. He sold some of them. If he still has 13 cakes left How many cakes did baker sell?\nA:",
    "output": "Baker made 54 cakes. \nHe sold some of them. \nIf he still has 13 cakes left, \n\nthen he sold 41 cakes.\n\n-->\n\n41.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: During summer break 819058 kids from Lawrence county go to camp and the other 668278 kids stay home. How many more kids spent their summer break at the camp compared to those who stayed home?\nA:",
    "output": "There are 819058 kids from Lawrence county go to camp. \nThere are 668278 kids who stayed home. \nThere are 150780 more kids who spent their summer break at the camp.\n\n-->\n\n150780.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 2 birds were sitting on the fence. Some more birds came to join them. If there are a total of 6 birds on the fence now How many more birds had come to sit on the fence?\nA:",
    "output": "There were 2 birds sitting on the fence. \nSome more birds came to join them. \nThat means that there are more than 2 birds on the fence now. \nIf there are a total of 6 birds on the fence now, that means that 4 more birds had come to sit on the fence.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jesse's room is 12 feet long and 11 feet wide. How much longer is her room than it is wide?\nA:",
    "output": "We can start by subtracting 11 from 12. \n\nThis gives us 1. \n\nThis means that her room is 1 foot longer than it is wide.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jerry had 2 action figures and 10 books on a shelf in his room. Later he added 4 more action figures to the shelf. How many more books than action figures were on his shelf?\nA:",
    "output": "Jerry had 2 action figures and 10 books on a shelf in his room. \nThis means that there are 2 action figures and 10 books, for a total of 12 items on the shelf. \nLater he added 4 more action figures to the shelf. \nThis means that there are now 2 + 4 = 6 action figures and 10 books, for a total of 16 items on the shelf. \nTherefore, there are 16 - 12 = 4 more books than action figures on Jerry's shelf.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Mary is baking a cake. The recipe calls for 5 cups of sugar and 13 cups of flour. She already put in some cups of flour. If she still needs 12 more cups of flour How many cups of flour did she put in?\nA:",
    "output": "The recipe calls for 5 cups of sugar and 13 cups of flour.\nShe already put in some cups of flour.\n\nThat means that she put in less than 13 cups of flour. Let's say she put in x cups of flour. \n\nIf she still needs 12 more cups of flour, that means she needs a total of 12 + x cups of flour. \nWe know that the recipe calls for a total of 13 cups of flour, so: \n\n12 + x = 13 \n\nThat means x = 1 cup of flour.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel had to complete 9 pages of math homework, 11 pages of reading homework and 29 more pages of biology homework. How many pages of math and reading homework did she have to complete?\nA:",
    "output": "First, we can see that Rachel had to complete 9 pages of math homework and 11 pages of reading homework. \n\nNext, we can see that she had to complete 29 more pages of biology homework. \n\nThis means that she had to complete a total of 9 + 11 + 29 = 49 pages of homework. \n\nTherefore, she had to complete 9 + 11 = 20 pages of math and reading homework.\n\n-->\n\n20.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paige was helping her mom plant flowers in 8 flowerbeds. They planted 32 seeds altogether. If they put same number of seeds in each flower bed How many seeds did they plant in each flowerbed?\nA:",
    "output": "There are 8 flowerbeds. \nEach flowerbed has the same number of seeds. \nThere are 32 seeds altogether. \n\nHow many seeds are in each flowerbed?\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He then went to see the oranges being harvested. He found out that they harvest 25 sacks of unripe oranges and 5 sacks of ripe oranges per day. How many sacks of ripe oranges will they have after 73 days of harvest?\nA:",
    "output": "On the first day, they harvest 25 sacks of unripe oranges and 5 sacks of ripe oranges. \nOn the second day, they harvest 25 sacks of unripe oranges and 5 sacks of ripe oranges. \nOn the third day, they harvest 25 sacks of unripe oranges and 5 sacks of ripe oranges. \n\nThis continues until the 73rd day. So, in total, they will have harvested 73 x 5 = 365 sacks of ripe oranges.\n\n-->\n\n365.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paul had 134 books. After giving 39 books to his friend and selling some books in a garage sale he had 68 books left. How many books did he sell in the garage sale?\nA:",
    "output": "Paul had 134 books. \nHe gave 39 books to his friend. \nThat means he had 134 - 39 = 95 books left. \nHe sold some books in a garage sale. \nThat means he had 95 - x books left, where x is the number of books he sold. \nWe know he had 68 books left, so 95 - x = 68. \nThat means x = 95 - 68 = 27. \n\nSo Paul sold 27 books in the garage sale.\n\n-->\n\n27.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paco had 97 salty cookies and 34 sweet cookies. He ate 15 sweet cookies and 56 salty cookies. How many sweet cookies did Paco have left?\nA:",
    "output": "Paco had 97 salty cookies and 34 sweet cookies. \nHe ate 15 sweet cookies and 56 salty cookies. \n\nThat means that he had 97-56=41 salty cookies left, and 34-15=19 sweet cookies left.\n\n-->\n\n19.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Faye was placing 12 pencils equally into 3 rows. How many pencils did she place in each row?\nA:",
    "output": "Faye placed 12 pencils into 3 rows. \nThat means that she placed 4 pencils into each row.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with 15 kids on monday, 18 kids on tuesday and 7 kids on wednesday. How many more kids did she play with on monday and tuesday than on wednesday?\nA:",
    "output": "On Monday, Julia played with 15 kids. \nOn Tuesday, Julia played with 18 kids. \nOn Wednesday, Julia played with 7 kids. \nTo find out how many more kids Julia played with on Monday and Tuesday, we need to add 15 and 18 which equals 33. \nTo find out how many more kids Julia played with on Monday and Tuesday than on Wednesday, we need to subtract 7 from 33 which equals 26. \nTherefore, Julia played with 26 more kids on Monday and Tuesday than on Wednesday.\n\n-->\n\n26.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Baker made 133 cakes. If he sold 51 of them How many more cakes did baker make than those he sold?\nA:",
    "output": "First, let's think about what the question is asking. The question is asking how many more cakes did baker make than those he sold. So we want to find out how many cakes the baker made in total, and then subtract the number of cakes that he sold. \n\nWe are given that the baker made 133 cakes. We are also given that the baker sold 51 of them. So the baker made a total of 133 cakes, and he sold 51 of them. \n\nNow we want to find out how many more cakes the baker made than those he sold. To do this, we need to subtract\n\n-->\n\n82.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are 18 bananas in Philip's banana collection. If the bananas are organized into groups of size 2 How many groups are there?\nA:",
    "output": "There are 18 bananas in Philip's banana collection. \nIf the bananas are organized into groups of size 2, \nHow many groups are there?\n\nThere are 9 groups of 2 bananas.\n\n-->\n\n9.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dan has $ 5. He bought a chocolate for $ 3 and a candy bar for $ 7. How much money did he spend to buy candy bar than he did to buy chocolate?\nA:",
    "output": "Dan has $5. \nHe buys a chocolate for $3. \nHe buys a candy bar for $7. \n\nHe spends more money on the candy bar than he does on the chocolate.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jessie weighed 92 kilograms. After she started to go jogging everyday she lost 56 kilograms in the first week and 99 kilograms in the second week. How much did she weigh after the first week of jogging?\nA:",
    "output": "First, we need to calculate how much she weighed after the first week. We know that she weighed 92 kg at the start, and she lost 56 kg in the first week. This means that:\n\n92 kg - 56 kg = 36 kg\n\nSo, she weighed 36 kg after the first week.\n\n-->\n\n36.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 21 children were riding on the bus. At the bus stop 10 children got off the bus while some more got on the bus. Then there were 16 children altogether on the bus. How many children got on the bus at the bus stop?\nA:",
    "output": "There were 21 children on the bus to start. \n10 children got off the bus, so now there are 11 children on the bus. \nSome more children got on the bus, so now there are 16 children on the bus. \n\nWe can see that 5 children must have gotten on the bus at the bus stop.\n\n-->\n\n5.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Baker made 62 cakes. Then he made 149 more cakes. He sold 144 of them. How many cakes would baker still have?\nA:",
    "output": "Baker made 62 cakes. \nThen he made 149 more cakes. \nHe sold 144 of them. \n\nHow many cakes would baker still have?\n\nBaker would still have 62 + 149 - 144 = 67 cakes.\n\n-->\n\n67.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paul got a box of some crayons for his birthday. By the end of the school year he only had 291 crayons left since he had either lost or given away 315 of them. How many crayons did he get for his birthday?\nA:",
    "output": "Paul got a box of some crayons for his birthday. \nBy the end of the school year he only had 291 crayons left. \n\nSo we know that he started with a box of at least 291 crayons, and that he lost or gave away 315 crayons. \n\nTo solve this, we can add 291 + 315 to find out how many crayons he had in total. \n\n291 + 315 = 606 \n\nSo Paul had 606 crayons in total.\n\n-->\n\n606.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Robin has some packages of gum. There are 3 pieces in each package and a total of 42 pieces of gum. How many packages does Robin have?\nA:",
    "output": "We know that there are 3 pieces of gum in each package. \nWe also know that there are 42 pieces of gum in total. \n\nWe can set up an equation to solve this problem: \n\n3x = 42 \n\nWe can solve for x by dividing both sides by 3: \n\nx = 42/3 \n\nWe can interpret this answer in words: \n\nRobin has 14 packages of gum.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Every day Ryan spends 6 hours on learning english and 5 hours on learning chinese. If he learns for 2 days How many hours does he spend on learning english in all?\nA:",
    "output": "On the first day, Ryan spends 6 hours on learning English and 5 hours on learning Chinese. \nOn the second day, Ryan spends 6 hours on learning English and 5 hours on learning Chinese. \n\nIn total, Ryan spends 12 hours on learning English and 10 hours on learning Chinese.\n\n-->\n\n12.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Bobby had 22 pieces of candy. He ate some pieces of candy. Then he ate 5 more. If he still has 8 pieces of candy left How many pieces of candy had he eaten at the start?\nA:",
    "output": "Bobby had 22 pieces of candy. \nHe ate some pieces of candy. \nHe ate 5 more. \n\nThat means he ate a total of 5 + some pieces of candy. \n\nWe know that he has 8 pieces of candy left, which means he has 22 - 8 = 14 pieces of candy total. \n\nSo, he ate 14 - 5 = 9 pieces of candy.\n\n-->\n\n9.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: If each pack costs 81 dollars How much will it cost to buy 33 packs of dvds?\nA:",
    "output": "There are 33 packs. \nEach pack costs 81 dollars. \nSo we need to multiply 81 dollars by 33 packs. \n\n81 dollars * 33 packs = 2,673 dollars\n\n-->\n\n2673.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 61 parents in the program and 177 pupils too. The program could seat 44 people How many people were present in the program?\nA:",
    "output": "There were 61 parents in the program. \nThere were 177 pupils in the program. \nThe program could seat 44 people. \nThere were a total of 61 + 177 = 238 people in the program.\n\n-->\n\n238.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: At the arcade Dave had won 19 tickets. If he used 12 to buy some toys and 7 more to buy some clothes How many more tickets did Dave use to buy toys than he did to buy clothes?\nA:",
    "output": "Dave won 19 tickets. \nHe used 12 tickets to buy toys. \nThat means he has 7 tickets left. \nHe used 7 tickets to buy clothes. \nThat means he has 0 tickets left. \nDave used 12 tickets to buy toys and 7 tickets to buy clothes. \nDave used 5 more tickets to buy toys than he did to buy clothes.\n\n-->\n\n5.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A grocery store had 30 bottles of regular soda, 8 bottles of diet soda and 41 apples. How many bottles did they have total?\nA:",
    "output": "There are 30 bottles of regular soda and 8 bottles of diet soda. \nThis means that in total, there are 38 bottles of soda.\n\n-->\n\n38.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Some campers went rowing in the morning while 7 campers went rowing in the afternoon. If a total of 60 campers went rowing that day How many campers went rowing in the morning?\nA:",
    "output": "Some campers went rowing in the morning. This means that not all 60 campers went rowing in the morning. \n7 campers went rowing in the afternoon. This means that 53 campers went rowing in the morning. \n\nTherefore, 53 campers went rowing in the morning.\n\n-->\n\n53.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He then went to see the oranges being harvested. He found out that they harvest 74 sacks per day and discard 71 of them. How many sacks of oranges will they have after 51 days of harvest?\nA:",
    "output": "On the first day, they harvest 74 sacks and discard 71, so they are left with 3 sacks. \nOn the second day, they harvest 74 sacks and discard 71, so they are left with 6 sacks. \nOn the third day, they harvest 74 sacks and discard 71, so they are left with 9 sacks. \nThis continues until day 51, where they will have 3*51=153 sacks of oranges.\n\n-->\n\n153.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jerry had 7 books and 3 action figures on a shelf in his room. Later he added 2 more action figures to the shelf. How many more books than action figures were on his shelf?\nA:",
    "output": "Jerry had 7 books and 3 action figures on a shelf in his room. \n\nThat means that there were 4 more books than action figures. \n\nLater he added 2 more action figures to the shelf. \n\nThat means that there are now 2 more books than action figures.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 26 children were riding on the bus. At the bus stop 38 more children got on the bus. How many children are on the bus now?\nA:",
    "output": "There were 26 children on the bus. \n38 more children got on the bus. \nThat means there are now 26 + 38 = 64 children on the bus.\n\n-->\n\n64.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Josh had 21 marbles in his collection. He found 7 marbles. How many marbles does he have now?\nA:",
    "output": "Josh had 21 marbles. \nHe found 7 marbles. \n\nSo, he has 7 + 21 = 28 marbles now.\n\n-->\n\n28.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jake brought 6 balloons to the park. If Jake brought 4 more balloons than the number of balloons that Allan brought How many balloons did Allan bring to the park?\nA:",
    "output": "Jake brought 6 balloons to the park. \n\nThat means Allan brought 2 balloons to the park.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: For Gwen's birthday she received 5 dollars from her dad. Her mom gave her 2 more dollars. If she spent 6 dollars. How much more money did she receive from her dad than she did from her mom?\nA:",
    "output": "Gwen's dad gave her 5 dollars. \nGwen's mom gave her 2 dollars. \nGwen spent 6 dollars. \n\nWe want to know how much more money Gwen received from her dad than she did from her mom. \n\nGwen received 5 dollars from her dad. \nGwen received 2 dollars from her mom. \n\nGwen received 3 more dollars from her dad than she did from her mom.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Robin's hair was 14 inches long. It grew by 8 inches. Then he cut off 20 inches. How long is his hair now?\nA:",
    "output": "Robin's hair was 14 inches long. \nIt grew by 8 inches. \nThat means it's now 22 inches long. \nThen he cut off 20 inches. \nThat means his hair is now 2 inches long.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Edward spent $ 16 to buy 92 books each book costing him the same amount of money. Now he has $ 6. How much did Edward have before he spent his money?\nA:",
    "output": "We know that Edward spent $16 on 92 books. \nThat means that for every book, he spent $16/92, or $0.1739. \nWe also know that he has $6 left. \nThat means that he had $16 + $6, or $22 before he spent his money.\n\n-->\n\n22.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: During summer break 34044 kids from Lawrence county go to camp and the other 134867 kids stay home. An additional 424944 kids from outside the county attended the camp. How many kids in total attended the camp?\nA:",
    "output": "There are 34044 kids from Lawrence county go to camp.\nThere are 134867 kids from Lawrence county stay home.\nThere are 424944 kids from outside the county attended the camp.\nSo the total number of kids who attended the camp is 34044 + 424944 = 458988.\n\n-->\n\n458988.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Baker made 14 cakes and 153 pastries. If he sold 8 pastries and 97 cakes How many more cakes than pastries did baker sell?\nA:",
    "output": "First, we need to figure out how many pastries the baker has left. We know that the baker started with 153 pastries, and he sold 8 pastries. So the baker has 153 - 8 = 145 pastries left. \nNow, we need to figure out how many cakes the baker has left. We know that the baker started with 14 cakes, and he sold 97 cakes. So the baker has 14 - 97 = -83 cakes left. \nFinally, we need to figure out how many more cakes than pastries the baker sold. We know that the baker sold 97 cakes and 8 pastries.\n\n-->\n\n89.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paco had 8 sweet cookies and 6 salty cookies. He ate 20 sweet cookies and 34 salty cookies. How many more salty cookies than sweet cookies did he eat?\nA:",
    "output": "Paco had 8 sweet cookies and 6 salty cookies. \nHe ate 20 sweet cookies and 34 salty cookies. \n\nHow many more salty cookies than sweet cookies did he eat?\n\nThere are 34-20=14 more salty cookies than sweet cookies.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A grocery store had 79 bottles of regular soda, 53 bottles of diet soda and 42 apples. How many more bottles of regular soda than diet soda did they have?\nA:",
    "output": "There are 79 bottles of regular soda and 53 bottles of diet soda. \nTo find out how many more bottles of regular soda than diet soda, we need to subtract the number of diet soda bottles from the number of regular soda bottles. \n79 - 53 = 26 \nThere are 26 more bottles of regular soda than diet soda.\n\n-->\n\n26.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Carol was sending out birthday invitations to 12 friends. She bought 3 packs each one having the same number of invitations. How many invitations are in each pack?\nA:",
    "output": "Carol is sending out 12 invitations. \nShe bought 3 packs. \nEach pack has the same number of invitations. \n\nThat means that the total number of invitations is a multiple of 3. The smallest number that is a multiple of 3 and is also 12 is 12. So, each pack has 4 invitations.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Josh had 22 marbles in his collection. Jack gave him 20 marbles. How many marbles does Josh have now?\nA:",
    "output": "Josh had 22 marbles. \nJack gave him 20 marbles. \n\nThat means Jack gave Josh a total of 20 marbles. So now Josh has 22 + 20 = 42 marbles.\n\n-->\n\n42.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Faye had 31 packs of pencils each one having 6 pencils. She was placing her pencils into rows with 19 pencils in each row. How many pencils does she have?\nA:",
    "output": "Fay has 31 packs of pencils. Each pack has 6 pencils. \nThat means she has 186 pencils in total. \nNow, she wants to put them in rows with 19 pencils in each row. \nThat means she can make 9 and a half rows. \n9 rows with 19 pencils, and 1 row with 10 pencils. \nSo she would have 9 rows with 171 pencils, and 1 row with 10 pencils. \nThat's a total of 181 pencils. \n5 pencils are left over. \nSo Faye has 186 pencil\n\n-->\n\n186.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jake has 84 more apples and 10 fewer peaches than Steven. Steven has 13 peaches and 52 apples. How many peaches does Jake have?\nA:",
    "output": "Jake has 84 more apples than Steven. \nThat means Jake has 84 + 52 = 136 apples. \nJake has 10 fewer peaches than Steven. \nThat means Jake has 13 - 10 = 3 peaches.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jack received 4 emails and sent 2 letters in the morning. He then received 6 emails and sent 8 letters in the afternoon. How many emails did Jack send in the day?\nA:",
    "output": "In the morning, Jack received 4 emails and sent 2 letters. \nIn the afternoon, Jack received 6 more emails (for a total of 10) and sent 8 more letters (for a total of 10). \nSo Jack sent 10 emails in the day.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dan has $ 2. He bought some candy bar for $ 6 each one costing $ 3. How many candy bar did he buy?\nA:",
    "output": "Dan has $2. \nHe buys candy bars for $6 each. \nEach candy bar costs $3. \n\nHow many candy bars did he buy? \n\nHe bought 2 candy bars.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Lucy went to the grocery store. She bought 4 packs of cookie, 22 packs of cake and 16 packs of chocolate. How many packs of groceries did she buy in all?\nA:",
    "output": "Lucy went to the grocery store. \n\nShe bought 4 packs of cookie, 22 packs of cake and 16 packs of chocolate. \n\nHow many packs of groceries did she buy in all?\n\nIn all, Lucy bought 4 + 22 + 16 = 42 packs of groceries.\n\n-->\n\n42.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The school has 304 grades and each grade has 75 students How many students were there in total?\nA:",
    "output": "There are 304 grades. \nEach grade has 75 students. \n\nWe want to find out how many students were there in total. \n\nWe can multiply 304 and 75 to find out how many students were there in total. \n\n304 x 75 = 22,800\n\n-->\n\n22800.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Bobby had 32 pieces of candy. He ate some pieces of candy. If he has 20 pieces of candy left How many pieces of candy did Bobby eat?\nA:",
    "output": "Bobby had 32 pieces of candy. \nHe ate some pieces of candy. \n\nThis means that the number of pieces of candy Bobby had before he ate some candy is greater than the number of pieces of candy Bobby has now. \n\nWe know that Bobby has 20 pieces of candy now. \n\nThis means that Bobby ate 12 pieces of candy.\n\n-->\n\n12.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: In Haley's class 4 are boys who love to play marbles. If Haley has 23 marbles and wants to keep 15 marbles for herself How many will each of the boys receive?\nA:",
    "output": "Haley has 23 marbles. \nShe wants to keep 15 for herself. \nThat means she wants to give away 8. \nThere are 4 boys, so each boy will get 2 marbles.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The school is planning a field trip. The school has 17 classrooms. There are 46 school buses and a total of 92 students in the school. If all buses are full How many seats are in each bus?\nA:",
    "output": "There are a total of 92 students in the school. \nThere are 46 school buses. \nEach bus can hold a maximum of 92 students. \n\nTherefore, the number of students per bus is 92/46, which is equal to 2.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: For Gwen's birthday she received some dollars. She spent 8 dollars and has 6 dollars left with her. How much money did Gwen receive for her birthday?\nA:",
    "output": "Gwen received some dollars for her birthday. \nShe spent 8 dollars. \nShe has 6 dollars left with her. \n\nWe want to know how much money Gwen received for her birthday. \n\nGwen received 8 + 6 = 14 dollars for her birthday.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Danny collects bottle caps. He lost 66 bottle caps at the park. Now he has 25 bottle caps in his collection. How many bottle caps did danny have at first?\nA:",
    "output": "Danny has 25 bottle caps in his collection. \nHe lost 66 bottle caps at the park. \n\nThat means he had a total of 91 bottle caps at one point.\n\n-->\n\n91.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jake has 6 fewer peaches than Steven. Steven has 18 more peaches than Jill. If jill has 5 peaches How many peaches does Jake have?\nA:",
    "output": "Steven has 18 more peaches than Jill. So if we start with Jill having 5 peaches, then Steven would have 5 + 18 = 23 peaches. \nJake has 6 fewer peaches than Steven. So if we start with Steven having 23 peaches, then Jake would have 23 - 6 = 17 peaches.\n\n-->\n\n17.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 4 birds and 6 storks were sitting on the fence. 2 more storks came to join them. How many storks are sitting on the fence?\nA:",
    "output": "There are 4 birds and 6 storks sitting on the fence. \n2 more storks come to join them. \n\nThis means that there are now 8 storks sitting on the fence.\n\n-->\n\n8.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The Razorback t-shirt shop sells each t-shirt for $ 201 dollars. During the Arkansas and Texas tech game they increased the prices by $ 217 per t-shirt and sold 14 t-shirts. How much money did they make from selling the t-shirts?\nA:",
    "output": "The Razorback t-shirt shop sells each t-shirt for $201 dollars. \n\nDuring the Arkansas and Texas tech game they increased the prices by $217 per t-shirt. \n\nThis means that each t-shirt now costs $418. \n\nIf they sold 14 t-shirts, they made $5852 from selling the t-shirts.\n\n-->\n\n5852.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dan has $ 4. He bought a candy bar for $ 7 and a chocolate for $ 6. How much money did he spend buying the candy bar and chocolate?\nA:",
    "output": "Dan has $4. \nHe buys a candy bar for $7. \nThat means he now has $4 - $7 = -$3. \nHe buys a chocolate for $6. \nThat means he now has -$3 - $6 = -$9. \n\nSo he spent $7 + $6 = $13.\n\n-->\n\n13.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jerry had 4 action figures and 22 books on a shelf in his room. Later he added 6 more action figures to the shelf. How many action figures were on his shelf in all?\nA:",
    "output": "Jerry had 4 action figures and 22 books on a shelf in his room. \nThis means that the total number of objects on the shelf is 26. \nLater he added 6 more action figures to the shelf. \nThis means that the total number of objects on the shelf is now 32. \nTherefore, the total number of action figures on the shelf is 32 - 22 = 10.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Mary is baking a cake. The recipe calls for 11 cups of sugar and some more cups of flour. She already put in 3 cups of flour. If she still needs to add 6 more cups of flour How many cups of flour did the recipe require?\nA:",
    "output": "Mary is baking a cake. The recipe calls for 11 cups of sugar and some more cups of flour.\n\nWe know that the recipe calls for 11 cups of sugar, so we can eliminate that from the equation. \n\nShe already put in 3 cups of flour. If she still needs to add 6 more cups of flour How many cups of flour did the recipe require?\n\nWe also know that she's already put in 3 cups of flour, so we can eliminate that as well. \n\nThat leaves us with the equation: some more cups of flour + 6 more cups of flour = how many\n\n-->\n\n9.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with 7 kids on monday and 13 kids on tuesday. She played cards wtih 20 kids on wednesday. How many kids did she play tag with altogether?\nA:",
    "output": "On Monday, Julia played tag with 7 kids. \nOn Tuesday, Julia played tag with 13 kids. \nThat means, in total, Julia played tag with 20 kids. \n\nOn Wednesday, Julia played cards with 20 kids.\n\n-->\n\n20.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Being his favorite, he saved checking on the grapevines for his last stop. He was told by 36 of the pickers that they fill 8 drums of grapes per day. How many days will it take to fill 240 drums of grapes?\nA:",
    "output": "There are 8 drums of grapes per day. \nThere are 30 days in a month. \n240 drums of grapes / 8 drums of grapes per day = 30 days to fill 240 drums of grapes\n\n-->\n\n30.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Bobby ate 23 pieces of candy. If he initially had 30 pieces of candy How many pieces of candy does he still have left?\nA:",
    "output": "Bobby had 30 pieces of candy. \nHe ate 23 pieces of candy. \nThat means he has 7 pieces of candy left.\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Robin's hair was 16 inches long. He cut off 11 inches. Then it again grew by 12 inches. How long is his hair now?\nA:",
    "output": "First, Robin's hair was 16 inches long. \nThen, he cut off 11 inches. \nThat means that his hair is now 5 inches long. \nThen, it grew by 12 inches. \nThat means that his hair is now 17 inches long.\n\n-->\n\n17.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Summer is almost here and most animals are migrating back to cooler countries. There are 87 bird families living near a mountain. If 18 new bird families joined them How many bird families live near the mountain now?\nA:",
    "output": "There are 87 bird families living near a mountain. \nIf 18 new bird families joined them, \nthen there are 105 bird families living near the mountain now.\n\n-->\n\n105.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Danny collects bottle caps and wrappers. He found 15 bottle caps and 18 wrappers at the park. Now he has 67 wrappers and 35 bottle caps in his collection. How many more wrappers than bottle caps does danny have now?\nA:",
    "output": "First, Danny finds 15 bottle caps and 18 wrappers. \nThen, he has 67 wrappers and 35 bottle caps in his collection. \nNow, we need to find out how many more wrappers than bottle caps Danny has now. \nTo do this, we can subtract the number of bottle caps from the number of wrappers: \n67 - 35 = 32 \nDanny has 32 more wrappers than bottle caps now.\n\n-->\n\n32.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Melissa scored a total of 91 points in 13 games scoring the same for each game. How many points did she score in each game?\nA:",
    "output": "We know that Melissa scored 91 points in 13 games. \nWe also know that she scored the same amount of points in each game. \nThat means that if we divide 91 by 13, we will know how many points she scored in each game. \n\n91 / 13 = 7 \n\nMelissa scored 7 points in each game.\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Robin's hair was 17 inches long. He cut off some inches of her hair. If his hair is now 13 inches long How much of his hair did he cut?\nA:",
    "output": "First, we need to figure out how much hair Robin had before she cut it. We know that her hair was 17 inches long, and we know that she cut some of it off. So, we need to find out how many inches she cut off. \n\nWe also know that after she cut her hair, it was 13 inches long. So, if we take away the 13 inches that she has now from the 17 inches that she had before, we will know how much she cut off. \n\n17 inches - 13 inches = 4 inches \n\nThis means that Robin cut 4 inches off of\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The school is planning a field trip. The school has 21 classrooms. There are 98 students in the school and 7 school buses. If all buses are full How many seats are in each bus?\nA:",
    "output": "There are 98 students in the school. \nThere are 7 buses. \nEach bus can hold 14 students. \n98 students divided by 7 buses equals 14 students per bus.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Every day Ryan spends 6 hours on learning english and 2 hours on learning chinese. How many more hours does he spend on learning english than he does on learning chinese?\nA:",
    "output": "How many hours does Ryan spend on learning english? \nHow many hours does Ryan spend on learning chinese? \nHow many more hours does Ryan spend on learning english than he does on learning chinese? \n\nRyan spends 6 hours on learning english. \nRyan spends 2 hours on learning chinese. \nRyan spends 4 more hours on learning english than he does on learning chinese.\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The grasshopper and the frog had a jumping contest. The frog jumped 39 inches and the grasshopper jumped 17 inches. How much farther did the frog jump than the grasshopper?\nA:",
    "output": "The frog jumped 39 inches. \nThe grasshopper jumped 17 inches. \n\nTo find out how much farther the frog jumped, we need to subtract the grasshopper's jump from the frog's jump. \n\n39 inches - 17 inches = \n\n22 inches\n\n-->\n\n22.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paul had 50 books. After buying some in a garage sale he had 151 left. How many books did he buy?\nA:",
    "output": "Paul had 50 books. \nHe bought some in a garage sale. \nHe had 151 left. \n\nSo we can say that Paul had 50 + x books, where x is the number of books he bought in the garage sale. \n\nNow we can set up an equation: \n\n50 + x = 151\n\nx = 151 - 50\n\nx = 101\n\nSo Paul bought 101 books in the garage sale.\n\n-->\n\n101.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Josh had 19 marbles in his collection. He lost 11 marbles and found 5 new ones. How many marbles does he have now?\nA:",
    "output": "Josh had 19 marbles. \nHe lost 11 marbles. \nThat means he has 8 marbles left. \nHe found 5 new marbles. \nThat means he has 13 marbles in total.\n\n-->\n\n13.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel has 52 apple trees. She picked 2 apples from 1 of her trees. Now the tree has 7 apples still on it. How many apples did the tree have to begin with?\nA:",
    "output": "Rachel has 52 apple trees. \nShe picked 2 apples from 1 of her trees. \nNow the tree has 7 apples still on it. \n\nWe want to know how many apples the tree had to begin with. \n\nWe know that Rachel has 52 apple trees. We also know that she picked 2 apples from 1 of her trees. So if she picked 2 apples from 1 tree, she must have picked 2 apples from another tree as well. \n\nWe also know that the tree she picked 2 apples from now has 7 apples still on it. \n\nSo if we start with\n\n-->\n\n9.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jack received a total of 9 emails in the day. If he received 7 emails in the morning and some more in the afternoon How many emails did Jack receive in the afternoon?\nA:",
    "output": "Jack received 7 emails in the morning. So, he received 2 emails in the afternoon.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A book has 3 chapters. The first chapter is 35 pages long the second chapter is 18 pages long and the third chapter is 3 pages long. How many more pages does the second chapter have than the third chapter?\nA:",
    "output": "The first chapter is 35 pages long. \nThe second chapter is 18 pages long. \nThe third chapter is 3 pages long. \n\nTo find out how many more pages the second chapter has than the third chapter, we need to subtract the number of pages in the third chapter from the number of pages in the second chapter. \n\n18 - 3 = 15 \n\nThe second chapter has 15 more pages than the third chapter.\n\n-->\n\n15.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Randy has 97 blocks. He uses some blocks to build a tower. If there are 72 blocks left How many blocks did he use to build the tower?\nA:",
    "output": "Randy has 97 blocks. \nHe uses some blocks to build a tower. \nThat means he has less than 97 blocks now. \nWe also know that he has 72 blocks left. \nThat means he used 97-72=25 blocks to build the tower.\n\n-->\n\n25.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: White t - shirts can be purchased in packages. If mom buys 28 packages which contain 56 white t - shirts in total How many white t - shirts does each package have?\nA:",
    "output": "First, we need to find out how many t-shirts are in each package. \nThere are 28 packages in total, and each package has 56 t-shirts. \nWe can divide 28 into 56 to find out how many t-shirts are in each package. \n28 divided by 56 equals 0.5. \nThis means that each package has 0.5 t-shirts.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Lawrence county has 898051 kids. During summer break 629424 kids go to camp and the rest stay home. How many kids stay home?\nA:",
    "output": "There are 898051 kids in Lawrence county. \n629424 kids go to camp. \nThat means that the number of kids who stay home is \n\n898051 - 629424 = 268,627 kids.\n\n-->\n\n268627.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dave had 17 apps and 21 files on his phone. After deleting some apps and files he had 3 apps and 7 files left. How many files did he delete?\nA:",
    "output": "Dave had 17 apps and 21 files. \nAfter deleting some apps and files, he had 3 apps and 7 files left. \n\nHow many files did he delete?\n\nWe know that Dave had 21 files in total, and after deleting some apps and files, he had 7 files left. So, we can say that he deleted 14 files.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Nell collects baseball cards. She had 242 cards. She gave 136 of her cards to Jeff. How many cards does Nell have left?\nA:",
    "output": "Nell has 242 cards. \nNell gives 136 cards to Jeff. \nThat means Nell has 242 - 136 = 106 cards left.\n\n-->\n\n106.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Allan and Jake brought 3 balloons to the park. If Allan brought 2 balloons How many balloons did Jake bring to the park?\nA:",
    "output": "Allan and Jake brought 3 balloons to the park. \n\nThat means that, together, they have 3 balloons. \n\nIf Allan has 2 balloons, that means Jake must have 1 balloon.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are 270 students in a school. If the school has 5 students in each grades and each grade has the same number of students How many grades are there in total?\nA:",
    "output": "There are 270 students in a school. \nIf the school has 5 students in each grades and each grade has the same number of students \n\nHow many grades are there in total?\n\nThere are 54 grades in total.\n\n-->\n\n54.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: After finding some bottle caps at the park danny has 32 bottle caps in his collection. If he had 25 bottle caps in his collection earlier How many bottle caps did he find at the park?\nA:",
    "output": "Danny had 25 bottle caps in his collection. \nHe found some bottle caps at the park. \nNow he has 32 bottle caps in his collection. \n\nWe want to know how many bottle caps he found at the park. \n\nWe can solve this problem by using addition and subtraction. \n\nWe know that Danny had 25 bottle caps in his collection. \nWe know that now he has 32 bottle caps in his collection. \nWe want to know how many bottle caps he found at the park. \n\nWe can solve this problem by finding the difference.\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel had to complete 5 pages of math homework and yet more pages of reading homework. If she had to complete a total of 7 pages of homework How many pages of reading homework did she have to complete?\nA:",
    "output": "First, we know that Rachel had to complete 5 pages of math homework. \n\nSecond, we know that she had to complete more pages of reading homework. \n\nThird, we know that she had to complete a total of 7 pages of homework. \n\nFrom this, we can infer that she had to complete 2 pages of reading homework.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He had a total of 40 saltwater animals in different aquariums. Each aquarium has 2 animals in it. How many aquariums did he have?\nA:",
    "output": "We know that there are 40 animals in total, and that each aquarium has 2 animals in it. \nThat means that there are 20 aquariums in total.\n\n-->\n\n20.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 8 people on the bus. At the next stop 12 more people got on the bus and 3 people got off. How many people are there on the bus now?\nA:",
    "output": "There were 8 people on the bus. \nAt the next stop, 12 more people got on the bus. \nThat means there are now 8 + 12 = 20 people on the bus. \nAnd then 3 people got off, \nso there are now 20 - 3 = 17 people on the bus.\n\n-->\n\n17.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Baker made 173 cakes. He bought 103 new cakes and sold 86 cakes. How many cakes does baker still have?\nA:",
    "output": "Baker made 173 cakes. \nHe bought 103 new cakes. \nThis means that he now has a total of 276 cakes. \nHe sold 86 cakes. \nThis means that he now has a total of 190 cakes.\n\n-->\n\n190.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Mary is baking a cake. The recipe calls for 11 cups of sugar 6 cups of flour and 9 cups of salt. She already put in 12 cups of flour. How many more cups of sugar than cups of salt does she need to add now?\nA:",
    "output": "First, we need to realize that Mary has put in one more cup of flour than the recipe calls for. \nThat means she needs to take out one cup of flour. \nThe recipe calls for 11 cups of sugar, so she needs to add 11-1=10 cups of sugar. \nThe recipe calls for 9 cups of salt, so she needs to add 9-1=8 cups of salt. \nTherefore, she needs to add 2 more cups of sugar than she does salt.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dan has $ 7. He bought a candy bar for $ 2 and a chocolate for $ 3. How much money is left?\nA:",
    "output": "Dan has $7. \nHe buys a candy bar for $2. \nThat leaves him with $5. \nHe buys a chocolate for $3. \nThat leaves him with $2.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: After Jessie started to go jogging everyday she lost 126 kilograms. She currently weighs 66 kilograms. How much did she weigh before starting to jog?\nA:",
    "output": "We know that Jessie started to go jogging everyday and she lost 126 kilograms. \nThat means that she weighed 66 kilograms + 126 kilograms = 192 kilograms before starting to jog.\n\n-->\n\n192.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Nell collects cards. She had 239 baseball cards and 38 Ace cards. She gave some of her cards to Jeff and now has 376 Ace cards and 111 baseball cards left. How many more Ace cards than baseball cards does Nell have?\nA:",
    "output": "Nell had 239 baseball cards and 38 Ace cards. \nShe gave some of her cards to Jeff. \nThat means she gave away some baseball cards and some Ace cards. \nSo now she has 376 Ace cards and 111 baseball cards left. \nThat means she has more Ace cards than baseball cards. \nTo figure out how many more Ace cards than baseball cards she has, we can subtract the number of baseball cards she has from the number of Ace cards she has. \nThat would give us: \n376 Ace cards - 111 baseball cards = 265 more Ace cards than baseball cards.\n\n-->\n\n265.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: In a school there are 362 boys and 257 girls. 403 more girls joined the school. How many more girls than boys does the school have?\nA:",
    "output": "There are 362 boys and 257 girls in the school. \n403 more girls joined the school. \nThat means there are 660 girls in the school now. \nThere are 660 girls and 362 boys in the school now. \nThat means there are 298 more girls than boys in the school now.\n\n-->\n\n298.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He then went to see the oranges being harvested. He found out that they harvest 41 sacks of unripe oranges and 86 sacks of ripe oranges per day. How many more sacks of ripe oranges than unripe oranges are harvested per day?\nA:",
    "output": "We are looking for the difference in sacks of ripe and unripe oranges. \nWe know that 41 sacks of unripe oranges are harvested per day. \nWe know that 86 sacks of ripe oranges are harvested per day. \n\nTo find the difference, we need to subtract the number of unripe oranges from the number of ripe oranges. \n\n86 - 41 = 45 \n\n45 more sacks of ripe oranges are harvested per day than unripe oranges.\n\n-->\n\n45.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Allan brought 5 balloons. If Allan and Jake brought total of 6 balloons to the park How many balloons did Jake bring to the park?\nA:",
    "output": "Allan brought 5 balloons. \n\nThat means Jake brought 1 balloon.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The ring toss game at the carnival made 144 dollars per day. They were at the carnival for 22 days. How much money did they make?\nA:",
    "output": "The ring toss game made 144 dollars per day. \n\nThat means that for every day, they made 144 dollars. \n\nIf they were at the carnival for 22 days, that means they made 144 dollars for each of those days. \n\nTo find the total amount of money they made, we need to multiply 144 by 22. \n\n144 x 22 = 3168 \n\nSo the ring toss game made 3168 dollars in total.\n\n-->\n\n3168.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Each basket of peaches has 19 red peaches and 4 green peaches. If there are 15 such baskets How many peaches are in the baskets altogether?\nA:",
    "output": "There are 15 baskets. \nEach basket has 19 red peaches and 4 green peaches. \nSo, in total, there are 15 x 19 = 285 red peaches and 15 x 4 = 60 green peaches. \nTherefore, in total, there are 285 + 60 = 345 peaches in the baskets altogether.\n\n-->\n\n345.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jake has 11 fewer peaches than Steven. If Jake has 17 peaches. How many peaches does Steven have?\nA:",
    "output": "Jake has 11 fewer peaches than Steven. \nThat means that if we start with the number of peaches that Jake has, and add 11, we'll get the number of peaches that Steven has. \n\nJake has 17 peaches. \nThat means that if we start with 17 and add 11, we'll get 28. \n\nSteven has 28 peaches.\n\n-->\n\n28.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paige raised 15 goldfish in the pond but stray cats loved eating them. 5 were eaten. How many goldfish remained?\nA:",
    "output": "Paige raised 15 goldfish in the pond. \n\n5 were eaten. \n\nThis means that 5 were taken away from the original 15. \n\nSo, the answer is that 10 goldfish remained.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He then went to see the oranges being harvested. He found out that they harvest 82 sacks of ripe oranges and 61 sacks of unripe oranges per day. How many sacks of ripe oranges will they have after 25 days of harvest?\nA:",
    "output": "On the first day, they harvest 82 sacks of ripe oranges. \nOn the second day, they harvest 82 more sacks of ripe oranges, for a total of 164 sacks of ripe oranges. \nOn the third day, they harvest 82 more sacks of ripe oranges, for a total of 246 sacks of ripe oranges. \nOn the fourth day, they harvest 82 more sacks of ripe oranges, for a total of 328 sacks of ripe oranges. \nOn the fifth day, they harvest 82 more sacks of ripe oranges, for a total of 410 sacks of ripe oranges. \nOn the sixth day, they harvest\n\n-->\n\n2050.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Katie had 62 new games and 80 old games. Her friends had 73 new games and 41 old games. How many old games do they have 3\nA:",
    "output": "First, we need to find out how many games in total each person has. \n\nKatie has 62 + 80 = 142 games in total. \nHer friends have 73 + 41 = 114 games in total. \n\nThen, we need to find out how many old games in total they have. \n\nKatie has 80 old games. \nHer friends have 41 old games. \n\nTherefore, they have 80 + 41 = 121 old games in total.\n\n-->\n\n121.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He then went to see the oranges being harvested. He found out that they harvest 67 sacks per day and that each sack containes 12 oranges. How many oranges are harvested if they harvest a total of 35 sacks of oranges?\nA:",
    "output": "He found out that they harvest 67 sacks per day.\n\nThat means that, in total, they harvest 67 x 12 = 804 oranges per day. \n\nNow, if they harvest a total of 35 sacks of oranges, that means that they would harvest 35 x 12 = 420 oranges.\n\n-->\n\n420.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 106 dollars in Olivia's wallet. After she visited a supermarket and a showroom there were 26 dollars left. If she spent 49 dollars at the showroom How much did she spend at the supermarket?\nA:",
    "output": "Olivia started with 106 dollars in her wallet. \nShe spent 49 dollars at the showroom. \nThat means she had 57 dollars left. \nShe spent 26 dollars at the supermarket. \nThat means she had 31 dollars left. \n\nSo, she spent 31 dollars at the supermarket.\n\n-->\n\n31.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 24 inches. The frog jumped 33 inches farther than the grasshopper and the mouse jumped 5 inches lesser than the frog. How much farther did the mouse jump than the grasshopper?\nA:",
    "output": "The grasshopper jumped 24 inches.\nThe frog jumped 33 inches farther than the grasshopper. This means that the frog jumped 57 inches.\nThe mouse jumped 5 inches lesser than the frog. This means that the mouse jumped 52 inches.\n\nThe mouse jumped 28 inches farther than the grasshopper.\n\n-->\n\n28.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Frank was reading through his favorite book. The book had 392 pages and he read 14 pages per day. How many days did he take to finish the book?\nA:",
    "output": "Frank reads 14 pages per day. \nThat means he can read 392 pages in 392/14 days, which is equal to 28 days.\n\n-->\n\n28.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Faye was placing her pencils into rows with 5 pencils in each row. If she had 35 pencils and 7 crayons How many rows could she make?\nA:",
    "output": "Faye has 35 pencils. She wants to put them into rows of 5. \nHow many rows can she make with 35 pencils?\n\nShe can make 7 rows with 5 pencils in each row.\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Some children were riding on the bus. At the bus stop 2 more children got on the bus. Then there were 41 children altogether on the bus. How many children were riding on the bus before the bus stop?\nA:",
    "output": "There were 2 more children that got on the bus. \nThat means that there were 2 children that were at the bus stop. \nThat means that before the bus stop, there were 39 children on the bus.\n\n-->\n\n39.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Danny has 12 bottle caps in his collection. He found 53 bottle caps at the park. How many bottle caps does he have now?\nA:",
    "output": "Danny has 12 bottle caps in his collection. \nHe found 53 bottle caps at the park. \n\nHow many bottle caps does he have now? \n\nHe would have 12 + 53 = 65 bottle caps now.\n\n-->\n\n65.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Allan brought 5 balloons and Jake brought 3 balloons to the park. How many more balloons did Allan have than Jake in the park?\nA:",
    "output": "Allan has 5 balloons. Jake has 3 balloons. \n\nHow many more balloons does Allan have than Jake?\n\nAllan has 2 more balloons than Jake.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Winter is almost here and most animals are migrating to warmer countries. There are 8 bird families living near the mountain. If 42 bird families flew away to africa and 31 bird families flew away to asia How many more bird families flew away to africa than those that flew away to asia?\nA:",
    "output": "There are 8 bird families living near the mountain. \nIf 42 bird families flew away to africa and 31 bird families flew away to asia, \nthen 8 + 42 + 31 = 81 bird families have flown away. \nThere are 42 - 31 = 11 more bird families that flew away to Africa.\n\n-->\n\n11.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Zachary did 46 push-ups and 58 crunches in gym class today. David did 38 more push-ups but 62 less crunches than zachary. How many more crunches than push-ups did Zachary do?\nA:",
    "output": "Zachary did 46 push-ups and 58 crunches. \nDavid did 38 more push-ups than Zachary, so he did 84 push-ups. \nDavid did 62 less crunches than Zachary, so he did 96 crunches. \n\nNow we can see that Zachary did 12 more crunches than David.\n\n-->\n\n12.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel had to complete 2 pages of math homework, 3 pages of reading homework and 10 more pages of biology homework. How many pages did she have to complete in all?\nA:",
    "output": "First, we need to add 2 + 3 to get the number of pages of homework she had in total. \n\n2 + 3 = 5\n\nThen, we need to add 5 + 10 to get the total number of pages of homework she had to complete. \n\n5 + 10 = 15\n\n-->\n\n15.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: For Gwen's birthday she received 3 dollars from her mom. Her dad gave her 6 more dollars. If she spent 4 dollars. How much more money did she receive from her dad than she did from her mom?\nA:",
    "output": "Gwen's mom gave her 3 dollars. \nGwen's dad gave her 6 more dollars. \nThat means that Gwen's dad gave her a total of 9 dollars. \nGwen spent 4 dollars. \nThat means that Gwen has 5 dollars left. \n\nWe want to know how much more money Gwen's dad gave her than her mom. So we need to compare 9 dollars to 3 dollars. 9 is 3 more than 3, so Gwen's dad gave her 3 more dollars than her mom.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Baker made 110 cakes. He sold 75 of them. Then he made 76 more cakes. How many cakes would baker still have?\nA:",
    "output": "Baker made 110 cakes. He sold 75 of them. \n\nThat means he has 110 - 75 = 35 cakes left. \n\nThen he made 76 more cakes. \n\nThat means he has 35 + 76 = 111 cakes left.\n\n-->\n\n111.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Baker made 61 pastries and 167 cakes. If he sold 108 cakes and 44 pastries How many cakes would baker still have?\nA:",
    "output": "Baker made 61 pastries and 167 cakes. \n\nIf he sold 108 cakes, that means he would have 59 cakes left. \n\nIf he sold 44 pastries, that means he would have 17 pastries left.\n\n-->\n\n59.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Ed had 6 more marbles than Doug. Doug lost 7 of his marbles at the playground. If Ed had 22 marbles How many marbles does Doug have now?\nA:",
    "output": "Ed had 6 more marbles than Doug. \nThat means Doug had 22 - 6 = 16 marbles. \nDoug lost 7 of his marbles at the playground. \nThat means Doug has 16 - 7 = 9 marbles now.\n\n-->\n\n9.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dan has $ 2. He bought a candy bar for $ 6 and a chocolate for $ 3. How much money did he spend to buy candy bar than he did to buy chocolate?\nA:",
    "output": "Dan has $2. \nHe buys a candy bar for $6. \nHe buys a chocolate for $3. \n\nHe spends more money on the candy bar than he does on the chocolate.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with 14 kids on tuesday. If she played tag with 8 more kids on monday than on tuesday How many kids did she play with on monday?\nA:",
    "output": "Julia played tag with 14 kids on Tuesday. \n\nThat means she played with fewer kids on Monday. \n\nIf she played with 8 more kids on Monday than on Tuesday, that means she played with 22 kids on Monday.\n\n-->\n\n22.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jackie has 10 apples. Adam has 8 apples. How many more apples does Jackie have than Adam?\nA:",
    "output": "Jackie has 10 apples. 10 is 2 more than 8. So Jackie has 2 more apples than Adam.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: For Gwen's birthday she received 7 dollars. She spent some money and has 5 dollars left with her. How much money did she spend?\nA:",
    "output": "Gwen received 7 dollars. \nGwen spent some money. \nGwen has 5 dollars left. \n\nThat means that Gwen spent 2 dollars.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He then went to see the oranges being harvested. He found out that they harvested 56 sacks of oranges. How many sacks did they harvest per day if they harvested for a total of 14 days?\nA:",
    "output": "How many sacks of oranges were harvested in total? \nThere were 56 sacks of oranges harvested in total. \n\nHow many days were they harvested for? \nThey were harvested for a total of 14 days. \n\nHow many sacks of oranges were harvested per day? \nThis is what we are trying to find out. We can set up a proportion to help us solve this problem. \n\n$$\\frac{56}{14} = \\frac{x}{14}$$\n\nWe can cross multiply to solve for x. \n\n$$56 = x$$\n\nThis\n\n-->\n\n4.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Adam has 4 more apples than Jackie. Together Adam and Jackie have 14 apples. Bob has 6 apples more than Adam and Jackie together do. How many apples does Bob have?\nA:",
    "output": "Adam has 4 more apples than Jackie. Together Adam and Jackie have 14 apples.\n\nThis means that Jackie must have 10 apples.\n\nBob has 6 apples more than Adam and Jackie together do.\n\nThis means that Bob must have 20 apples.\n\n-->\n\n20.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Winter is almost here and most animals are migrating to warmer countries. 27 bird families flew away for the winter from near a mountain. If there were 41 bird families living near the mountain initially How many bird families were left near the mountain?\nA:",
    "output": "There were 41 bird families living near the mountain initially. \n27 bird families flew away for the winter. \nThis means that there are 41 - 27 = 14 bird families left near the mountain.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jake has 16 fewer peaches than Steven. Steven has 15 more peaches than Jill. If Jill has 12 peaches How many more peaches does Jill have than Jake?\nA:",
    "output": "Jake has 16 fewer peaches than Steven. So if we start with Steven having some number of peaches, Jake will have that number minus 16. \nSteven has 15 more peaches than Jill. So if we start with Jill having some number of peaches, Steven will have that number plus 15. \n\nWe know that Jill has 12 peaches. So we can plug that in and solve for the number of peaches Jake has. \n\nJill has 12 peaches. \nSteven has 12 + 15 = 27 peaches. \nJake has 27 - 16 = 11 peaches.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A book has 2 chapters. The first chapter is 60 pages long. If there are a total of 93 pages in the book How many pages are in the second chapter?\nA:",
    "output": "There are a total of 93 pages in the book. \nThe first chapter is 60 pages long. \nThat means that the second chapter is 33 pages long.\n\n-->\n\n33.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: At the stop 13 more people got on the bus. Initially there were 4 people on the bus. How many people are there on the bus now?\nA:",
    "output": "There were 4 people on the bus. \n13 more people got on the bus. \n\nThat means that there are now 4 + 13 = 17 people on the bus.\n\n-->\n\n17.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Baker's friend bought 137 cakes from him. If he had made 169 cakes initially How many cakes would baker still have?\nA:",
    "output": "Baker's friend bought 137 cakes from him. \nThat means that 137 cakes have been taken away from the original number of cakes. \nSo if we start with 169 cakes and subtract 137 cakes, we are left with \n\n169 - 137 = 32 \n\nThat means that the baker would still have 32 cakes left.\n\n-->\n\n32.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: For 19 weeks of harvest Lewis earns a total of $ 133. How much money does he earn each week?\nA:",
    "output": "How much money does he earn each week?\n\n$133 / 19 weeks = $7 per week\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paul had some books. After selling 137 in a garage sale he had 105 left. How many books did he have at the start?\nA:",
    "output": "Paul had some books. \n\nThis is a given. We do not know how many books he had, but we know that he had some. \n\nAfter selling 137 in a garage sale he had 105 left. \n\nThis means that Paul started with 137 + 105 = 242 books.\n\n-->\n\n242.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: If you have 14 cookies in total and 7 bags having equal number of cookies How many cookies does each bag have?\nA:",
    "output": "There are 14 cookies in total. \nThere are 7 bags, so each bag has an equal number of cookies. \nThat means that each bag has 2 cookies. \n\nTherefore, each bag has 2 cookies.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Matthew gave equal numbers of crackers to his 18 friends. If he had 36 crackers How many crackers did each person eat?\nA:",
    "output": "First, we need to realize that Matthew gave out an equal number of crackers to his 18 friends. \n\nThat means that each person got the same number of crackers. \n\nWe also know that Matthew had a total of 36 crackers. \n\nThat means that if we divide 36 by 18, we will know how many crackers each person got. \n\n36 divided by 18 equals 2. \n\nThat means that each person got 2 crackers.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are 4 different books and 17 different movies in the ' crazy silly school ' series. If you read 19 of the books and watched 7 of the movies How many more movies do you still have to watch?\nA:",
    "output": "There are 4 different books. You read 19 of the books. You still have to read 4 - 19 = -15 books. \nThere are 17 different movies. You watched 7 of the movies. You still have to watch 17 - 7 = 10 movies.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He then went to see the oranges being harvested. He found out that they harvest 5 sacks of ripe oranges and 74 sacks of unripe oranges per day. How many more sacks of unripe oranges than ripe oranges are harvested per day?\nA:",
    "output": "There are 5 sacks of ripe oranges and 74 sacks of unripe oranges. \nThat means that there are a total of 79 sacks of oranges. \nNow, we want to know how many more sacks of unripe oranges are harvested per day. \nTo do this, we need to subtract the number of ripe oranges from the total number of oranges. \nThis gives us 74 - 5 = 69. \nTherefore, 69 more sacks of unripe oranges are harvested per day than ripe oranges.\n\n-->\n\n69.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 17 red peaches and 16 green peaches are in the basket. How many more red peaches than green peaches are in the basket?\nA:",
    "output": "There are a total of 33 peaches in the basket. \n17 of those peaches are red, and 16 of those peaches are green. \nThat means that there is 1 more red peach than green peach in the basket.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Because of the decision Sofia asked the students to suggest specific types of food. If 324 students suggested adding mashed potatoes 374 suggested adding bacon to the menu and 128 suggested adding tomatoes How many students participated in the suggestion of new food items?\nA:",
    "output": "There are 324 students who suggested adding mashed potatoes. \nThere are 374 students who suggested adding bacon. \nThere are 128 students who suggested adding tomatoes. \n\nThere are a total of 324 + 374 + 128 = 826 students who participated in the suggestion of new food items.\n\n-->\n\n826.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 12 people on the bus. At the next stop 4 more people got on the bus. Each bus can not have more than 36 people. How many people are there on the bus now?\nA:",
    "output": "There were 12 people on the bus. \nAt the next stop, 4 more people got on the bus. \nThat means there are now 16 people on the bus.\n\n-->\n\n16.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Because of the decision Sofia asked 288 students to suggest specific types of food. 264 students suggested adding bacon while others suggested adding mashed potatoes to the menu. How many students suggested mashed potatoes?\nA:",
    "output": "288 students were asked to suggest food. \n264 students suggested bacon. \nThat means that 24 students suggested mashed potatoes.\n\n-->\n\n24.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: He then went to see the oranges being harvested. He found out that the harvest will go on for 4 days. How many sacks do they harvest per day if they harvested a total of 56 sacks of oranges?\nA:",
    "output": "There are a total of 56 sacks of oranges. \nThe harvest will go on for 4 days. \n\nThat means that there are 14 sacks of oranges per day.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: After a typhoon, 2 trees in Haley's backyard died. If she had grown 11 trees initially How many more trees survived the typhoon than those that died?\nA:",
    "output": "There were 11 trees in Haley's backyard. \nTwo trees died in the typhoon. \nThat means that 11 - 2 = 9 trees survived the typhoon. \n\nSo, 9 trees survived the typhoon, and 2 trees died in the typhoon. That means that 9 - 2 = 7 more trees survived the typhoon than those that died.\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Debby bought 264 water bottles when they were on sale. If she drank 15 bottles a day for 11 days. How many bottles does she have left?\nA:",
    "output": "Debby bought 264 water bottles. \nShe drank 15 bottles a day for 11 days. \n\nThat means she drank 165 bottles in 11 days. \n\n264-165=99 \n\nShe has 99 bottles left.\n\n-->\n\n99.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 33 campers went rowing in the morning 34 campers went rowing in the afternoon and 10 campers went rowing in the evening. How many more campers went rowing in the afternoon than in the evening?\nA:",
    "output": "There were 33 campers rowing in the morning. \nThen 34 campers went rowing in the afternoon, which means that 1 more camper went rowing in the afternoon than in the morning. \nThen 10 campers went rowing in the evening, which means that 24 more campers went rowing in the afternoon than in the evening.\n\n-->\n\n24.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Baker made 7 cakes and 148 pastries. If he sold 15 cakes and 103 pastries How many pastries would baker still have?\nA:",
    "output": "First, we'll figure out how many pastries he would have sold in total if he had sold all of his cakes. If he sold all 7 of his cakes, he would have sold 7*21 = 147 pastries total. However, he only sold 15 cakes, so he must have sold 15*21 - 147 = 103 pastries total. \n\nNow we know that he sold a total of 103 pastries. So he must have 148 - 103 = 45 pastries left.\n\n-->\n\n45.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: They decided to hold the party in their backyard. They have 2 sets of tables, each having the same number of chairs. If there are a total of 12 chairs in the backyard How many chairs are there for each table?\nA:",
    "output": "There are 12 chairs in the backyard. \nThat means that there are an equal number of chairs at each table. \nThat means that there are 6 chairs at each table.\n\n-->\n\n6.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Last week Fred had 60 dollars and Jason had 19 dollars. Jason washed cars over the weekend and now has 33 dollars. How much money did Jason make washing cars?\nA:",
    "output": "Fred had 60 dollars and Jason had 19 dollars. \n\nThis is our starting point or baseline. \n\nJason washed cars over the weekend and now has 33 dollars. \n\nThis is our ending point. We know that Jason made some money because he now has 33 dollars, which is more than he had at the beginning. \n\nTo find out how much money Jason made, we need to subtract the starting point from the ending point. \n\n33 - 19 = \n\nJason made 14 dollars.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paul sold some books in a garage sale leaving him with 27 books. If he had 136 books initially How many books did he sell?\nA:",
    "output": "We know that Paul sold some books in a garage sale. \nWe know that he had 136 books initially. \nWe know that he has 27 books left. \n\nWe want to know how many books he sold. \n\nWe can set up an equation to solve this problem. \n\nWe know that: \n\ninitial number of books + number of books sold = number of books left \n\nor \n\n136 + number of books sold = 27 \n\nor \n\nnumber of books sold = 27 - 136 \n\nor \n\nnumber of books\n\n-->\n\n109.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The bananas in Philip's collection are organized into 196 groups. If there are a total of 392 bananas in Philip's banana collection How big is each group?\nA:",
    "output": "There are a total of 392 bananas. \nThat means there are 196 groups of bananas. \nThat means each group has 392/196 bananas. \nThat means each group has 2 bananas.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Lewis earns $ 21 every week during the 216 weeks of harvest. If he has to pay $ 702 tax How much money will have at the end of the harvest season?\nA:",
    "output": "First, let's calculate how much money he earns in total. He earns $21 per week, and there are 216 weeks in the harvest season. So he earns $21 * 216 = $4536 in total. \n\nThen, we need to calculate how much tax he needs to pay. He needs to pay $702 in tax. \n\nSo the final answer is $4536 - $702 = $3834.\n\n-->\n\n3834.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Matthew had 31 crackers. He has 23 crackers left after he gave equal numbers of crackers to his 5 friends. How many crackers did Matthew give to his friends?\nA:",
    "output": "First, we know that Matthew had 31 crackers. \nSecond, we know that after giving some crackers to his friends, he had 23 crackers left. \nThird, we know that he gave equal numbers of crackers to his 5 friends. \n\nNow, we want to know how many crackers Matthew gave to his friends. \n\nWe can set up an equation to solve this problem. \n\n31 - x = 23\n\nx = 8\n\nMatthew gave 8 crackers to his friends.\n\n-->\n\n8.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel picked 4 apples from her tree. If the tree had 7 apples initially. How many apples are still there on the tree?\nA:",
    "output": "Rachel picked 4 apples from her tree. \nThat means she took away 4 apples from the 7 that were there. \nSo now, there are 3 apples left on the tree.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 53 dollars in Olivia's wallet. She collected 91 more dollars from an atm. After she visited a supermarket there were 14 dollars left. How much more money did she spend at the supermarket than she collected at the atm?\nA:",
    "output": "Olivia had 53 dollars in her wallet. \nShe collected 91 more dollars from the ATM, so now she has 144 dollars. \nShe spent some of that money at the supermarket, and she had 14 dollars left. \n\nWe want to know how much money she spent at the supermarket. We can find that out by subtracting the 14 dollars she had left from the 144 dollars she started with. \n\n144 - 14 = 130\n\nSo Olivia spent 130 dollars at the supermarket.\n\n-->\n\n39.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Faye was placing some pencils equally into 2 rows. If she had 6 pencils How many pencils did she place in each row?\nA:",
    "output": "Faye was placing some pencils equally into 2 rows. \n\nThat means that she was dividing the pencils into two groups. \n\nIf she had 6 pencils, that means that each group would have 3 pencils.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with 5 kids on monday. She played tag with some more kids on tuesday. If she played with a total of 15 kids How many kids did she play with on tuesday?\nA:",
    "output": "On Monday, Julia played with 5 kids. \nOn Tuesday, she played with some more kids. \n\nWe want to know how many kids she played with on Tuesday. \n\nWe are given that she played with a total of 15 kids. \n\nWe know that the total number of kids she played with is the sum of the number of kids she played with on Monday and the number of kids she played with on Tuesday. \n\nTherefore, we can set up the equation: \n\n5 + x = 15 \n\nWe want to solve for x. \n\nWe\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paco had 36 cookies. He gave 14 cookies to his friend and ate 10 cookies. How many cookies did Paco have left?\nA:",
    "output": "Paco had 36 cookies. \nHe gave 14 cookies to his friend. \nThat means he has 36 - 14 = 22 cookies left. \nHe ate 10 cookies. \nThat means he has 22 - 10 = 12 cookies left.\n\n-->\n\n12.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 7 red peaches, 71 yellow peaches and 8 green peaches are in the basket. How many more green peaches than red peaches are in the basket?\nA:",
    "output": "There are 7 red peaches and 8 green peaches. \nThat means there is 1 more green peach than red peach.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 52 campers went rowing in the morning. 61 campers went rowing in the afternoon. How many more campers went rowing in the afternoon than in the morning?\nA:",
    "output": "52 campers went rowing in the morning. 61 campers went rowing in the afternoon. How many more campers went rowing in the afternoon than in the morning?\n\nThere were 9 more campers rowing in the afternoon than in the morning.\n\n-->\n\n9.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 13 roses and 84 orchids in the vase. Jessica cut some more roses and orchids from her flower garden. There are now 91 orchids and 14 roses in the vase. How many roses did she cut?\nA:",
    "output": "There were 13 roses and 84 orchids in the vase. \nJessica cut some more roses and orchids from her flower garden. \nThere are now 91 orchids and 14 roses in the vase. \nHow many roses did she cut?\n\nShe cut 1 rose.\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Edward spent $ 6 to buy 2 books each book costing him the same amount of money. Now he has $ 12. How much did each book cost?\nA:",
    "output": "Edward spends $6 on two books. \nEach book costs him the same amount of money. \nNow he has $12. \n\nWe want to know how much each book cost. \n\nWe can set up an equation to solve this problem. \n\nLet's call the cost of each book x. \n\nWe know that: \n\nx + x = 6 \nand \nx + x = 12 \n\nWe can solve for x in each equation. \n\nIn the first equation, we have: \nx + x = 6\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Randy uses 36 blocks to build a tower. If he had 59 blocks How many blocks are left?\nA:",
    "output": "Randy uses 36 blocks to build a tower. \n\nThat means he has 36 blocks left. \n\nIf he had 59 blocks, \n\nthat means he would have 23 blocks left.\n\n-->\n\n23.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Marco and his dad went strawberry picking. Together their strawberries weighed 20 pounds. His dad's strawberries weighed 17 pounds. How much did marco's strawberries weigh?\nA:",
    "output": "Step 1: Marco and his dad went strawberry picking. Together their strawberries weighed 20 pounds.\n\nStep 2: His dad's strawberries weighed 17 pounds.\n\nStep 3: How much did Marco's strawberries weigh?\n\nTo solve this problem, we need to find out how much Marco's strawberries weigh. We can do this by subtracting his dad's strawberries from the total weight of the strawberries.\n\n20 pounds - 17 pounds = 3 pounds\n\nTherefore, Marco's strawberries weigh 3 pounds.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Stray cats loved eating goldfish in the pond leaving 6 goldfish. Paige had raised 8 goldfish in the pond initially. How many goldfish disappeared?\nA:",
    "output": "Paige had 8 goldfish in the pond. \nSome of them were eaten by stray cats. \n6 goldfish are left. \n\nSo, 2 goldfish disappeared.\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jesse's room is 2 feet long and 12 feet wide. If each tile is of size 4 square feet How many tiles does she need to cover the whole floor?\nA:",
    "output": "We need to cover an area that is 2 feet by 12 feet. \nIn other words, we need to cover an area that is 24 square feet. \nSince each tile is 4 square feet, we would need 6 tiles to cover the whole floor.\n\n-->\n\n6.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: An industrial machine can make 6 shirts a minute. It worked for 12 minutes yesterday and for 14 shirts today. How many shirts did machine make altogether?\nA:",
    "output": "The machine can make 6 shirts a minute. \nIn 12 minutes, it can make 72 shirts. \nIn 14 minutes, it can make 84 shirts. \n\nTherefore, the machine made a total of 156 shirts.\n\n-->\n\n156.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paco had 9 sweet cookies and 6 salty cookies. He ate 36 sweet cookies and 3 salty cookies. How many salty cookies did Paco have left?\nA:",
    "output": "Paco had 9 sweet cookies and 6 salty cookies. \nHe ate 36 sweet cookies and 3 salty cookies. \n\nThis means that he started with 9 sweet cookies and 6 salty cookies, and he ate a total of 36 + 3 = 39 cookies. \n\nOf the 39 cookies he ate, 36 were sweet and 3 were salty. \n\nThis means that he had 9 - 36 = -27 sweet cookies, and 6 - 3 = 3 salty cookies left.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Robin cut off 20 inches of his hair. If his hair is now 10 inches long How long was his hair before he cut?\nA:",
    "output": "We know that Robin cut off 20 inches of his hair. \nThat means that 20 inches have been removed from the original length of his hair. \nSo if we take away 20 inches from the original length of his hair, that will give us the new length of his hair. \n\nTherefore, if his hair is now 10 inches long, that means that his hair was originally 30 inches long.\n\n-->\n\n30.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 36 inches. The frog jumped 17 inches farther than the grasshopper and the mouse jumped 15 inches farther than the frog. How far did the frog jump?\nA:",
    "output": "The grasshopper jumped 36 inches. The frog jumped 17 more inches than the grasshopper, so the frog jumped 36 + 17 = 53 inches. The mouse jumped 15 more inches than the frog, so the mouse jumped 53 + 15 = 68 inches.\n\n-->\n\n53.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A school has 485 pupils. There are 232 girls and the rest are boys. How many boys are there in that school?\nA:",
    "output": "There are 485 pupils in the school. \nThere are 232 girls in the school. \nThat means that there are 253 boys in the school.\n\n-->\n\n253.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Dave had 24 apps and 9 files on his phone. After deleting some apps and files he had 5 files and 12 apps left. How many more apps than files does he have left on the phone?\nA:",
    "output": "Dave had 24 apps and 9 files. \nAfter deleting some apps and files, he had 5 files and 12 apps left. \n\nWe want to know how many more apps than files he has left on the phone. \n\nWe can find the difference between the number of apps and the number of files: \n\n12 apps - 5 files = 7 more apps than files\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 44 campers went rowing in the morning 39 campers went rowing in the afternoon and 31 campers went rowing in the evening. How many more campers went rowing in the morning than in the afternoon?\nA:",
    "output": "There were 44 campers rowing in the morning, and 39 rowing in the afternoon. \nHow many more campers went rowing in the morning than in the afternoon?\n\nThere were 5 more campers rowing in the morning than in the afternoon.\n\n-->\n\n5.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Frank was reading through his favorite book. The book had 3 chapters, each with the same number of pages. It has a total of 594 pages. It took Frank 607 days to finish the book. How many pages are in each chapter?\nA:",
    "output": "We know that the book has 594 pages, and that it took Frank 607 days to finish it. \nThat means that Frank read an average of 594/607 = 0.976 pages per day. \nWe also know that the book has 3 chapters, each with the same number of pages. \nThat means that the total number of pages in the book is 3 times the number of pages in one chapter. \n\nNow we have two equations with two unknowns. We can solve this using substitution. \n\nWe know that the total number of pages in the book is 3\n\n-->\n\n198.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jesse has 18 square feet of carpet. If her room is 4 feet long and 20 feet wide How much more carpet does she need to cover the whole floor?\nA:",
    "output": "First, we need to calculate the area of the room. The area of a rectangle is length times width, so in this case, the area of the room is 4 feet times 20 feet, which is 80 square feet. \n\nNext, we need to calculate how much more carpet Jesse needs. She has 18 square feet of carpet, and she needs 80 square feet to cover the whole floor, so she needs (80 - 18) = 62 square feet more carpet.\n\n-->\n\n62.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There are many different books in the ' crazy silly school ' series. If you have read 13 of the books and are yet to read 8 books How many books are there in the ' crazy silly school ' series?\nA:",
    "output": "There are 13 books that have been read, and 8 that have not been read. \nThis means that there are a total of 21 books in the series.\n\n-->\n\n21.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Nell collects cards. She had 438 baseball cards and 18 Ace cards. She gave some of her cards to Jeff and now has 55 Ace cards and 178 baseball cards left. How many more baseball cards than Ace cards does Nell have?\nA:",
    "output": "Nell had 438 baseball cards and 18 Ace cards. \nShe gave some of her cards to Jeff. \nThat means she has less cards now. \nSo we want to find out how many cards she gave to Jeff. \nWe know the total number of cards she had, which is 438 + 18 = 456. \nWe also know that she has 55 Ace cards and 178 baseball cards left. \nThat means the total number of cards she has now is 55 + 178 = 233. \nWe can find out how many cards she gave to Jeff by subtracting the total number\n\n-->\n\n123.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: They decided to hold the party in their backyard. They have 10 sets of tables and each set has 6 chairs. If there are 11 people sitting on chairs How many chairs are left unoccupied?\nA:",
    "output": "There are 10 sets of tables and each set has 6 chairs. \nThis means that there are 60 chairs in total. \n11 people are sitting on chairs. \nThis means that there are 49 chairs left unoccupied.\n\n-->\n\n49.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Bryan took a look at his books and magazines. If he has 27 books and 80 magazines in each of his 23 bookshelves How many books does he have in total?\nA:",
    "output": "Bryan has 27 books and 80 magazines in each of his 23 bookshelves. \nWe want to know how many books he has in total. \nWe can find the total number of books by multiplying 27 by 23. \n27 times 23 equals 621. \nTherefore, Bryan has 621 books in total.\n\n-->\n\n621.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The ring toss game at the carnival made the same amount of money each day. In total in 5 days they earned 165 dollars. How much did they make per day?\nA:",
    "output": "The ring toss game at the carnival made the same amount of money each day. \nIn total in 5 days they earned 165 dollars. \n\nHow much did they make per day? \n\nThis is a division problem. We are looking for the quotient. \n\nThere are 5 days, and 165 dollars. \n\nWe want to divide 165 by 5. \n\n165 divided by 5 equals 33.\n\n-->\n\n33.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 5 roses and 3 orchids in the vase. Jessica cut some more roses and orchids from her flower garden. There are now 12 roses and 2 orchids in the vase. How many more roses than orchids are there in the vase now?\nA:",
    "output": "There were 5 roses and 3 orchids in the vase. \n\nJessica cut some more roses and orchids from her flower garden. \n\nThere are now 12 roses and 2 orchids in the vase. \n\nThere are 10 more roses than orchids in the vase now.\n\n-->\n\n10.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: With 28 dollars 2 packs of dvds can be bought. How much does each pack cost?\nA:",
    "output": "With 28 dollars, 2 packs of DVDs can be bought. \nThis means that each pack costs 28/2=14 dollars.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Last week Fred had 78 dollars and Jason had 31 dollars. Jason delivered newspapers and now has 57 dollars. Fred washed cars over the weekend and now has 90 dollars. How much money did Jason earn by delivering newspapers?\nA:",
    "output": "First, we need to find out how much money Jason had in total. We know that he started with 31 dollars, and we know that he ended up with 57 dollars. So, we can say that: \n\n57 - 31 = 26 \n\nThis means that Jason earned 26 dollars by delivering newspapers.\n\n-->\n\n26.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Josh had 15 marbles in his collection. He found 9 marbles while he lost 23 marbles. How many more marbles did he lose than those he found?\nA:",
    "output": "Josh had 15 marbles in his collection. \n\nJosh found 9 marbles. \n\nJosh lost 23 marbles. \n\nHow many more marbles did he lose than those he found?\n\nJosh lost 14 more marbles than those he found.\n\n-->\n\n14.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 19 inches. The frog jumped 39 inches farther than the grasshopper and the mouse jumped 94 inches lesser than the frog. How far did the frog jump?\nA:",
    "output": "The grasshopper jumped 19 inches. \nThe frog jumped 39 inches farther than the grasshopper. \nThe mouse jumped 94 inches lesser than the frog. \n\nSo, the frog jumped 58 inches.\n\n-->\n\n58.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Adam has 5 more apples than Jackie. Jackie has 89 oranges and 11 apples. How many apples does Adam have?\nA:",
    "output": "Jackie has 11 apples, so if Adam has 5 more apples than Jackie, then Adam has 11 + 5 = 16 apples.\n\n-->\n\n16.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: After eating a hearty meal they went to see the Buckingham palace. There, Rachel learned that 132 visitors came to the Buckingham palace that day. If 406 people visited the Buckingham palace within the past 327 days How many visitors visited the Buckingham palace on the previous day?\nA:",
    "output": "There were 132 visitors that day, so we can say that x + 132 = 406. \nThat means that x = 406 - 132, which is x = 274. \nTherefore, 274 people visited the Buckingham Palace the day before.\n\n-->\n\n274.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: There were 174 parents in the program and 521 pupils too. How many more pupils were present compared to parents in the program?\nA:",
    "output": "There were 174 parents in the program. \nThere were 521 pupils in the program too. \nHow many more pupils were present compared to parents in the program? \nThere were 521-174=347 more pupils than parents in the program.\n\n-->\n\n347.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: If each bag has 3 cookies and you had 21 cookies in total How many bags of cookies do you have?\nA:",
    "output": "3 cookies per bag means that if we have 1 bag, we have 3 cookies. \nIf we have 2 bags, we have 6 cookies. \nIf we have 3 bags, we have 9 cookies. \nIf we have 4 bags, we have 12 cookies. \nIf we have 5 bags, we have 15 cookies. \nIf we have 6 bags, we have 18 cookies. \nIf we have 7 bags, we have 21 cookies. \nTherefore, we have 7 bags of cookies.\n\n-->\n\n7.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 39 inches. The grasshopper jumped 19 inches farther than the frog and the mouse jumped 12 inches lesser than the frog. How far did the mouse jump?\nA:",
    "output": "The grasshopper jumped 39 inches. \nThe grasshopper jumped 19 inches farther than the frog. \nThe mouse jumped 12 inches lesser than the frog.\n\nSo, the frog jumped 20 inches. \n\nThe mouse jumped 8 inches.\n\n-->\n\n8.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Katie had 84 new games and 19 old games. Her friends had 8 new games and 69 old games. How many new games do they have together?\nA:",
    "output": "Katie has 84 new games and 19 old games. \nHer friends have 8 new games and 69 old games. \n\nWe want to know how many new games they have together. \n\nTo find out how many new games they have together, we need to add Katie's new games with her friends' new games. \n\nTherefore, they have 84 + 8 = 92 new games together.\n\n-->\n\n92.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Adam has 9 apples. Jackie has 10 apples. How many more apples does Jackie have than Adam?\nA:",
    "output": "Adam has 9 apples. \nJackie has 10 apples. \n\nHow many more apples does Jackie have than Adam? \n\n1 apple\n\n-->\n\n1.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Julia played tag with 13 kids on monday and 10 kids on tuesday. She played cards with 15 kids on wednesday. How many kids did she play with altogether?\nA:",
    "output": "On Monday, Julia played with 13 kids. \nOn Tuesday, Julia played with 10 kids. \nOn Wednesday, Julia played with 15 kids. \n\nTo find out how many kids Julia played with in total, we need to add up the number of kids she played with on each day. \n\n13 + 10 + 15 = \n\n38\n\n-->\n\n38.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Jesse needs a carpet of size 10 square feet to cover her room. If her room is 5 feet long What is the width of her room?\nA:",
    "output": "We know that the area of a rectangle is length times width, so we can set that up as an equation: \n\nA = lw\n\nWe also know that the area is 10 square feet. So we can plug that in for A: \n\n10 = lw\n\nWe also know that the length is 5 feet. So we can plug that in for l: \n\n10 = 5w\n\nNow we just have to solve for w. We can do that by dividing both sides by 5: \n\n2 = w\n\nSo the width of the room is 2\n\n-->\n\n2.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: A mailman has to give 4 pieces of junk mail to each house in each of the 16 blocks. If there are 17 houses in each block How many pieces of junk mail should he give in total?\nA:",
    "output": "There are 16 blocks. \nEach block has 17 houses. \nEach house gets 4 pieces of junk mail. \n\nSo, we can say that there are 16 * 17 = 272 houses in total. \nEach house gets 4 pieces of junk mail, so there are 272 * 4 = 1088 pieces of junk mail in total.\n\n-->\n\n1088.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Winter is almost here and most animals are migrating to warmer countries. There are some bird families living near the mountain. 20 bird families flew away for winter while 14 bird families stayed behind. How many bird families were living near the mountain at the start?\nA:",
    "output": "There are 20 bird families that flew away for winter. \nThere are 14 bird families that stayed behind. \nThat means that there were a total of 34 bird families living near the mountain.\n\n-->\n\n34.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: 62 campers went rowing in the morning. 39 campers went rowing in the afternoon. How many more campers went rowing in the morning than in the afternoon?\nA:",
    "output": "There were a total of 62 campers rowing in the morning. \n39 campers went rowing in the afternoon. \nThis means that there were 23 more campers rowing in the morning than in the afternoon.\n\n-->\n\n23.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: In a school there are 315 girls and 309 boys. There are also 772 teachers How many people are there in that school?\nA:",
    "output": "There are 315 girls in the school. \nThere are 309 boys in the school. \nThere are 772 teachers in the school. \n\nAdding 315 + 309 + 772 gives us a total of 1,396 people in the school.\n\n-->\n\n1396.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel had to complete 11 pages of math homework, 2 pages of reading homework and 3 more pages of biology homework. How many more pages of math homework than biology homework did she have?\nA:",
    "output": "First, we need to find out how many pages of homework Rachel had in total. We can do this by adding up all of the pages she had to do for each subject:\n\n11 pages of math homework + 2 pages of reading homework + 3 pages of biology homework = 16 pages of homework in total\n\nNext, we need to find out how many more pages of math homework than biology homework Rachel had. We can do this by subtracting the number of pages of biology homework from the number of pages of math homework:\n\n11 pages of math homework - 3 pages of biology homework = 8 more pages of\n\n-->\n\n8.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Adam has 3 more apples than jackie. Adam has 9 apples. How many apples does Jackie have?\nA:",
    "output": "Adam has 3 more apples than Jackie. This means that if we start with the number of apples Jackie has, and add 3, we will get the number of apples Adam has. So:\n\nJackie has 9 apples.\n\nAdam has 9 apples.\n\nJackie has 6 apples.\n\n-->\n\n6.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel picked 3 ripe apples from her tree. Now the tree has 2 ripe apples and 27 unripe apples. How many ripe apples did the tree have to begin with?\nA:",
    "output": "Rachel picked 3 ripe apples from her tree. \nThat means that before she picked any apples, there were 3 ripe apples and some number of unripe apples on the tree. \nNow the tree has 2 ripe apples and 27 unripe apples. \nThat means that in total, the tree had 2 + 3 = 5 ripe apples and 27 + some number = some number unripe apples. \n\nWe can set up the equation 5 + some number = some number and solve for some number. \n\n5 + some number = some number\n5 = 0\nsome number = 5\n\n-->\n\n5.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Rachel had to complete 4 pages of reading homework, 7 pages of math homework and 19 more pages of biology homework. How many more pages of math homework than reading homework did she have?\nA:",
    "output": "First, we need to find out how many pages of homework Rachel had in total. We can do this by adding up all of the pages she had to do: 4 + 7 + 19 = 30. \n\nNext, we need to find out how many pages of reading homework Rachel had. We already know that she had 4 pages of reading homework, so we don't need to do any more work. \n\nNow we need to find out how many pages of math homework Rachel had. We already know that she had 7 pages of math homework, so we don't need to do any more work.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: After resting they decided to go for a swim. The depth of the water is 9 times Dean's height. If Ron is 15 feet tall and Dean is 6 feet shorter than Ron How deep was the water?\nA:",
    "output": "Ron is 15 feet tall. \nDean is 6 feet shorter than Ron. \nThis means that Dean is 9 feet tall. \nThe depth of the water is 9 times Dean's height. \nThis means that the depth of the water is 9 times 9 feet, or 81 feet.\n\n-->\n\n81.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Friends of Katie had 57 games and she had 63 ds games. How many more games does Katie have than her friends?\nA:",
    "output": "First, we need to find out how many games in total there are. We can do this by adding 57 and 63. \n\n57 + 63 = 120\n\nThen, we need to find out how many games Katie has. We can do this by subtracting her friends' games from the total games. \n\n120 - 57 = 63\n\nKatie has 63 games.\n\n-->\n\n6.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Luke scored 84 points after playing 2 rounds of a trivia game. If he gained the same number of points each round How many points did he score per round?\nA:",
    "output": "We know that Luke scored 84 points in total. \nWe know that he gained the same number of points each round. \nWe want to know how many points he scored per round. \n\nWe can set up an equation to solve this problem. \n\n84 = 2x \n\nWe can divide both sides by 2 to solve for x. \n\nx = 42 \n\nLuke scored 42 points per round.\n\n-->\n\n42.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Paige was helping her mom plant flowers and together they planted 36 seeds. They put 12 seeds in each flower bed and only 58 seeds grew into flowers in each flower bed. How many flower beds did they have?\nA:",
    "output": "We know that Paige and her mom planted 36 seeds. \nWe know that they put 12 seeds in each flower bed. \nWe know that 58 seeds grew into flowers in each flower bed. \n\nFrom this, we can infer that they had 3 flower beds.\n\n-->\n\n3.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: At the zoo, a cage had 3 snakes and 75 alligators. If 82 snakes and 19 alligators were hiding How many alligators were not hiding?\nA:",
    "output": "There are a total of 3 snakes and 75 alligators in the cage. \n\n82 snakes and 19 alligators are hiding. \n\nThat means that a total of 105 animals are hiding. \n\n3 snakes + 75 alligators = 78 animals \n\n78 animals + 105 animals hiding = 183 animals \n\nThere are 183 animals in the cage. \n\n82 snakes are hiding, which means that there are a total of 3 + 82 = 85 snakes in the cage. \n\nThat means that 75 - 19 = 56 alligators are not hiding.\n\n-->\n\n56.0 END"
  },
  {
    "input": "Infer the correct answer for the question.\n\nQ: Mary is baking a cake. The recipe calls for 7 cups of sugar and 10 cups of flour. She already put in 4 cups of sugar. How many more cups of sugar does she need to add?\nA:",
    "output": "First, we need to realize that Mary has already put in 4 cups of sugar into the cake. \nThis means that she only needs 3 more cups of sugar to add in order to have a total of 7 cups of sugar in the cake.\n\n-->\n\n3.0 END"
  }
]